{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/supercars-christchurch", "title": "Supercars Christchurch Super 440", "description": "Ōtautahi Christchurch is geared up to welcome the Repco Supercars Championship to Ruapuna Motorsport Park. Ruapuna Motorsport Park, Christchurch As Australasia’s premier touring car series, Supercars promises high-octane action, fierce competition and an unforgettable experience — and we can’t wait to see it all unfold right here in Christchurch in 2026. For the first time, drivers will battle it out on the iconic South Island circuit — led by Kiwi star Matt Payne, winner of the Jason Richards Memorial Trophy and now Bathurst 1000 champion. Fans from across Aotearoa can rally trackside to cheer on their 'King of the Mountain. ' Multiple transport options will be available to make getting to Ruapuna Raceway easy and hassle-free over the event weekend. . As Christchurch prepares to host Supercars, Ruapuna Raceway is undergoing targeted upgrades to meet track safety standards for its inaugural year. Led by the Canterbury Car Club and supported by Christchurch City Council, ChristchurchNZ, and Supercars, the immediate focus is on ensuring the circuit complies with all safety requirements for drivers and spectators. Infrastructure enhancements will continue in subsequent years, building on this foundation to elevate the venue into a world-class motorsport destination. An accessible viewing area will be located between turn 10 and turn 11, near gate B. Please purchase a Trackside General Admission ticket and email to advise your requirements. The venue is a mix of sealed roads, dirt roads and grass. Viewing areas around the track are all raised above the racetrack, and therefore, there is a requirement to navigate inclines and descents around the venue. Corporate tickets can be purchased for the Engine Room, which caters to those using a wheelchair. There are also a number of wheelchair-friendly toilets in the precinct. Accessible parking will be located in the premium carpark. There are limited carparks in this location, which will be on a first-come, first-served basis. Spectators parking here will need to show a valid ticket to the event (including all passengers in the vehicle) and a valid NZ mobility parking permit clearly displayed on the front windscreen of the vehicle. Entry to this carpark for valid mobility car parking permits is free. If the carpark is full, patrons can head to the public carpark or to the park n ride at the Canterbury Agricultural Park (A&P showgrounds, 102 Curletts Road, Sockburn, Christchurch). Accessible buses will be operating throughout the day. Check back here for updates as more action unfolds in the lead-up to . Event starts in What's On", "dates": {"start": "2026-04-17", "end": "2026-04-19", "text": "17 - 19 April 2026"}, "price": null, "location": "Ruapuna Motorsport Park, Christchurch", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1394/ab4dc65034/super-cars.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:10Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/lexus-urban-polo", "title": "Lexus Urban Polo", "description": "The Lexus Urban Polo® returns to the beautiful Hagley Park, Christchurch on Saturday, 21 February 2026. Get amongst all the action on and off the field. Hagley Park, Christchurch This is an R18 event, 12:00 – 7:30pm • Doors open 12:00pm Get amongst all the action on and off the field. Watch thrilling, fast paced polo matches, stomp the divots, try polo for yourself on top of our hitting boxes, meet the polo players, check out our epic DJ line-up on the main stage, enjoy the delicious offerings from our food and beverage partners or try out one of the activations. Tickets on sale now for General Admission, VIP and Corporate Hosting in our Private Marquees. It’s truly an experience like no other! The Lexus Urban Polo® starts in What's On", "dates": {"start": "2026-02-21", "end": "2026-02-21", "text": "21 February 2026"}, "price": null, "location": "Hagley Park, Christchurch | This is an R18 event, 12:00 – 7:30pm • Doors open 12:00pm", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/2000x1333/656a7f5aa1/lexus-urban-polo.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/the-art-of-banksy", "title": "The Art of Banksy", "description": "Enjoy over 150 original artworks, prints, and installations by the elusive street artist. This is your final chance to experience Banksy’s most iconic pieces in New Zealand. Te Pae Christchurch Convention Centre The world-famous exhibition, The Art of Banksy, is coming to Christchurch this summer at Te Pae Christchurch Convention Centre. With over 150 original artworks, prints, and installations by the elusive street artist, this is your final chance to experience Banksy’s most iconic and thought-provoking pieces in Aotearoa NZ. From Girl with Balloon (Gold Edition) to Flower Thrower, this is an unmissable opportunity to get up close to authenticated Banksy artworks. Over 150 pieces on display Iconic thought-provoking art Event starts in What's On", "dates": {"start": null, "end": null, "text": "17 December 2025 - 27 January 2026 (excluding public holidays)"}, "price": null, "location": "Te Pae Christchurch Convention Centre", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1414/569032351a/banksy.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/west-indies-v-blackcaps", "title": "West Indies v BLACKCAPS", "description": "Caribbean flair meets Kiwi fire. The BLACKCAPS face the West Indies in the first Test Match of the series. Hagley Oval, Christchurch Big hits. Big names. Big series. Feel the electric atmosphere, soak up the summer vibes, and enjoy world-class cricket right here at home. Hagley Oval’s stunning setting offers the perfect backdrop for world-class cricket and an unforgettable summer. Event starts in What's On", "dates": {"start": "2025-12-02", "end": "2025-12-06", "text": "2 - 6 December 2025"}, "price": null, "location": "Hagley Oval, Christchurch", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1320/279a3368a1/black-caps.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/super-rugby-pacific-super-round", "title": "Super Rugby Pacific - Super Round", "description": "Super Round heads to New Zealand for the first time, opening One New Zealand Stadium Christchurch. One New Zealand Stadium, 218 Madras Street, Christchurch Super Round is a festival weekend of Super Rugby Pacific where every team plays at the same venue. Across three days over ANZAC weekend, fans enjoy multiple matches in Ōtautahi Christchurch - it’s rugby’s biggest celebration. Event starts in What's On", "dates": {"start": "2026-04-24", "end": "2026-04-26", "text": "24 - 26 April 2026"}, "price": null, "location": "One New Zealand Stadium, 218 Madras Street, Christchurch", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/2400x1349/c6a15107bf/one-new-zealand-stadium.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/new-years-eve", "title": "New Years Eve", "description": "Ring in the new year at North Hagley Park with family friendly fun. With a ‘kids countdown’ from 4-7pm, followed by a New Years Eve party from 8pm - midnight featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora. North Hagley Park Say hello to 2026 with New Years Eve celebrations in North Hagley Park. - powered with Hydrate by IHF, is kicking off the New Year’s Eve celebrations early with a special kids’ event that your whānau won’t want to miss. Join the fun without having to stay out late! - featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora, all MCed by Henare Kaa. Event starts in What's On", "dates": {"start": "2025-12-31", "end": "2025-12-31", "text": "31 December 2025"}, "price": null, "location": "North Hagley Park", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1320/3c095dd727/whats-on-new-years-eve.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/world-buskers-festival", "title": "World Buskers Festival", "description": "Get amongst the fun this summer as the World Buskers Festival returns to Ōtautahi Christchurch for ten days of street performance, ticketed shows, and pop-up surprises across the city. Multiple venues across the city This summer the streets of Ōtautahi Christchurch come alive with laughter, spectacle, and the kind of unexpected moments that make the World Buskers Festival one of our most loved festivals. From Friday, 23 January to Sunday, 1 February 2026, across the five city pitches and two pop-up locations, the festival blends the best of international street talent with the creativity and spirit of homegrown performers. Expect jaw-dropping acrobatics, cheeky comedy, world-class circus acts, and unforgettable moments in every corner of the central city. Buskers near the Bridge of Remembrance Crowd at the World Buskers Festival Buskers in City Mall Event starts in What's On", "dates": {"start": null, "end": null, "text": "23 January - 1 February 2025"}, "price": null, "location": "Multiple venues across the city", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1320/e4187db72a/buskers-performing-in-cashel-mall.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:12Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/crankworx-christchurch", "title": "Crankworx Christchurch", "description": "Crankworx Christchurch 2026 is coming in hot! From 19 - 22 February, Crankworx returns to the Christchurch Adventure Park. Be part of the action. Christchurch Adventure Park From 19 - 22 February, the world’s best mountain bikers will descend on Christchurch Adventure Park for a four-day celebration of speed, skill, and the wild side of MTB. Expect action-packed events, family-friendly vibes, and the electric festival atmosphere Crankworx is known for, all set against Canterbury’s iconic Port Hills. Whether you’re a die-hard fan or just keen for an epic summer day out, tickets are on sale now, with options for fans of all ages. Don’t miss your chance to witness gravity-defying talent right here in Ōtautahi. Event starts in What's On", "dates": {"start": "2026-02-19", "end": "2026-02-22", "text": "19 - 22 February 2026"}, "price": null, "location": "Christchurch Adventure Park", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1920x1261/8d3058affa/crankworx-ctrahan-cwx-ss-ch-slope-finals.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:12Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/nz-squash-open", "title": "NZ Squash Open", "description": "Get ready for world-class action as the NZ Squash Open returns in 2026! This premier international tournament will showcase the world’s top professional players alongside New Zealand’s rising stars, all competing for glory on court. Isaac Theatre Royal, Christchurch Expect fast-paced rallies, breath-taking skill, and an electric atmosphere as Christchurch hosts the biggest squash event in the country. With men’s and women’s draws stacked with talent, every match promises drama, intensity, and unforgettable moments. Whether you’re a passionate squash fan or new to the sport, the NZ Squash Open is an event you won’t want to miss. Secure your seats today and be part of the excitement as history is made on the glass court! Event starts in What's On", "dates": {"start": "2026-03-03", "end": "2026-03-08", "text": "3 - 8 March 2026"}, "price": null, "location": "Isaac Theatre Royal, Christchurch", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1322/4fc33c7850/nz-squash-open.jpg/m/1200x630", "updated_at": "2025-12-03T01:18:12Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/wednesday-at-one-recital-series-12897", "title": "Wednesday at One Recital Series", "description": "Music | Performance A lunchtime recital series with a wide range of performers in a superb acoustic with a Steinway concert grand or four-manual organ. 373 Manchester Street Paid event Wednesday at One is a popular weekly lunchtime recital series in the Catholic Pro-Cathedral, or CBS Music Centre. Where a light lunch is available before each concert. A wide range of performers is featured, in a superb acoustic, often using the Steinway concert grand piano, or the four-manual Rodgers Infinity Platinum hybrid pipe/digital organ. Groups range in size from small chamber ensembles to full symphonic orchestras, with a particular focus on encouraging young performers and inviting citizens into the central city Catholic church. $15 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12897 managed by ccc.", "dates": {"start": null, "end": null, "text": "3 Dec 2025 - 10 Dec 2025 | 1:10 pm - 2:00 pm"}, "price": "$15", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:15Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/canterbury-womens-catchball-lyttelton-13282", "title": "Canterbury Women's Catchball | Lyttelton", "description": "Performance Catchball is a team sport for all women, like volleyball. It emphasises wellbeing and socialisation. We welcome participants of all skill levels and abilities. 25 Winchester Street , Lyttelton Recreation Centre Paid event Requiring fewer skills and less physical demand than volleyball, making it a safer and more welcoming option for women with varying fitness levels. It’s a great game for players whose age, skill level, or life commitments may prevent them from participating in other team sports. Everyone can engage at their own pace. Catchball also has a strong social focus, with teams often getting together for fun events. It’s a wonderful opportunity to exercise and make friends in a positive, inclusive environment. Our teams provide a beginner-friendly and positive environment both during practice and social time. We welcome new players and anyone wanting to try catchball at any time during the term. Free - $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13282 managed by ccc.", "dates": {"start": null, "end": null, "text": "3 Dec 2025 - 18 Dec 2025 | 6:00 pm - 7:30 pm"}, "price": "$10", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:15Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/tiki-taniwha-aroha-by-mandy-joass-13238", "title": "Tiki Taniwha Aroha by Mandy Joass", "description": "Exhibition | Libraries Mandy Joass’s practice has been shaped by a profound journey of reconnection with whakapapa, guided by the enduring presence of her kuia and tūpuna wahine. 141 Percival Street , Chamber Gallery Rangiora Free event Since graduating with a Bachelor of Fine Arts in Sculpture from Ilam School of Fine Arts in 2015, Mandy Joass has exhibited in more than 30 shows, including New Zealand Sculpture on Shore (2016/2018) and Waiheke Sculpture on the Gulf (2019). Her practice has been shaped by a profound journey of reconnection with whakapapa, guided by the enduring presence of her kuia, Cherry Agnes Joass, and tūpuna wahine, Cecily Ruby Russell McManus- her paternal grandmother and great-grandmother. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13238 managed by ccc.", "dates": {"start": null, "end": null, "text": "3 Dec 2025 - 11 Dec 2025"}, "price": null, "location": "See website for details", "categories": ["Exhibition", "Libraries"], "image": null, "updated_at": "2025-12-03T01:18:15Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/black-caps-v-west-indies-test-match-12854", "title": "Black Caps v West Indies Test Match", "description": "Central City | Live Sun, mates, vibes and some cricket to tie it all together. The Black Caps face the West Indies in a Test match at Hagley Oval! Paid event Big hits. Big names. Big series. Feel the electric atmosphere, soak up the summer vibes, and enjoy world-class cricket right here at home. It’s the perfect day out for whānau, mates, or anyone who loves the game. These matches will be crowd favourites – secure your tickets now! $15 - $90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12854 managed by ccc.", "dates": {"start": null, "end": null, "text": "3 Dec 2025 - 6 Dec 2025 | 11:00 am - 12:00 am"}, "price": "$15 - $90", "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:18:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/cbd-business-networking-872557", "title": "CBD Business Networking", "description": "Business & Professional 33 Wordsworth Street, Christchurch Just Desserts, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872557 managed by eventfinda.", "dates": {"start": "2025-12-03T07:30:00", "end": "2025-12-03T08:30:00", "text": "3 Dec 2025 | 7:30 am - 8:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/hornby-business-networking-wednesday-730am-meeting-872560", "title": "Hornby Business Networking Wednesday 7.30am Meeting", "description": "Business & Professional 16 Chappie Place, Hornby, Christchurch Columbus Coffee Hornby, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872560 managed by eventfinda.", "dates": {"start": "2025-12-03T07:30:00", "end": "2025-12-03T08:30:00", "text": "3 Dec 2025 | 7:30 am - 8:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/merivale-business-networking-827700", "title": "Merivale Business Networking", "description": "Business & Professional 217 Papanui Rd, Merivale, Christchurch McDonald’s Merivale, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #827700 managed by eventfinda.", "dates": {"start": "2025-12-03T07:30:00", "end": "2025-12-03T08:30:00", "text": "3 Dec 2025 | 7:30 am - 8:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/national-concerto-competition-preliminaries-and-semi-final-13418", "title": "National Concerto Competition Preliminaries and Semi-Final", "description": "Music | Performance The 2025/2026 National Concerto Competition is a musical competition for young people aged 25 years and under. This year is instrumental with 62 contestants. 156 Armagh Street , The Piano Paid event Our renowned National Concerto Competition is an amazing opportunity for a group of New Zealand’s best young instrumentalists, and it takes place every year in Christchurch. This year we have 62 contestants (a record number) competing for the 6 semi-finalists places and then ultimately to become one of the 3 finalists in March 2026. Works performed in the preliminaries include well-known violin concertos by Mendelssohn, Sibelius and Bruch and cello favourites by Dvorak, Elgar and Tchaikovsky. This will be intermingled with woodwind and brass concertos featuring flute, bassoon, oboe, clarinet trumpet and marimba. The Adjudicators for the competition are: $5 - $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13418 managed by ccc.", "dates": {"start": "2025-12-03T09:00:00", "end": "2025-12-03T21:30:00", "text": "3 Dec 2025 | 9:00 am - 9:30 pm"}, "price": "$5 - $25", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/talk-business-networking-900392", "title": "Talk Business Networking", "description": "Business & Professional 68 Harewood Rd, Christchurch Papanui Methodist Church, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #900392 managed by eventfinda.", "dates": {"start": "2025-12-03T09:00:00", "end": "2025-12-03T10:00:00", "text": "3 Dec 2025 | 9:00 am - 10:00 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/taonga-the-pounamu-experience-894510", "title": "Taonga: The Pounamu Experience", "description": "Arts and Crafts 180 Avonside drive , Avonside, Christchurch Climate Action Campus, Christchurch $285.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #894510 managed by eventfinda.", "dates": {"start": "2025-12-03T09:00:00", "end": "2025-12-03T13:00:00", "text": "3 Dec 2025 | 9:00 am - 1:00 pm"}, "price": null, "location": "180 Avonside drive , Avonside, Christchurch | Climate Action Campus, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:18Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/papanui-business-networking-872559", "title": "Papanui Business Networking", "description": "Business & Professional 1 Papanui Rd, Christchurch Carlton Bar & Eatery, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872559 managed by eventfinda.", "dates": {"start": "2025-12-03T09:30:00", "end": "2025-12-03T10:30:00", "text": "3 Dec 2025 | 9:30 am - 10:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:18Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/wigram-business-networking-872558", "title": "Wigram Business Networking", "description": "Business & Professional 100 The Runway, Wigram, Christchurch The Good Home, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872558 managed by eventfinda.", "dates": {"start": "2025-12-03T09:30:00", "end": "2025-12-03T10:30:00", "text": "3 Dec 2025 | 9:30 am - 10:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:18Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/twelve-days-of-christmas-at-the-cathedral-13202", "title": "Twelve Days of Christmas at the Cathedral", "description": "Central City You are warmly invited behind the fences and inside the Cathedral to see the City Mission Tree this Christmas. 100 Cathedral Square , Christ Church Cathedral Donation/koha The Twelve Days of Christmas event will offer a chance to go inside the Cathedral weekdays from December 1 - 16 for up to 50 visitors at a time. All proceeds go to the City Mission. Erecting and lighting the tree has been achieved at no cost to Christ Church Cathedral Reinstatement Limited (CCRL), or the City Mission, thanks to the generous support of Christchurch businesses. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13202 managed by ccc.", "dates": {"start": null, "end": null, "text": "3 Dec 2025 - 16 Dec 2025 | 10:30 am - 11:15 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:19Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/midday-meditations-906467", "title": "Midday Meditations", "description": "Mind & Body 52 Bealey Avenue, Christchurch Cherish, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #906467 managed by eventfinda.", "dates": {"start": "2025-12-03T13:00:00", "end": "2025-12-03T13:30:00", "text": "3 Dec 2025 | 1:00 pm - 1:30 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:19Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/guided-tour-whaia-te-taniwha-13443", "title": "Guided Tour Whāia te Taniwha", "description": "Central City | Tour We would love you to come and join Pouarataki curator Chloe Cull for a free guided tour of this exciting exhibition. Free event learn insights into the taniwha Exhibition. Image: Kahurangiariki Smith Ride or Die (still) 2024. Digital animation. Courtesy of the artist Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13443 managed by ccc.", "dates": {"start": "2025-12-03T14:00:00", "end": "2025-12-03T14:40:00", "text": "3 Dec 2025 | 2:00 pm - 2:40 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Tour"], "image": null, "updated_at": "2025-12-03T01:18:19Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/family-and-tamariki-art-safari-13444", "title": "Family and Tamariki - Art Safari", "description": "Central City Bring your pre-schooler along for a fun artmaking session. Free event Fun activities for 2-4yr olds. Why not then stay for Storytime at 10.30am presented by Tūranga. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13444 managed by ccc.", "dates": {"start": "2025-12-04T10:00:00", "end": "2025-12-04T00:00:00", "text": "4 Dec 2025 | 10:00 am - 12:00 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:19Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/cubbin-concert-11302", "title": "Cubbin Concert", "description": "Music | Performance Join Cubbin Theatre Company and friends for a concert of original Cubbin tunes and some festive surprises! Paid event Cubbin Concerts are a creative, joyous musical experience for you and your little ones, tailored especially for very young audiences. Come and join us to celebrate summer and kick off the Christmas holiday season! For what to expect when you come to the show, please visit our FAQs on our website. Cubbin Concert is suitable for children up to 7 years old. This season is kindly supported by Creative New Zealand. 20.70 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11302 managed by ccc.", "dates": {"start": "2025-12-04T10:00:00", "end": "2025-12-04T10:45:00", "text": "4 Dec 2025 | 10:00 am - 10:45 am"}, "price": null, "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:20Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/ferrymead-business-networking-872555", "title": "Ferrymead Business Networking", "description": "Business & Professional 3 McCormacks Bay Road, Mt Pleasant Barista Binks Cafe, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872555 managed by eventfinda.", "dates": {"start": "2025-12-04T09:30:00", "end": "2025-12-04T10:30:00", "text": "4 Dec 2025 | 9:30 am - 10:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:20Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/elmwood-business-networking-872556", "title": "Elmwood Business Networking", "description": "Business & Professional 1 Norman Road, Strowan, Christchurch Elmwood Trading Co, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872556 managed by eventfinda.", "dates": {"start": "2025-12-04T09:30:00", "end": "2025-12-04T10:30:00", "text": "4 Dec 2025 | 9:30 am - 10:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:20Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/riccarton-thursdays-business-networking-872554", "title": "Riccarton Thursdays Business Networking", "description": "Business & Professional 88 Division St, Christchurch Harcourts Phoenix, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872554 managed by eventfinda.", "dates": {"start": "2025-12-04T09:15:00", "end": "2025-12-04T10:15:00", "text": "4 Dec 2025 | 9:15 am - 10:15 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:20Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/city-fringe-business-networking-872553", "title": "City Fringe Business Networking", "description": "Business & Professional 234 St Asaph Street, Christchurch Lemon Tree Cafe, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872553 managed by eventfinda.", "dates": {"start": "2025-12-04T07:30:00", "end": "2025-12-04T08:30:00", "text": "4 Dec 2025 | 7:30 am - 8:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:21Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/9-to-5-the-musical-13383", "title": "9 to 5 The Musical", "description": "Live | Performance Tumble outta bed and stumble to the New Zealand premiere season of Dolly Parton’s blockbuster musical comedy! Paid event With a rip-roaring score by the Queen of Country, 9 to 5 The Musical tells the story of three workmates pushed to boiling point by their sexist and egotistical boss. Concocting a plan to kidnap and turn the tables on their despicable supervisor, will the ladies manage to reform their office, or will events unravel when the CEO pays an unexpected visit? Inspired by the iconic 80s film and brought to you by Dolly herself, this hilarious new production is about teaming up, standing up, and taking care of business! Running until 1 February 2026, this smash-hit musical is the most fun you’ll have at the theatre all year! “Packed with laughs as big as Dolly’s personality.” – Daily Mirror “This is one 9 to 5 you’ll want to do again and again.” – The Sun “Surrender to the silly, stupid, schlocky joy of it all, you’re most definitely in for a good night.” – Time Out $47 - $129 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13383 managed by ccc.", "dates": {"start": "2025-12-03T19:30:00", "end": "2025-12-03T22:00:00", "text": "3 Dec 2025 | 7:30 pm - 10:00 pm"}, "price": "$47 - $129", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:21Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/group-singing-lessons-13213", "title": "Group Singing Lessons", "description": "Music | Performance Learning Christmas Carols in 4-part harmony with this women's chorus. 113 Beachville Road , Redcliffs Primary School Paid event This women's chorus is dedicated to enriching the lives of members and the community through friendship, education, performance and barbershop musical excellence. You will also have the opportunity to join us in Christmas Carol singouts around Christchurch City in November and December. Barbershop singing is four-part harmony a cappella music that is deliberately voiced and arranged with musical chords that lock and ring to produce overtones and a spine-chilling thrill for the singer and listener. The Christchurch City Chorus was founded in 1985 and is directed by Master Director Virginia Humphrey-Taylor. The Chorus has over 100 members of varying ages, with singers from all over New Zealand, and some from as far afield as Australia too. $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13213 managed by ccc.", "dates": {"start": "2025-12-03T19:00:00", "end": "2025-12-03T21:00:00", "text": "3 Dec 2025 | 7:00 pm - 9:00 pm"}, "price": "$10", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:21Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/stitching-stories-bookbinding-workshop-13440", "title": "Stitching Stories - Bookbinding workshop", "description": "Central City Make a small book for your drawings, writings, poetry or archival gems in these two individual bookbinding workshops with Yinghua Jiang. Paid event Join Yinghua Jiang in creating two small books for your drawings, notes and more. Jiang will be creating two different books over two workshops. What a wonderful gift to make and or keep. Suitable for beginners. $15 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13440 managed by ccc.", "dates": {"start": "2025-12-03T18:00:00", "end": "2025-12-03T20:00:00", "text": "3 Dec 2025 | 6:00 pm - 8:00 pm"}, "price": "$15", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:22Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-tannery-christmas-market-13321", "title": "The Tannery Christmas Market", "description": "Celebrate the festive season with us! Step into the spirit of the season at our annual Tannery Christmas Market, a festive day of shopping, music, and cheer. 3 Garlands Road , The Tannery Free event Step into the spirit of the season at our annual Tannery Christmas Market, a festive day of shopping, music, and cheer From 10am to 9pm, explore a curated selection of local vendors — perfect for ticking off your Christmas list while supporting small businesses. Enjoy the festive buzz throughout The Atrium, with live music, complimentary canapés, and a festive bar open from 5pm–8:30pm. Join us for a day to night celebration filled with festive sparkle, community spirit, and one-of-a-kind gifts that make Christmas truly special. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13321 managed by ccc.", "dates": {"start": "2025-12-04T10:00:00", "end": "2025-12-04T21:00:00", "text": "4 Dec 2025 | 10:00 am - 9:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:22Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/fun-with-felt-13363", "title": "Fun with Felt", "description": "Central City Design your very own festive decoration using colourful sequins, beads, and embroidery stitches on a felted shape. Paid event Design your very own festive decoration using colourful sequins, beads, and embroidery stitches on a felted shape. Choose your colours, add your personal touch, and create something truly one-of-a-kind to hang proudly on the tree or gift to someone special. $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13363 managed by ccc.", "dates": {"start": "2025-12-06T10:00:00", "end": "2025-12-06T11:15:00", "text": "6 Dec 2025 | 10:00 am - 11:15 am"}, "price": "$25", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:22Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christmas-gifts-making-textured-pendantsearrings-906991", "title": "Christmas Gifts-making - Textured Pendants/Earrings", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $128.00 $115.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #906991 managed by eventfinda.", "dates": {"start": "2025-12-06T10:00:00", "end": "2025-12-06T13:00:00", "text": "6 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christchurch-south-community-gardens-market-day-13510", "title": "Christchurch South Community Gardens Market Day", "description": "Environment | Sustainability We're having a fundraising market day this Saturday to celebrate summer! Selling Plants, Produce and Preserves 188 Strickland Street , Christchurch South Community Gardens Free event We are selling a seasonal selection of Plants, Produce and Preserves including: Come along and check out out what we're selling and learn about our mahi. New volunteers and trustees are always welcome! Find out more at Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13510 managed by ccc.", "dates": {"start": "2025-12-06T10:00:00", "end": "2025-12-06T13:00:00", "text": "6 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "See website for details", "categories": ["Environment", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:18:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/riverlution-farmers-market-12747", "title": "Riverlution Farmers Market", "description": "Central City | Food After a great run of markets last season, we're excited to be back for another Riverlution Market! 46A Vogel Street , Riverlution Free event Come and explore a wonderful selection of seasonal produce, artisan breads, and handcrafted treats, all created with love by local growers and makers. Enjoy the vibrant atmosphere with live music, a delicious coffee from Riverlution Café, and a great community vibe! Set in the heart of Richmond Community Garden, right by the new City to Sea Pathway and Avebury’s exciting new playground, this market is the perfect way to support local sustainability, meet your neighbours, and enjoy a relaxing morning outdoors. Whether you’re stocking up on fresh goodies, enjoying a coffee with friends, or simply soaking in the atmosphere, there’s something for everyone! Let’s continue growing this into a thriving community tradition—we can’t wait to see you there! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12747 managed by ccc.", "dates": {"start": "2025-12-06T09:00:00", "end": "2025-12-06T12:30:00", "text": "6 Dec 2025 | 9:00 am - 12:30 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Food"], "image": null, "updated_at": "2025-12-03T01:18:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/macro-flower-photography-workshops-for-beginners-912551", "title": "Macro Flower Photography Workshops for Beginners", "description": "Education Rolleston Ave, Christchurch Christchurch Botanic Gardens, Christchurch $160.00 $150.00 $130.00 $120.00 $160.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #912551 managed by eventfinda.", "dates": {"start": "2025-12-06T07:00:00", "end": "2025-12-06T08:30:00", "text": "6 Dec 2025 | 7:00 am - 8:30 am"}, "price": null, "location": "Rolleston Ave, Christchurch | Christchurch Botanic Gardens, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christmas-at-avebury-13425", "title": "Christmas at Avebury", "description": "Live | Music Join us for some Christmassy carols, games and kai. Come get a Santa selfie and chill out with us as we take a breather during the Xmas chaos. 9 Eveleyn Couzins Avenue , Avebury House Free event It’s been a big year of events, so for Christmas this year, instead of another market, we thought we’d keep it more casual and community. We’d love you to join us for some Christmassy carols, games and kai. Come get a Santa selfie and chill out with us as we take a breather during the Xmas chaos. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13425 managed by ccc.", "dates": {"start": "2025-12-05T15:30:00", "end": "2025-12-05T19:00:00", "text": "5 Dec 2025 | 3:30 pm - 7:00 pm"}, "price": null, "location": "See website for details", "categories": ["Live", "Music"], "image": null, "updated_at": "2025-12-03T01:18:24Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/50s-up-brass-in-concert-kaiapoi-13061", "title": "50's Up Brass in Concert | Kaiapoi", "description": "Music | Performance 50’s Up Brass will be hitting the road around Christchurch with our much-loved Christmas Concert Tour. 113 Raven Quay , Kaiapoi Club Paid event It’s one of the happiest times of the year for the band, and we can’t wait to share festive tunes, carols, and Christmas cheer with you all. $5 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13061 managed by ccc.", "dates": {"start": "2025-12-05T14:00:00", "end": "2025-12-05T15:30:00", "text": "5 Dec 2025 | 2:00 pm - 3:30 pm"}, "price": "$5", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:24Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/new-brighton-business-networking-872551", "title": "New Brighton Business Networking", "description": "Business & Professional 16a Beach Road, North New Brighton, Christchurch Beach Cafe & Wine Bar, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872551 managed by eventfinda.", "dates": {"start": "2025-12-05T09:15:00", "end": "2025-12-05T10:15:00", "text": "5 Dec 2025 | 9:15 am - 10:15 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/late-night-shopping-13374", "title": "Late Night Shopping", "description": "Central City Get into the Christmas spirit with late-night shopping in Boys’ High at The Arts Centre! Tick off your Christmas gift list while soaking up the atmosphere. Free event Get into the Christmas spirit with late-night shopping in Boys’ High at The Arts Centre! Tick off your Christmas gift list while soaking up the lively atmosphere — enjoy tasty bites from food trucks, a festive drink from Altiora’s bar, and explore our beautiful boutique retail stores brimming with unique, locally made treasures. It’s the perfect way to combine shopping, socialising, and a little seasonal cheer! Summer Breeze Saxophone Quartet will be playing from 6 - 8pm in the Laneways to bring a touch of Christmas magic. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13374 managed by ccc.", "dates": {"start": "2025-12-05T09:00:00", "end": "2025-12-05T20:00:00", "text": "5 Dec 2025 | 9:00 am - 8:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/canoe-polo-inter-regional-championships-13499", "title": "Canoe Polo Inter Regional Championships", "description": "The best players from all corners of NZ will compete in this biannual battle of the regions at Roto Kohatu. Highly skilled and fast paced action. 1 Outlook Place , Roto Kohatu Free event Canoe polo is a fast paced five aside game. Over 20 minutes, teams compete for the ball to shoot into a goal suspended 2m above the ball. It is highly technical and skilled, involving tackling, passing, sprinting, and scoring goals. Collisions and pushing players over is part of the fun. Four regions have selected their best players in five different age categories for open and women’s grades. The region with the most points wins the overall trophy. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13499 managed by ccc.", "dates": {"start": null, "end": null, "text": "5 Dec 2025 - 7 Dec 2025 | 9:00 am - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/business-networking-872552", "title": "Business Networking", "description": "Business & Professional 345 Mairehau Road, Parklands Wetlands Eatery, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872552 managed by eventfinda.", "dates": {"start": "2025-12-05T08:00:00", "end": "2025-12-05T09:00:00", "text": "5 Dec 2025 | 8:00 am - 9:00 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/sydenham-business-networking-872550", "title": "Sydenham Business Networking", "description": "Business & Professional 33 Wordsworth Street, Christchurch Just Desserts, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872550 managed by eventfinda.", "dates": {"start": "2025-12-05T07:30:00", "end": "2025-12-05T08:30:00", "text": "5 Dec 2025 | 7:30 am - 8:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:26Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/northcote-business-networking-friday-meetings-872562", "title": "Northcote Business Networking - Friday Meetings", "description": "Business & Professional 54 Harewood Road, Christchurch Columbus Coffee, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872562 managed by eventfinda.", "dates": {"start": "2025-12-05T07:30:00", "end": "2025-12-05T08:30:00", "text": "5 Dec 2025 | 7:30 am - 8:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:26Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/december-business-growth-lunch-13245", "title": "December Business Growth Lunch", "description": "Central City | Talk Connect with like-minded professionals, enjoy a delicious lunch, and gain valuable insights to help you grow - personally and professionally. 166 Cashel Street , Elements by IHF Paid event Connect with like-minded professionals, enjoy a delicious lunch, and gain valuable insights to help you grow - personally and professionally. Let's work together to support each other and grow Christchurch! We look forward to seeing you at the November Growth Lunch! Come ready to learn, network, and make meaningful connections. If you have any questions or need additional details, don’t hesitate to reach out. $65 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13245 managed by ccc.", "dates": {"start": "2025-12-05", "end": "2025-12-05", "text": "5 Dec 2025"}, "price": "$65", "location": "See website for details", "categories": ["Central City", "Talk"], "image": null, "updated_at": "2025-12-03T01:18:26Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/glyn-macdonald-quartet-13260", "title": "Glyn MacDonald Quartet", "description": "Live | Music Experience original jazz by Glyn MacDonald and a stellar quartet, acclaimed from Beijing to Perth, blending passion, skill, and global flair live. Paid event Join the quartet featuring Jono Blackie (drums), Luke Belcher (bass), and James Lawton (tenor saxophone) as we bring to life music I composed for a Perth-based ensemble that toured to the Beijing International Jazz Festival. This music has already made waves overseas — our performance in Beijing was the only one to receive both a standing ovation and an encore at the festival. Don’t miss this chance to experience that same energy and creativity live in concert! 03 SESSIONS // Original and improvised music from Ōtautahi and beyond. Glyn MacDonald – Jazz Pianist, Composer, & Multi-Instrumentalist With a career spanning continents and genres, Glyn MacDonald stands as a versatile force in the world of music. From his early performances across Canada, England, Rome, Scotland, Wales, and Australia, Glyn's journey unfolded with a passion for jazz that never waned. A graduate in Classical Trombone and Jazz Piano from the West Australian Academy of Performing Arts, Glyn's musical prowess quickly earned recognition. Notably, his performance at the Vancouver Jazz Festival propelled him into the limelight, featured as CBC radio's Artist of the Month and culminating in three albums, including the acclaimed \"Live @The Cellar: Glyn MacDonald Trio.\" Collaborating with esteemed artists like James Morrison, Andy Firth, and Rufus Reid, Glyn's repertoire expanded, contributing to Perth's vibrant jazz scene. His recordings, including original works like \"Self-Titled 2004\" and \"Birth 2009,\" garnered rave reviews, extensive airplay, and international distribution. Transitioning seamlessly between instruments and styles, Glyn's contributions to various bands and ensembles, such as the \"Perth Jazz Orchestra,\" \"Salamander,\" and the award-winning Stratosfunk, showcased his diverse musical abilities. His journey continued with invitations to perform globally, from the Villa Cillemontana Jazz Festival in Rome to sellout shows at the Beijing International Jazz Festival. Notably, his trio graced prestigious events like the State Reception for Queen Elizabeth and the Duke of Edinburgh and later for the Prince of Belgium. As an educator, Glyn shared his expertise at renowned institutions, shaping young talents at the West Australian Academy of Performing Arts and Carey Baptist College. His commitment to music education was unwavering, reflecting his dedication to nurturing the next generation of jazz musicians. $15 - $20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13260 managed by ccc.", "dates": {"start": "2025-12-04T20:00:00", "end": "2025-12-04T21:30:00", "text": "4 Dec 2025 | 8:00 pm - 9:30 pm"}, "price": "$15 - $20", "location": "See website for details", "categories": ["Live", "Music"], "image": null, "updated_at": "2025-12-03T01:18:26Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/laugh-panel-13497", "title": "Laugh Panel", "description": "Central City | Live Join a cast of hilarious comedians as they brighten your day through an eccentric mix of live panel game rounds with Laugh Panel! Paid event Join a cast of hilarious comedians as they brighten your day through an eccentric mix of live panel game rounds with the return of Laugh Panel! Get psyched to experience more: · Multiple-microphone mayhem! · Freudian Slop (tm)! · Questionable advice! · Sound effects! · Laughs!* (*not a sound effect) Hosted by rising talent and award winning train-wreck Jarrod Cook, Laugh Panel is sure to deliver the thrills and spills you crave this silly season! Featuring exquisite panellists: · Tama Alexander · Aimée Borlase · Ben Vyas · Shen Mansell $10 - $20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13497 managed by ccc.", "dates": {"start": "2025-12-04T19:30:00", "end": "2025-12-04T21:00:00", "text": "4 Dec 2025 | 7:30 pm - 9:00 pm"}, "price": "$10 - $20", "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:18:27Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/it-happened-on-a-tuesday-13427", "title": "It Happened on a Tuesday", "description": "Live | Performance A brand new dark comedy, written and devised by the 2025 Court Theatre Youth Company and Hester Ullyart. Paid event Just an ordinary day at the end of the world. Worse, the internet is down. And bloody hell, why is it so hot? Watch out. It happened on a Tuesday. Clark and Sally just want a quiet afternoon with the kids at Willowbank. Ricky wants to be a boxer, but he’s stuck pulling pints. When a freak weather event turns Christchurch into a volatile ghost town, a set of unlikely strangers take refuge in a run-down bar. Luckily, regional tv stars David Daft and Jessica Jones from The Daily Local are on hand to cover the ongoing crisis. With mixed results. Technical and Production elements by the Court Youth Crew with grateful support from The Court Theatre production team. Directed by Hester Ullyart. Extremely limited season capacity, book now! $10 - $15 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13427 managed by ccc.", "dates": {"start": "2025-12-04T19:30:00", "end": "2025-12-04T20:30:00", "text": "4 Dec 2025 | 7:30 pm - 8:30 pm"}, "price": "$10 - $15", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:27Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/please-accept-this-rose-13314", "title": "Please Accept This Rose", "description": "Live | Performance Four comedians will try to impress a Bachelor/ette with their jokes and try not to get eliminated! Could YOU be our Bachelor/ette? 236 High Street , Austin Club Paid event It's going to be a night of belly laughter and heart breaks featuring 4 local comedians - Steve Wilbury, Dr Jo Prendergast, Grant Cattermole and Sam Jones! The best thing is, YOU could be our Bachelor/ette! $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13314 managed by ccc.", "dates": {"start": "2025-12-04T19:00:00", "end": "2025-12-04T20:30:00", "text": "4 Dec 2025 | 7:00 pm - 8:30 pm"}, "price": "$10", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:27Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/a-christchurch-carol-13146", "title": "A Christchurch Carol", "description": "Central City | Performance Little Andromeda's riotous annual Christmas Comedy returns to finish your 2025 with a bang! Paid event What the Dickens? It’s Christmas Eve in Christchurch and Ebenezer Scrooge, the Mainland's most miserly miser is moping in his office on the top floor of Harley Chambers. Through his boarded-up window he can hear half of Ōtautahi singing carols by candlelight in Victoria Square and it’s driving him crazy. Bah humbug! Surely this night can’t get any worse. The annual Andromeda Christmas Comedy is a must-see riotous end to every year, and A Christchurch Carol is no exception! Ghosts! Christopher Luxon in chains! A special guest appearance by an actor playing whoever wins the Christchurch mayoral election on October 11th! This uniquely Christchurch take on the Charles Dicken’s classic is brought to you by many of your Andromeda Christmas favourites, starring James Kupa, Reylene Rose Hilaga, and Tom Eason, written by Gregory Cooper, directed by Dan Bain, and with music by Michael Bell. $35 - $40 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13146 managed by ccc.", "dates": {"start": "2025-12-04T19:00:00", "end": "2025-12-04T20:00:00", "text": "4 Dec 2025 | 7:00 pm - 8:00 pm"}, "price": "$35 - $40", "location": "See website for details", "categories": ["Central City", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:28Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/analog-club-11889", "title": "Analog Club", "description": "Central City Develop and scan B&W film negatives, make silver gelatin prints, and share your love of analog photography as part of our emerging darkroom community. 400 St Asaph Street , Photosynthesis Darkroom Free event At Analog Club, we open our darkroom and studio spaces for film development, scanning and silver gelatin printmaking. Anyone can come along. You develop and scan as many B&W rolls and craft as many silver gelatin prints as you would like, with fair use governing access. Analog club is the best way to connect with other people who love using analogue photography processes. Develop new skills and enhance those you already have: how is the person on the enlarger next to you going to shape your artistic practice, and how will you change the way they see their work? Add an extra dimension to your work by experimenting with different film stocks and using our range of developers. Keep an eye on our Instagram and newsletter for updates on the every-changing developer menu. C41 development is coming soon. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11889 managed by ccc.", "dates": {"start": "2025-12-04T18:30:00", "end": "2025-12-04T21:00:00", "text": "4 Dec 2025 | 6:30 pm - 9:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:28Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/cashmere-st-augs-repair-cafe-12682", "title": "Cashmere St Aug's Repair Café", "description": "Environment | Sustainability Bring your broken and torn items and learn how to repair! Computers, bikes, clothing, gardening tools, etc. Come, check us out and challenge our volunteers. 5 Cracroft Terrace , St Augustines Church Free event Let's repair rather than throw away. Let's share knowledge of repair and sustainable living. Bring any items that need repairing. Our volunteers always look forward to new challenges. We also have sewing machines and people who can help or advise fabric repairs. We are part of the Repair Café Aotearoa network of repair events. Come volunteer with us or drop in for a hot drink. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12682 managed by ccc.", "dates": {"start": "2025-12-04T17:00:00", "end": "2025-12-04T19:00:00", "text": "4 Dec 2025 | 5:00 pm - 7:00 pm"}, "price": null, "location": "See website for details", "categories": ["Environment", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:18:28Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/housie-909284", "title": "Housie", "description": "Family & Lifestyle 442 Durham Street North, Christchurch Mary Potter Community Centre, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #909284 managed by eventfinda.", "dates": {"start": "2025-12-04T12:30:00", "end": "2025-12-04T14:15:00", "text": "4 Dec 2025 | 12:30 pm - 2:15 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:28Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/carols-with-the-chorus-13359", "title": "Carols with the Chorus", "description": "Central City | Music Come and join members of the Christchurch City Chorus as they share a variety of Christmas carols in four-part harmony. Paid event Come and join members of the Christchurch City Chorus as they share a variety of Christmas carols in four-part harmony. Sing along to your favourites or sit back and let the beautiful harmonies wash over you. Set in the stunning Great Hall, this performance is sure to delight young and old — it’s not one to be missed! Founded in 1985, master director Virginia Humphrey-Taylor has grown the Christchurch City Chorus into Australasia’s leading female a cappella group. Recently returned from placing fifth in the world at the International Sweet Adelines Competition in Kansas City, the Chorus remains dedicated to enriching the lives of its members and the community through friendship, education, and barbershop musical excellence. Before and after the show catch the sounds of Summer Breeze Saxophone Quartet in the North Quad. $5 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13359 managed by ccc.", "dates": {"start": "2025-12-04T12:30:00", "end": "2025-12-04T13:00:00", "text": "4 Dec 2025 | 12:30 pm - 1:00 pm"}, "price": "$5", "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:18:29Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/linwood-village-market-13114", "title": "Linwood Village Market", "description": "Food | Music Monthly community market – come and shop with us! 388 Worcester Street , Linwood Community Arts Centre car park Free event Plants, crafts, clothes, books, this and that, odds and ends, vintage and upcycled, garage sale-type stalls, and some tiny fundraisers for local community projects. Sometimes music, sometimes dance too, but always reasonably priced refreshments and a friendly welcome. Free box in the interest of waste minimisation. Please note: currently we have no shelter, so: cancelled if wet. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13114 managed by ccc.", "dates": {"start": "2025-12-06T10:00:00", "end": "2025-12-06T13:00:00", "text": "6 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "See website for details", "categories": ["Food", "Music"], "image": null, "updated_at": "2025-12-03T01:18:29Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/ferrymead-heritage-park-night-market-13501", "title": "Ferrymead Heritage Park Night Market", "description": "Exhibition | Food Family friendly market which supports the preservation of the heritage park and education. A mix of food stalls, craft vendors, live music and fundraising. 50 Ferrymead Park Drive Paid event Preserve History, Support Education, and Have Fun! Every visit helps us keep history alive and support children's education through the tireless efforts of our dedicated volunteers. We’re not just a market, we rely on donations, and the support of people like you. Your entry fee goes directly toward preserving our little township and providing educational opportunities for local children. Our volunteers work hard to raise funds for these causes, and every night market you attend helps them continue their important work. Well, where else could you grab a bite and ride a train. Thank you for being part of our mission. FREE - $5 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13501 managed by ccc.", "dates": {"start": "2025-12-06T16:00:00", "end": "2025-12-06T20:00:00", "text": "6 Dec 2025 | 4:00 pm - 8:00 pm"}, "price": "$5", "location": "See website for details", "categories": ["Exhibition", "Food"], "image": null, "updated_at": "2025-12-03T01:18:29Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/ferrymead-heritage-park-night-market-13168", "title": "Ferrymead Heritage Park Night Market", "description": "Environment | Food Family friendly market which supports the preservation of the heritage park and education. A mix of food stalls, craft vendors, live music and fundraising. 50 Ferrymead Park Drive , Ferrymead Heritage Park Paid event Preserve History, Support Education, and Have Fun! Every visit helps us keep history alive and support children's education through the tireless efforts of our dedicated volunteers. We’re not just a market—we rely on donations, and the support of people like you. Your entry fee goes directly toward preserving our little township and providing educational opportunities for local children. Our volunteers work hard to raise funds for these causes, and every night market you attend helps them continue their important work. Well, where else could you grab a bite and ride a train. Thank you for being part of our mission. FREE - $5 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13168 managed by ccc.", "dates": {"start": "2025-12-06T16:00:00", "end": "2025-12-06T20:00:00", "text": "6 Dec 2025 | 4:00 pm - 8:00 pm"}, "price": "$5", "location": "See website for details", "categories": ["Environment", "Food"], "image": null, "updated_at": "2025-12-03T01:18:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/oneill-school-of-irish-dance-annual-showcase-13447", "title": "O'Neill School of Irish dance Annual Showcase", "description": "Live | Performance The O’Neill School of Irish Dance Annual Showcase brings together dancers of all ages in a spectacular display of talent and passion. 510 Hagley Avenue , Performing Arts Centre Hagley College Paid event Get ready for an unforgettable celebration of rhythm, energy, and Irish spirit! The O’Neill School of Irish Dance Annual Showcase brings together dancers of all ages in a spectacular display of talent and passion. From the timeless beauty of traditional steps to the excitement of modern choreography, this show has something for everyone. Watch as our youngest beginners take the stage alongside our accomplished senior dancers, in an afternoon that celebrates dedication, creativity, and the love of Irish dance shared across generations. Don’t miss out — get your tickets now and join us for an afternoon of Irish dance magic! $20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13447 managed by ccc.", "dates": {"start": "2025-12-06T15:00:00", "end": "2025-12-06T17:00:00", "text": "6 Dec 2025 | 3:00 pm - 5:00 pm"}, "price": "$20", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/talk-whenua-13454", "title": "TALK Whenua", "description": "Libraries | Talk Explore the relationship between tākata and whenua – people and land – with some of the authors of the Gallery’s new book, Whenua. Free event A discussion with authors. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13454 managed by ccc.", "dates": {"start": "2025-12-06T13:00:00", "end": "2025-12-06T14:00:00", "text": "6 Dec 2025 | 1:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": ["Libraries", "Talk"], "image": null, "updated_at": "2025-12-03T01:18:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/pool-party-giant-summer-season-kick-off-13327", "title": "Pool Party - Giant Summer Season Kick-off!", "description": "Council events Grab your friends and whānau, and pack your togs, towel and sunscreen - our summer pool parties are back and you're in for a treat. Paid event Round up your friends and whānau for an unforgettable start to summer with our epic pool party. Dive into a day of fun with slides, inflatables, and our inflatable obstacle course, plus a bouncy castle for kids (and the young at heart). Thanks to Streets, we’ll be giving away free ice creams – grab one while they last. Pack your togs, towel, and sunscreen, and join us —we can’t wait to see you there. Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13327 managed by ccc.", "dates": {"start": "2025-12-06T12:00:00", "end": "2025-12-06T17:00:00", "text": "6 Dec 2025 | 12:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/manu-competition-jellie-park-13333", "title": "Manu Competition – Jellie Park", "description": "Council events Get amongst the fun and join our manu competitions this summer to win prizes and become the Christchurch City Council manu champion. Paid event Things are heating up at Jellie Park this weekend with a day of pool parties and the first manu competition of the summer. Join us and show off your best manu. Show our sponsor Streets some love because they’ll be giving away free ice cream. Pack your togs, towel, and sunscreen, and bring your whānau and friends – we'll see you there. Enter the manu competition in one of four categories. At the end of the competition season, the top three queens or kings of the manu will be awarded an official trophy and prizes. There will also be spot prizes up for grabs throughout the competition. The general pool admission price applies. Please check out the before you arrive. Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13333 managed by ccc.", "dates": {"start": "2025-12-06T12:00:00", "end": "2025-12-06T14:00:00", "text": "6 Dec 2025 | 12:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/south-island-wine-and-food-festival-13339", "title": "South Island Wine and Food Festival", "description": "Central City | Festival The South Island's largest wine and food event returns for its 15th year. Sample wines from over 40 wineries, cooking demos, food galore and live music all day. Paid event Set against the stunning backdrop of North Hagley Park, this popular Canterbury celebration attracts approximately 10,000 wine and food lovers for an exceptional summer experience. Discover outstanding wines from renowned South Island regions including Marlborough, Central Otago and our local Waipara Valley, with winemakers on hand to share their knowledge and passion. Watch top chefs demonstrate their craft in the Cooking Theatre, then enjoy delicious dishes from six of Christchurch's finest restaurants in the dedicated dining area and plentiful food stalls. Enhance your wine knowledge through engaging seminars and masterclasses, all included with your ticket. A great lineup of live music entertainment keeps the atmosphere buzzing throughout the day. Choose from General Admission, Connoisseur, or VIP Experience tickets to suit your style. A must-do event on Canterbury's summer calendar. $59.90 - $299.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13339 managed by ccc.", "dates": {"start": "2025-12-06T11:30:00", "end": "2025-12-06T19:00:00", "text": "6 Dec 2025 | 11:30 am - 7:00 pm"}, "price": "$59.90 - $299", "location": "See website for details", "categories": ["Central City", "Festival"], "image": null, "updated_at": "2025-12-03T01:18:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/talk-the-life-and-work-of-raymond-mcintyre-13453", "title": "TALK The Life and Work of Raymond McIntyre", "description": "Exhibition | Talk Curator Peter Vangioni discusses one of Waitaha Canterbury’s most respected expatriate artists. Discussing his life, travels and works. Free event Come and take a seat in our auditorium and enjoy this in-depth talk. Image: Raymond McIntyre. Suzettec.1914 Oil on wood. Collection of Christchurch Art gallery Te Puna o Waiwhetū, presented by Mary Good, London 1975 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13453 managed by ccc.", "dates": {"start": "2025-12-06T11:00:00", "end": "2025-12-06T12:00:00", "text": "6 Dec 2025 | 11:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": ["Exhibition", "Talk"], "image": null, "updated_at": "2025-12-03T01:18:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/festive-gift-box-decorating-13361", "title": "Festive Gift Box Decorating", "description": "Central City Get creative this Christmas with our gift box decorating activity. Tamariki are invited to decorate their very own white house–shaped gift box. Donation/koha Get creative this Christmas with our gift box decorating activity. Tamariki are invited to decorate their very own white house–shaped gift box using Christmas stickers, glitter pens, and plenty of imagination. Once finished, the box makes a perfect festive keepsake — or can be filled with delicious lollies from Mrs Bumbleberry’s Lolly Shop to make a sweet gift for someone special. A fun, hands-on activity that adds a personal touch to the Christmas season! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13361 managed by ccc.", "dates": {"start": "2025-12-06T11:00:00", "end": "2025-12-06T15:00:00", "text": "6 Dec 2025 | 11:00 am - 3:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/sew-a-gift-bag-13388", "title": "Sew a Gift Bag", "description": "Central City | Libraries Do you want to learn basic sewing skills? Join us for an exciting workshop where you’ll craft your own fabric gift bags from scratch! 60 Cathedral Square , Tūranga Paid event Join us for an exciting workshop where you’ll craft your own fabric gift bags from scratch! Guided by experienced instructors, you’ll gain basic sewing skills in a supportive, relaxed environment. Learn how to turn everyday materials into unique, colourful bags — perfect for gifts or personal use. You’ll also have a chance to explore our inspiring new collection of sewing books and magazines, with a special focus on bag-making techniques and ideas. All items and material provided. No experience necessary. Booking required. Ages: Recommended for 18+ $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13388 managed by ccc.", "dates": {"start": "2025-12-06T10:30:00", "end": "2025-12-06T12:30:00", "text": "6 Dec 2025 | 10:30 am - 12:30 pm"}, "price": "$10", "location": "See website for details", "categories": ["Central City", "Libraries"], "image": null, "updated_at": "2025-12-03T01:18:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/halswell-pottery-group-christmas-market-13394", "title": "Halswell Pottery Group Christmas Market", "description": "Exhibition Our annual Christmas sale of ceramic sculpture and domestic ware hand made by our members. You can also have a look at what's on offer in our gallery! 9 Candys Road , Halswell Pottery Group Free event Enjoy our annual Christmas market showcasing unique handmade pottery. There will be a range of decorative and functional work all created by our members. Demonstrations of throwing pots on the wheel will be given. We look forward to seeing you there! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13394 managed by ccc.", "dates": {"start": "2025-12-06T10:30:00", "end": "2025-12-06T14:30:00", "text": "6 Dec 2025 | 10:30 am - 2:30 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/women-and-girls-pool-night-13406", "title": "Women and Girls Pool Night", "description": "Council events An evening designed for all women and girls of our community to experience the pool facility without barriers. 71 Broadlands Drive , Selwyn Aquatic Centre Paid event There are a variety of barriers many women and girls face, which prevent them from using a pool facility. That's why we love to host an evening designed to encourage and include them to feel confident and safe using the pool facility. This private session for women and girls provides free swimming lessons and a prayer room. Our friendly female staff and security provide a safe and connected environment in which to experience the pool space. Entry is restricted to women and girls only from 4.30pm and all public not staying for the session need to exit the pool space at 5pm. $4.10 - $7.10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13406 managed by ccc.", "dates": {"start": "2025-12-06T17:30:00", "end": "2025-12-06T20:00:00", "text": "6 Dec 2025 | 5:30 pm - 8:00 pm"}, "price": "$4.10 - $7.10", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:33Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/bachs-christmas-oratorio-13161", "title": "Bach's Christmas Oratorio", "description": "Music | Performance Celebrate the season with Bach's glorious Christmas Oratorio, performed by the Christchurch City Choir and CSO with renowned NZ soloists. Paid event Immerse yourself in the festive spirit with a magnificent Christmas concert at the Christchurch Town Hall, featuring the celebrated Christchurch City Choir, the renowned Christchurch Symphony Orchestra, and four exceptional soloists. Join us for an enchanting evening as we present two masterpieces of the classical repertoire: Johann Sebastian Bach's effervescent Magnificat and the first three cantatas of his beloved Christmas Oratorio. The Magnificat, a vibrant and joyful work of musical celebration, features stunning vocal solos, intricate choral counterpoint, and glorious melodies. It is a brilliant example of Bach's genius for creating music that is both complex and deeply moving. Following this, we delve into the heart of the Christmas Oratorio, a work of profound beauty and drama. These opening cantatas are filled with some of Bach's most memorable arias and choruses, showcasing his masterful orchestration and rich harmonic language. Soloists Anna Leese, Margot Button, Adrian Lowe, and Chalium Poppy will bring these narratives to life with their superb vocal artistry. This promises to be an unforgettable evening of sublime music, uniting the full power of the choir, the grandeur of the orchestra, and the brilliance of our soloists. An essential event to experience the true spirit and joy of the holiday season. With thanks to Cuningham Taylor Law, Principal Sponsor, and Mitre 10 MEGA Ferrymead, Concert Sponsor, for their support. $20 - $90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13161 managed by ccc.", "dates": {"start": "2025-12-06T19:30:00", "end": "2025-12-06T22:00:00", "text": "6 Dec 2025 | 7:30 pm - 10:00 pm"}, "price": "$20 - $90", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:33Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/sexy-ghost-of-xmas-boy-13430", "title": "Sexy Ghost of Xmas Boy", "description": "Central City | Performance A Christmas themed wordless interactive burlesque comedy show to warm the heart of Christchurch's worn wretches Paid event The silly season spin-off of the legendary Sexy Ghost Trilogy, creator George Fenn presents an unmissable Christmas performance to warm the hearts of Christchurch's worn wretches to remind them of the true meaning of Christmas: Dystopic Consumerism. This interactive experience combines elements of clown and burlesque to make an unmissable wordless comedy. “The Sexy Ghost of Xmas Boy has been unlike anything I have ever experienced, and it has been so much fun! My stomach hurts from laughing non-stop for an hour along with every other person in the audience. Fenn has given us sexy, unhinged chaos and camaraderie, and has definitely warmed our cold winter hearts!” - Ayla Chamberlain, Theatreview “A theatrical alchemist, Fenn has the rare talent to create something utterly ridiculous yet very clever.” - Rosheen FitzGerald, Theatreview This event is strictly R18, it contains sexual themes and nudity down to underwear. $15 - $30 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13430 managed by ccc.", "dates": {"start": "2025-12-06T20:30:00", "end": "2025-12-06T21:30:00", "text": "6 Dec 2025 | 8:30 pm - 9:30 pm"}, "price": "$15 - $30", "location": "See website for details", "categories": ["Central City", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:33Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/riverlution-yoga-13217", "title": "Riverlution Yoga", "description": "Central City Join us for a relaxing 45-minute yoga session with Pele in the beautiful community garden. 50 Vogel Street , Riverlution Cafe Paid event Yoga for a Cause with our Fundraiser Class by Riverlution Café Join us every week for a relaxing 45-minute yoga session with Fiona, Pele, or Jo. Our amazing teachers are taking turns to offer this class throughout the summer. Each session raises funds for the Riverlution Eco Park, so while you stretch and unwind, you’ll also be giving back to our community. Thanks to your support at the last class — every new session will help fund another community project across the site. After class, make a morning of it! Please bring your own yoga mat if possible (limited mats available). If the weather isn’t suitable, the class will be cancelled for that week. Let’s stretch, breathe, and support our community together! $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13217 managed by ccc.", "dates": {"start": "2025-12-07T08:00:00", "end": "2025-12-07T08:45:00", "text": "7 Dec 2025 | 8:00 am - 8:45 am"}, "price": "$10", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:34Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/cargo-bike-picnic-13420", "title": "Cargo Bike Picnic", "description": "Whether you own a cargo bike, load up a bike, use a trailer, or are just curious to try one out, everyone is welcome! 235 River Road , Avebury Park/Richmond Community Garden Free event Get ready for a day of adventure, community, and sustainable transportation as Spokes, Action Bicycle Club, and Christchurch Electric Bikes come together to invite you to a special Cargo Bike Picnic! Whether you own a cargo bike, load up a bike, use a trailer, or are just curious to try one out, everyone is welcome! Come celebrate the season, meet fellow enthusiasts, and enjoy a picnic with the local community. The day is packed with activities for everyone: Bike-Sharing: Plenty of chances for you to try different cargo bikes! Picnic: After the ride, we’ll stop to relax, refuel, and enjoy a community picnic. Pack your own goodies. If you want to skip the ride we are aiming to be at Avebury park / Riverlution at 10:45am-11am Family-Friendly Activities: Bring your kids, your friends, and outdoor activities! Avebury Park has a paddling pool and playground! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13420 managed by ccc.", "dates": {"start": "2025-12-07T10:00:00", "end": "2025-12-07T00:00:00", "text": "7 Dec 2025 | 10:00 am - 12:00 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:34Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christmas-on-the-peace-train-13508", "title": "Christmas on the Peace Train", "description": "Central City | Tour Santa is coming to the Botanic Gardens - on the Peace Train! Grab a photo with Santa as he makes his festive rounds Free event This Sunday, Santa is (temporarily) trading in his reindeer for an electric engine and taking the wheel of the Peace Train at the Botanic Gardens! This is a great opportunity to ride the train and get a unique photo with Santa Claus. The Peace Train will run for slightly longer, from 10am until 2.30pm. Each trip takes approximately eight minutes. The last ride of the day will leave approximately fifteen minutes before closing time. The train can’t operate in wet weather, so it will be cancelled if it’s raining. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13508 managed by ccc.", "dates": {"start": "2025-12-07T10:00:00", "end": "2025-12-07T13:00:00", "text": "7 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Tour"], "image": null, "updated_at": "2025-12-03T01:18:34Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christmas-pottery-market-and-student-exhibition-13319", "title": "Christmas Pottery Market and Student Exhibition", "description": "Exhibition Stalls featuring beautiful pottery and crafts made by our creative club members, plus student exhibition celebrating a year of pottery fun. 140 Main Road , Mount Pleasant Pottery Club Free event Browse stalls featuring beautiful pottery and crafts made by our creative club members. Purchase unique handmade Christmas gifts. Free coffee with first 40 pots sold. View the student exhibition celebrating a year of pottery fun and achievements. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13319 managed by ccc.", "dates": {"start": "2025-12-07T10:00:00", "end": "2025-12-07T14:00:00", "text": "7 Dec 2025 | 10:00 am - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:35Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/riverside-farmers-and-christmas-craft-market-13207", "title": "Riverside Farmers and Christmas Craft Market", "description": "Central City | Food Get ready for a full-packed market experience as we combined our farmers market, Christmas craft market with our annual Christmas celebration at Riverside. Free event Not only will the Riverside Farmers Market be back out the front, but we’re also bringing back the Riverside Christmas Crafts Market – proudly organised together with Life in Vacant Spaces at Central Park. Get ready for a full-packed market experience with fresh local produce, unique handmade gifts, festive fun, and plenty of Christmas vibes to enjoy with friends and family. And yes… Santa will be stopping by too! And don’t forget – there’s plenty of good food waiting inside Riverside Market to keep you fuelled while you shop and celebrate. Mark your calendars, gather your loved ones, and join us for a truly magical day at Riverside. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13207 managed by ccc.", "dates": {"start": "2025-12-07T10:00:00", "end": "2025-12-07T15:00:00", "text": "7 Dec 2025 | 10:00 am - 3:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Food"], "image": null, "updated_at": "2025-12-03T01:18:35Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/carols-on-the-avon-13448", "title": "Carols on the Avon", "description": "Music | Performance Join Punting on the Avon in conjunction with the Salvation Army for special punt rides featuring live Christmas music! 2 Cambridge Terrace , Punting on the Avon Paid event Join us for a festive punt ride with our Carols on the Avon events! Back for another year, our team will be punting local performers playing yuletide carols along the river while guests are punted alongside to listen on a 30-minute tour departing from the Antigua Boat Sheds. This event is once again being held in conjunction with the Salvation Army. Seats are strictly limited with punts departing each day to punt alongside the performers, so bookings are essential (and wearing Christmas attire is encouraged)! $30 - $129 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13448 managed by ccc.", "dates": {"start": "2025-12-07T11:00:00", "end": "2025-12-07T13:00:00", "text": "7 Dec 2025 | 11:00 am - 1:00 pm"}, "price": "$30 - $129", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:35Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/friends-fundraising-open-garden-2025-13311", "title": "Friends Fundraising Open Garden 2025", "description": "Tour Join the Friends of the Arts Centre for a special visit to a peaceful and wonderful 5* Garden of National Significance. 139 Old Tai Tapu Road , Frensham Paid event Considered one of New Zealand's finest gardens, Frensham is a beautiful, relaxed country garden that has been thirty-three years in the making. Much thought has gone into the placement of colour, the short and long-distance views, and the filtering of light which is created by judicious pruning. The garden has been planned with year-round interest in mind. There is a serious plant collection which is continually being added to, and subtle changes over time in of all existing areas. The owner will be available for questions throughout the event, and can provide information about work in the garden, gardening tips and botanical information. Tours of the garden will be self-guided. Plants and books are available for sale by the owner, as well as a stall of Christmas gifts from The Arts Centre. There will be musical interludes, and light refreshments available to purchase. $35 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13311 managed by ccc.", "dates": {"start": "2025-12-07T11:30:00", "end": "2025-12-07T15:00:00", "text": "7 Dec 2025 | 11:30 am - 3:00 pm"}, "price": "$35", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:36Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/sinterklaas-picnic-13237", "title": "Sinterklaas Picnic", "description": "Festival Join us for another fantastic family day filled with fun for everyone! 637 Marshland Road , The Netherlands Society of Christchurch club rooms Free event We have an exciting line-up of games for the children, and adults are welcome to join in. Before Sinterklaas arrives, we’ll have a friendly tug-of-war for those ready to flex their muscles! Everyone will have a chance to take photos with Sinterklaas, and all children will receive a treat bag with lollies and juice. Registered children up to 12 years old will also receive a special gift. For the adults, a traditional taai taai treat awaits—assuming you’ve been good this year! Food stalls and a coffee van will be there to add to the festivities. Please note: If you decide to attend at the last minute without registering, we may not be able to provide a gift for your child, so please register in advance. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13237 managed by ccc.", "dates": {"start": "2025-12-07T11:30:00", "end": "2025-12-07T14:30:00", "text": "7 Dec 2025 | 11:30 am - 2:30 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:36Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/cbs-choir-and-orchestra-present-handels-messiah-13338", "title": "CBS Choir and Orchestra present Handel's Messiah", "description": "Music | Performance The Cathedral of the Blessed Sacrament Choir and Orchestra present their annual performance of everyone's favourite oratorio. 373 Manchester Street Paid event Soprano soloist will be Rebecca Ryan, who created headlines singing Handel when she premiered a newly discovered Gloria, while a student at the Royal College of Music. Since then, she has performed many oratorios and operas in Europe and NZ. Alto soloist will be Anne Lamont-Low, who is presently based in Montana, U.S. Anne has performed widely in this country and abroad and was a former singer with CBS Music, including several international tours. Our regular Messiah soloists will be Wally Enright, Ken Joblin, and Chris Whelan. The Cathedral Orchestra will be led by Natalia M. Lomeiko, with continuo Janet Cubey and Peter Low. Don Whelan will direct. This annual performance has continued to attract a substantial audience. Messiah proved a popular choice on the group’s first four European tours, and concerts throughout the Americas. While awaiting a future cathedral building. the spacious and resonant Catholic Pro-Cathedral is proving an excellent concert venue and temporary home for the regular cathedral music programme. The adjacent CBS Music Centre provides a substantial second auditorium, with very good acoustics and dedicated lighting, used for rehearsals and chamber music concerts. $25 - $30 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13338 managed by ccc.", "dates": {"start": "2025-12-07T13:30:00", "end": "2025-12-07T15:30:00", "text": "7 Dec 2025 | 1:30 pm - 3:30 pm"}, "price": "$25 - $30", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:36Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/kate-sheppard-house-christmas-afternoon-tea-13347", "title": "Kate Sheppard House Christmas Afternoon Tea", "description": "Food Enjoy a Christmas themed afternoon tea with family and friends in the former home of New Zealand suffragist leader, Kate Sheppard. Paid event Feel the Christmas spirit in the beautiful former home of Kate Sheppard. Explore the one acre of garden then relax with a delicious Christmas afternoon tea in the Camellia Room or on the sunny veranda. Afternoon tea includes three Christmas items, with a selection of teas or plunger coffee. (We cannot cater for gluten free, dairy free or vegan). Afterwards take time to enjoy the 'Person Includes Woman' Photographic Exhibition or explore the museum and its inspiring stories one woman's achievement. $15 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13347 managed by ccc.", "dates": {"start": "2025-12-07T13:45:00", "end": "2025-12-07T14:45:00", "text": "7 Dec 2025 | 1:45 pm - 2:45 pm"}, "price": "$15", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:40Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/acoustic-english-folktrad-slow-session-13188", "title": "Acoustic English folk/trad slow session", "description": "Central City | Music Play, sing or listen to folk music! 579 Colombo Street , A Rolling Stone Free event For those who enjoy playing folk music from Britain and beyond. Bring a tune to share if you wish. Music available. Players, singers and listener's welcome! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13188 managed by ccc.", "dates": {"start": "2025-12-07T14:00:00", "end": "2025-12-07T16:00:00", "text": "7 Dec 2025 | 2:00 pm - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:18:40Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/just-for-joy-choir-with-la-mitchell-christmas-edition-13500", "title": "Just For Joy - Choir with L.A. Mitchell {Christmas Edition}", "description": "Central City | Live All ye Merry Gentle-people, announcing a special Christmas edition of Just For Joy - Choir. Just For Joy is a non-auditioned, no-prep, no-pressure choir. Donation/koha All ye Merry Gentle-people, announcing a special Christmas edition of Just For Joy - Choir. Just For Joy is a non-auditioned, non-performative, non-competitive, no-prep, no-pressure choir hosted by Ōtautahi local singing legend L.A.Mitchell (Fly My Pretties, Bill Withers Social Club, Terrible Sons). The choir's kaupapa is to use singing for expression, relief, healing & joy, and to use singing together, as a way to increase our sense of belonging and community. Why not use this Christmas season to start a new trend and come together to sing carols with strangers and friends, ushering in the season with joy? All you have to do is turn up. Just For Joy - Choir with L.A. Mitchell {Christmas Edition} Date: Sunday 7 December Time: 2-3pm Venue: Tautoru / TSB Space, Hapori | Community, Level 1, Tūranga The choir is koha-based, and there is an option for contributions. Register your interest here: Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13500 managed by ccc.", "dates": {"start": "2025-12-07T14:00:00", "end": "2025-12-07T15:00:00", "text": "7 Dec 2025 | 2:00 pm - 3:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:18:40Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/quiz-night-for-singles-at-ramen-ria-12879", "title": "Quiz Night for Singles at Ramen Ria!", "description": "Central City | Food Due to high demand! Quiz Night for Singles and Ugly Xmas Sweater Competition. This time around Instadate Collabs is hosting it all! 3/112 Oxford Terrace , Ramen Ria Paid event Calling all those aged 27-47, join our festive singles event and meet fun, like-minded people ready to team up, and play some games. Limited seats available, so get in quick! What’s on offer: Leave the matchmaking & connections to us! Only 40 seats per event. $22.50 - $45 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12879 managed by ccc.", "dates": {"start": "2025-12-07T15:00:00", "end": "2025-12-07T18:00:00", "text": "7 Dec 2025 | 3:00 pm - 6:00 pm"}, "price": "$22.50 - $45", "location": "See website for details", "categories": ["Central City", "Food"], "image": null, "updated_at": "2025-12-03T01:18:41Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/gurukool-session-902584", "title": "GuruKool Session", "description": "Education 25 Smarts Road, Hornby, Christchurch Hornby Matatiki Centre, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #902584 managed by eventfinda.", "dates": {"start": "2025-12-07T15:30:00", "end": "2025-12-07T17:00:00", "text": "7 Dec 2025 | 3:30 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:41Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/tikohikohi-13225", "title": "Tīkohikohi", "description": "Central City | Music Tīkohikohi (meaning to bring together) celebrates the music and art of Ōtautahi musician Harry Harrison in a spectacular concert of jazz and digital art. Paid event Tīkohikohi (meaning to bring together) celebrates the music and art of Ōtautahi musician Harry Harrison in a spectacular concert of jazz and digital art. Harry will lead his eight-piece band through a selection of original compositions paired with art images cast onto a 3.5m x 2m LED screen. ‘For me, art creates a visual connection between music and life, part improvised, rhythms and lines creating patterns of feeling.’ $20 - $35 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13225 managed by ccc.", "dates": {"start": "2025-12-07T19:00:00", "end": "2025-12-07T21:00:00", "text": "7 Dec 2025 | 7:00 pm - 9:00 pm"}, "price": "$20 - $35", "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:18:41Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/halswell-business-networking-872561", "title": "Halswell Business Networking", "description": "Business & Professional 335 Halswell Rd, Christchurch The Old Vicarage, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872561 managed by eventfinda.", "dates": {"start": "2025-12-08T09:00:00", "end": "2025-12-08T10:00:00", "text": "8 Dec 2025 | 9:00 am - 10:00 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:42Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/mini-gym-party-13407", "title": "Mini Gym Party", "description": "Join our soft, indoor playground and enjoy face painting, a bouncy castle and many more toddler friendly activities to celebrate the upcoming festivities. 70 Broadlands Drive , Selwyn Sports Centre Paid event Let’s celebrate the upcoming festivities with a party for toddlers! In addition to our regular mini gym class which includes soft play, cartwheels, toys and music, there’ll be lots of other activities to enjoy for toddlers and parents, including a special visit from a very merry lady. Suitable for ages 1-5 years old, parents and caregivers free. Baby Gym for rollers and crawlers will continue as usual at 11am so they can enjoy the party too! Register your interest and pay on the day. $5.50 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13407 managed by ccc.", "dates": {"start": "2025-12-08T09:30:00", "end": "2025-12-08T11:00:00", "text": "8 Dec 2025 | 9:30 am - 11:00 am"}, "price": "$5.50", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:42Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/afternoon-business-networking-meeting-825282", "title": "Afternoon Business Networking Meeting", "description": "Business & Professional 33 Wordsworth Street, Christchurch Just Desserts, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #825282 managed by eventfinda.", "dates": {"start": "2025-12-08T13:00:00", "end": "2025-12-08T14:00:00", "text": "8 Dec 2025 | 1:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:42Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/mending-club-11208", "title": "Mending Club", "description": "Sustainability | Environment | Central City Join others in a warm and welcoming environment to sew and repair your much loved clothes, hosted by Mirabel Oliver. 5 Worcester Boulevard , Toi Auaha Paid event Mending Club meets the second Monday of each month, February to December. This is an opportunity to join others in a warm and welcoming environment to sew and repair your much-loved clothes. Be resourceful and come along to enjoy the art of mending, either through machine sewing or by hand, and get more out of the clothes you love. Please bring a project and matching thread if possible. We will provide needles, irons, scissors, some threads, etc. and some sewing machines. Please bring your own sewing machine if needed. Please note that bookings for each club night are essential, including for those who have already purchased an annual membership. $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11208 managed by ccc.", "dates": {"start": "2025-12-08T18:00:00", "end": "2025-12-08T21:00:00", "text": "8 Dec 2025 | 6:00 pm - 9:00 pm"}, "price": "$10", "location": "See website for details", "categories": ["Sustainability", "Environment", "Central City"], "image": null, "updated_at": "2025-12-03T01:18:42Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/casebrook-intermediate-year-8-prize-giving-914584", "title": "Casebrook Intermediate Year 8 Prize Giving", "description": "Education 12 Winchester St, Merivale, Christchurch St Margaret's College, Christchurch Free Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #914584 managed by eventfinda.", "dates": {"start": "2025-12-08T18:30:00", "end": "2025-12-08T20:30:00", "text": "8 Dec 2025 | 6:30 pm - 8:30 pm"}, "price": null, "location": "12 Winchester St, Merivale, Christchurch | St Margaret's College, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:43Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christchurch-east-business-networking-tuesday-meeting-872549", "title": "Christchurch East Business Networking Tuesday Meeting", "description": "Business & Professional 2 Suffolk Street Phillipstown, Christchurch The Daily on Suffolk, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #872549 managed by eventfinda.", "dates": {"start": "2025-12-09T07:45:00", "end": "2025-12-09T08:45:00", "text": "9 Dec 2025 | 7:45 am - 8:45 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:43Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/crosbie-park-streamside-working-bees-11072", "title": "Crosbie Park Streamside Working Bees", "description": "Join the Friends of Crosbie Park to enhance the park and stream with low-key streamside working bees. All are welcome! Woodbury Street , Crosbie Park Playground Free event We have a series of scheduled working bees, plus our annual planting day in August, to enhance the park. We’d love for you to join us – it’s a fantastic opportunity to meet like-minded people, contribute to your community, and nurture the local ecosystem. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11072 managed by ccc.", "dates": {"start": "2025-12-09T09:30:00", "end": "2025-12-09T10:30:00", "text": "9 Dec 2025 | 9:30 am - 10:30 am"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/wigram-skies-business-networking-tuesday-meeting-827349", "title": "Wigram Skies Business Networking Tuesday Meeting", "description": "Business & Professional 14 Henry Wigram Drive, Christchurch Wigram Base Hotel, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #827349 managed by eventfinda.", "dates": {"start": "2025-12-09T12:30:00", "end": "2025-12-09T13:30:00", "text": "9 Dec 2025 | 12:30 pm - 1:30 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/little-dancing-elves-13408", "title": "Little Dancing Elves", "description": "Council events We’ll be doing the candy cane twist, reindeer freeze dance and snowman stomp many move groovy jingly jams in the festive class for toddlers. 15 Meijer Drive , Lincoln Event Centre Paid event A merry dance class for toddlers! Jingle all the way to Christmas with these themed little dancing feet classes. Our amazing instructors will have some cool gear to boogie with, like scarves and ribbons, alongside some fun dances and games to jive along to - all Christmas themed of course! Come in your best festive outfit and party like little dancing elves. Suitable for ages 1-5 years, parents/caregivers and babies free. No bookings required, drop-in. If you enjoy the class, head along to another Little Dancing Elves at Selwyn Sports Centre the next day! $5.30 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13408 managed by ccc.", "dates": {"start": "2025-12-09T10:30:00", "end": "2025-12-09T11:00:00", "text": "9 Dec 2025 | 10:30 am - 11:00 am"}, "price": "$5.30", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christchurch-city-council-waiata-group-13455", "title": "Christchurch City Council Waiata Group", "description": "Music | Performance Come, sing or listen and enjoy the Council’s wonderful waiata group as they practice in our foyer. Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13455 managed by ccc.", "dates": {"start": "2025-12-09T12:00:00", "end": "2025-12-09T13:00:00", "text": "9 Dec 2025 | 12:00 pm - 1:00 pm"}, "price": null, "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/canterbury-womens-catchball-richmond-13113", "title": "Canterbury Women's Catchball | Richmond", "description": "Performance Catchball is a team sport for all women, like volleyball. It emphasises wellbeing and socialisation. We welcome participants of all skill levels and abilities. 77 North Parade , AvonHub Paid event Requiring fewer skills and less physical demand than volleyball, making it a safer and more welcoming option for women with varying fitness levels. It’s a great game for players whose age, skill level, or life commitments may prevent them from participating in other team sports. Everyone can engage at their own pace. Catchball also has a strong social focus, with teams often getting together for fun events. It’s a wonderful opportunity to exercise and make friends in a positive, inclusive environment. Our teams provide a beginner-friendly and positive environment both during practice and social time. We welcome new players and anyone wanting to try catchball at any time during the term. Free - $65 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13113 managed by ccc.", "dates": {"start": "2025-12-09T10:30:00", "end": "2025-12-09T12:00:00", "text": "9 Dec 2025 | 10:30 am - 12:00 pm"}, "price": "$65", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-court-jesters-christmas-show-13473", "title": "The Court Jesters Christmas Show", "description": "Live | Performance A Christmas Carol left Home Alone in Love, Actually with an Elf, Who Stole Christmas. Presented by The Court Jesters. Paid event What’s your favourite Christmas story? The Court Jesters love them all. In fact, they love Christmas so much, they’re stuffing the stocking with a medley of Greatest Christmas Hits. Expect all your favourites in this family friendly festive fiesta that’ll have your heart grow three sizes. With booby traps, bah humbugs, airport chases, the North Pole and a Christmas Carol Countdown, you’re guaranteed to find your Christmas spirit. Whether you take your own family or spread some holiday cheer by donating tickets to others, give the gift of local live theatre. This is a family friendly show appropriate for all ages, but likely best suited to 7+. $25 - $30 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13473 managed by ccc.", "dates": {"start": "2025-12-09T19:30:00", "end": "2025-12-09T20:30:00", "text": "9 Dec 2025 | 7:30 pm - 8:30 pm"}, "price": "$25 - $30", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/tree-rescue-for-wellbeing-13493", "title": "Tree rescue for wellbeing", "description": "Environment | Sustainability Looking for a chance to escape the office and pre-Christmas stress in the build-up to the end of the year? Come and spend a couple of hours in nature. 186 Bridle Path Road , Port Hills red zone Free event You will be contributing to the restoration of the Port Hills red zone as well as getting all the good feels of giving back, being outdoors and being together as a team. The mahi involves rescuing native trees from grass and weeds - bringing them into the light. It's like a treasure hunt - searching for your tree to release and mulch. If you are looking for an idea for a team day out to celebrate the year, this is it! I'll bring all the tools and some Christmas treats; you bring water and sun hat and enthusiasm! Wear closed-toe shoes and long pants and sleeves. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13493 managed by ccc.", "dates": {"start": "2025-12-10T09:30:00", "end": "2025-12-10T11:30:00", "text": "10 Dec 2025 | 9:30 am - 11:30 am"}, "price": null, "location": "See website for details", "categories": ["Environment", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:18:48Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christchurch-attractions-christmas-appeal-13450", "title": "Christchurch Attractions' Christmas Appeal", "description": "Central City Join us to donate needed items to the Christchurch City Mission! Donation/koha We’re proud to be supporting the Christchurch City Mission again this festive season to collect needed items for their foodbank and spread Christmas cheer with our local community in need for a seventh consecutive year. Join us to donate needed items to the value of $25 in exchange for a complimentary adult Christchurch Tram ticket valued at $40. A list of items needed by the foodbank over the holiday season is available on our website. All donations will then be collected by the Christchurch City Mission to be distributed to those in need. See our website for further information, and we hope to have you join us for this important cause: all donations will be very gratefully accepted. $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13450 managed by ccc.", "dates": {"start": "2025-12-10T10:00:00", "end": "2025-12-10T15:00:00", "text": "10 Dec 2025 | 10:00 am - 3:00 pm"}, "price": "$25", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:49Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/carols-around-the-fireplace-13354", "title": "Carols around the Fireplace", "description": "Central City | Music Gather around the fireplace for a nostalgic Christmas lunchtime sing-along led by The Arts Centre’s Creative Director Chris Archer. Free event Gather around the fireplace for a nostalgic Christmas lunchtime sing-along led by The Arts Centre’s Creative Director Chris Archer and vocalists Petrina Chisholm and Naomi Ferguson. Sing along to your favourite tunes and share the joy of the season with friends and family. Come and soak up the festive spirit in one of Christchurch’s most beautiful historic venues. It’s the perfect way to unwind, connect, and celebrate the magic of Christmas. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13354 managed by ccc.", "dates": {"start": "2025-12-10T12:30:00", "end": "2025-12-10T13:15:00", "text": "10 Dec 2025 | 12:30 pm - 1:15 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:18:49Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/lost-wax-in-three-sessions-hard-wax-907067", "title": "Lost Wax in Three Sessions - Hard Wax", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $256.00 $230.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #907067 managed by eventfinda.", "dates": {"start": "2025-12-10T17:30:00", "end": "2025-12-10T20:30:00", "text": "10 Dec 2025 | 5:30 pm - 8:30 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:49Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/merry-town-cashmere-13439", "title": "Merry Town | Cashmere", "description": "Dive into a Christmassy role-play adventure for recommended ages confident walkers to 6. Featuring 10 themed areas like Vets, Cafe, and Kiwi Outdoors. 5 Cracroft Terrace , St Augustine’s Cashmere Paid event Picture this; you and your wee one walk into Tiny Town at Christmas and it smells like a real Christmas village with the scent of pine trees and freshly baked gingerbread in the air. There is a special Christmas enhancement area where little hands can decorate a Christmas tree and try on some beautiful festive outfits. There are lots of special festive touches throughout the town and music to dance to! $22 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13439 managed by ccc.", "dates": {"start": "2025-12-11T09:30:00", "end": "2025-12-11T12:15:00", "text": "11 Dec 2025 | 9:30 am - 12:15 pm"}, "price": "$22", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:50Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/studio-101-basics-workshop-11211", "title": "Studio 101: Basics Workshop", "description": "Central City Nail the basics of studio use with this interactive course. During this intimate and hands-on workshop, experiment and learn in a welcoming environment. 400 St Asaph Street , Photosynthesis Paid event Studio photography opens up opportunities for fine art that pushes beyond the limits of ambient light. Complete control of light, environment, and camera settings: but where to start? Studio 101 is a 1.5-hour workshop teaching the basics of using a photography studio. Learn about common equipment, what types of lights and modifiers to use for different projects, how to construct multi-light set-ups and more. This hands-on course will see you experimenting in real time, trialling ideas and answering your questions. You will leave the workshop understanding how to take images of subjects using basic strobe and continuous lighting set-ups. Spaces are limited to 6 participants to maintain hands-on interactivity. Build your confidence and give yourself a strong foundation as you enter the world of studio photography and its possibilities. $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11211 managed by ccc.", "dates": {"start": "2025-12-11T19:30:00", "end": "2025-12-11T21:00:00", "text": "11 Dec 2025 | 7:30 pm - 9:00 pm"}, "price": "$25", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:50Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/50s-up-brass-in-concert-cashmere-13062", "title": "50's Up Brass in Concert | Cashmere", "description": "Music | Performance 50’s Up Brass will be hitting the road around Christchurch with our much-loved Xmas Concert Tour. 88 Hunter Terrace , Cashmere Club Paid event It’s one of the happiest times of the year for the band, and we can’t wait to share festive tunes, carols, and holiday cheer with you all. $5 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13062 managed by ccc.", "dates": {"start": "2025-12-12T14:00:00", "end": "2025-12-12T15:30:00", "text": "12 Dec 2025 | 2:00 pm - 3:30 pm"}, "price": "$5", "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:54Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/author-talk-dr-hinemoa-elder-915749", "title": "Author Talk | Dr Hinemoa Elder", "description": "Public Talks & Tours University Drive, Ilam, Christchurch University Bookshop, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #915749 managed by eventfinda.", "dates": {"start": "2025-12-12T18:00:00", "end": "2025-12-12T20:00:00", "text": "12 Dec 2025 | 6:00 pm - 8:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:54Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/author-talk-dr-hinemoa-elder-915744", "title": "Author Talk | Dr Hinemoa Elder", "description": "Public Talks & Tours University Drive, Ilam, Christchurch University Bookshop, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #915744 managed by eventfinda.", "dates": {"start": "2025-12-12T18:00:00", "end": "2025-12-12T20:00:00", "text": "12 Dec 2025 | 6:00 pm - 8:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:54Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/family-and-tamariki-wai-badge-making-13456", "title": "Family and Tamariki Wai Badge Making", "description": "Central City | Environment Make a badge about the vital importance of freshwater across Te Waipounamu on the opening day of Unutai e! Unutai e! Free event Join us in the foyer for badgemaking fun, using the water images in your badges. Anne Noble Te Awa Whakatipu 2024. Digital print, pigment on paper. Collection of Te Rūnanga o Ngāi Tahu. Exhibition developed and toured by Dunedin Public Art Gallery. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13456 managed by ccc.", "dates": {"start": "2025-12-13T10:00:00", "end": "2025-12-13T12:00:00", "text": "13 Dec 2025 | 10:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Environment"], "image": null, "updated_at": "2025-12-03T01:18:55Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/ferrymead-alive-canterbury-175th-13169", "title": "Ferrymead Alive - Canterbury 175th", "description": "Exhibition | Festival Step back in time and experience a day full of discovery, connection, and family fun at Ferrymead Alive! Tales & stories from the first 4 ships in 50 Ferrymead Park Drive , Ferrymead Heritage Park Paid event Join us at Ferrymead Heritage Park as we mark a milestone in Canterbury’s story – the 175th anniversary of the arrival of the First Four Ships. In December 1850, the Charlotte Jane, Randolph, Sir George Seymour, and Cressy carried around 800 settlers from England to Lyttelton Harbour. Their arrival marked the beginning of the planned settlement of Canterbury and the foundation of Christchurch. Come and walk in the footsteps of the pioneers, explore Canterbury’s beginnings, and celebrate our shared heritage. Step into a living Victorian Christmas. Morris dancers, live music, vintage cars, train and tram rides, storytelling, Father Christmas, and all the magic of Canterbury’s past brought to life. $15 - $60 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13169 managed by ccc.", "dates": {"start": null, "end": null, "text": "13 Dec 2025 - 14 Dec 2025 | 10:00 am - 4:00 pm"}, "price": "$15 - $60", "location": "See website for details", "categories": ["Exhibition", "Festival"], "image": null, "updated_at": "2025-12-03T01:18:55Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/new-brighton-seaside-christmas-parade-13495", "title": "New Brighton Seaside Christmas Parade", "description": "Festival | Music Come and join us at the seaside in New Brighton or a lively community parade, Christmas shopping and lots of festive fun. Free event Meet Santa on the Beach and watch a fun community Christmas Parade. Shop around our Seaside Market for your Christmas gifts, listen to live entertainment. Visit Santa in his Grotto We have a wonderful array of arts, crafts, giftware and delicious food. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13495 managed by ccc.", "dates": {"start": "2025-12-13T10:00:00", "end": "2025-12-13T14:00:00", "text": "13 Dec 2025 | 10:00 am - 2:00 pm"}, "price": null, "location": "See website for details", "categories": ["Festival", "Music"], "image": null, "updated_at": "2025-12-03T01:18:55Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/precious-metal-clay-taster-christmas-908807", "title": "Precious Metal Clay Taster - Christmas!", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $185.00 $167.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #908807 managed by eventfinda.", "dates": {"start": "2025-12-13T10:00:00", "end": "2025-12-13T13:00:00", "text": "13 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:56Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/manu-competition-te-hapua-halswell-summer-pool-13334", "title": "Manu Competition – Te Hāpua Halswell Summer Pool", "description": "Council events Get amongst the fun and join our manu competitions this summer to win prizes and become the Christchurch City Council manu champion. Paid event What's your signature manu style? Bring your whanau and show off your biggest splash. Join us for the second heat of our summer-long manu competition. Hit the water and afterwards enjoy free ice-cream from our sponsor, Streets, and unwind on our GIANT inflatables. Pack your togs, towel, and sunscreen, and bring your mates for an epic afternoon of manu action and prizes. Enter the manu competition in one of four categories. At the end of the competition season, the top three queens or kings of the manu will be awarded an official trophy and prizes. There will also be spot prizes up for grabs throughout the competition. The general pool admission price applies. Please check out the before you arrive. Standard entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13334 managed by ccc.", "dates": {"start": "2025-12-13T12:00:00", "end": "2025-12-13T14:00:00", "text": "13 Dec 2025 | 12:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:56Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/pool-party-schools-out-for-summer-13328", "title": "Pool Party - School’s Out For Summer!", "description": "Council events What time is it? Summertime! Say goodbye to schoolwork and hello to the ultimate pool party to kick off your summer break. Paid event Say goodbye to schoolwork and hello to the ultimate pool party to kick off your summer break. Whether you want to have a splash, test your obstacle course skills, or bounce into summer on a bouncy castle, we’ve got something for you! Mark your calendars – this is one day your tamariki will be talking about long after the splash-filled fun ends. Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13328 managed by ccc.", "dates": {"start": "2025-12-13T12:00:00", "end": "2025-12-13T17:00:00", "text": "13 Dec 2025 | 12:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:56Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/festive-fun-joy-in-miniature-914752", "title": "Festive Fun: Joy in Miniature", "description": "Arts and Crafts 2 Worcester Boulevard, Christchurch The Arts Centre Te Matatiki Toi Ora, Christchurch $46.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #914752 managed by eventfinda.", "dates": {"start": "2025-12-13T13:00:00", "end": "2025-12-13T15:00:00", "text": "13 Dec 2025 | 1:00 pm - 3:00 pm"}, "price": null, "location": "2 Worcester Boulevard, Christchurch | The Arts Centre Te Matatiki Toi Ora, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:57Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/joy-in-miniature-13395", "title": "Joy in Miniature", "description": "Central City Join Clay Maker Kay for a magical Christmas workshop and discover the joy of working in miniature! A Christmas Porcelain Workshop for Teens (Ages 12–16). Paid event Join Clay Maker Kay for a magical Christmas workshop and discover the joy of working in miniature! You’ll hand-build and paint your own porcelain and ceramic treasures. From tiny treasure bottles for necklaces to mini magnets and ornaments. Each piece will be carefully fired after the workshop before being packed, ready to treasure or gift this Christmas. Create your own piece of festive porcelain. A two-hour workshop with all materials provided. No clay experience necessary. $46 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13395 managed by ccc.", "dates": {"start": "2025-12-13T13:00:00", "end": "2025-12-13T15:00:00", "text": "13 Dec 2025 | 1:00 pm - 3:00 pm"}, "price": "$46", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:18:57Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/sing-connect-and-celebrate-with-the-muse-choirs-13437", "title": "Sing, Connect, and Celebrate with The Muse Choirs", "description": "Music | Performance A special afternoon of music and community. Enjoy a concert from our singers, a delicious afternoon tea and join our sing-along. No musical experience needed. 455 Hagley Avenue , The Multicultural Centre Free event The Muse Community Music Trust invites the public to a special afternoon of music and community. All Muse choirs will perform songs from Aotearoa, Samoa, and Zambia, alongside classic contemporary favourites, in a lively and heartwarming concert. After the concert, enjoy a hearty afternoon tea and join a relaxed sing-along of Christmas carols and well-loved songs — no musical experience required. This event also launches the Keepsake Singers, a daytime choir for older adults experiencing memory loss, or anyone looking for a friendly, accessible space to sing. Led by Gina Fowler, the choir focuses on familiar, enjoyable songs in a supportive social environment that encourages connection, joy, and shared musical moments. Entry is by koha, with all proceeds supporting The Muse’s Lighthouse Schools Project, which brings high-quality, holistic music education to tamariki in low-decile schools throughout Ōtautahi. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13437 managed by ccc.", "dates": {"start": "2025-12-13T13:00:00", "end": "2025-12-13T15:30:00", "text": "13 Dec 2025 | 1:00 pm - 3:30 pm"}, "price": null, "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:18:57Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-nutcracker-and-light-it-up-13392", "title": "The Nutcracker and Light It Up!", "description": "Live | Performance Southern Ballet Theatre proudly presents a spectacular celebration of its 50th Anniversary with a dazzling double bill this Christmas! 145 Gloucester Street , Isaac Theatre Royal Paid event The timeless holiday classic The Nutcracker and the bold, contemporary production Light It Up! These unforgettable performances will showcase Southern Ballet’s talented students in a breathtaking display of dance, light, and storytelling. Audiences of all ages will be enchanted by The Nutcracker, a beloved ballet that captures the magic and wonder of the festive season. From the sparkling snowflakes to the Sugar Plum Fairy, this production promises to delight with its stunning costumes, captivating new choreography, and heartwarming story. In contrast, Light It Up offers a powerful modern dance experience that explores the emotional and visual journey of life. Through innovative lighting, dynamic movement, and transformative staging, this new work highlights the creativity and evolution of Southern Ballet Theatre over the past five decades. Cocktail Function to Celebrate 50 Years of Southern Ballet Theatre! Southern Ballet Theatre warmly invites you to join us for a very special function as we celebrate our 50th Anniversary — a milestone marking five decades of dance, creativity, and community. This elegant cocktail function honours the remarkable legacy of our founder, Lorraine Peters QSM, whose vision and dedication have shaped generations of dancers and inspired countless audiences. Come raise a glass with us in celebration of our past, present, and future — either post-function of the matinee or as a pre-function to the evening performance of Southern Ballet Theatre’s 50th Anniversary Gala. $42.99 - $64.20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13392 managed by ccc.", "dates": {"start": "2025-12-13T13:30:00", "end": "2025-12-13T16:00:00", "text": "13 Dec 2025 | 1:30 pm - 4:00 pm"}, "price": "$42.99 - $64.20", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/glass-bead-making-taster-christmas-session-908579", "title": "Glass Bead-Making Taster - Christmas session!", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $128.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #908579 managed by eventfinda.", "dates": {"start": "2025-12-13T14:00:00", "end": "2025-12-13T17:00:00", "text": "13 Dec 2025 | 2:00 pm - 5:00 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/voices-acapella-choir-13446", "title": "Voices Acapella Choir", "description": "Central City | Performance Enjoy this Acapella experience this festive season. Free event This December, Voices Co. Academy are once again taking to the streets and spaces of Ōtautahi with their annual Pop-Up Carolling community initiative. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13446 managed by ccc.", "dates": {"start": "2025-12-13T14:30:00", "end": "2025-12-13T15:00:00", "text": "13 Dec 2025 | 2:30 pm - 3:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:02Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-vegan-night-makete-christmas-special-13452", "title": "The Vegan Night Mākete - Christmas Special", "description": "Food | Music The Vegan Night Mākete showcases the best plant-based foods and goods. Around 25 stalls offer a huge variety of savouries and sweets, plus entertainment. 39 Nursery Road , Phillipstown Community Hub Free event Christchurch’s monthly Vegan Night Mākete (market) showcases the best local plant-based foods and goods, raises awareness of environmental and animal welfare and the health benefits of veganism and brings the community together. The Christmas Special event boosts extra stalls, many gift-related, as well as our annual raffle draw, a Santa Clause lolly scramble, and special guests in the form of Irish Dancers. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13452 managed by ccc.", "dates": {"start": "2025-12-13T17:00:00", "end": "2025-12-13T20:00:00", "text": "13 Dec 2025 | 5:00 pm - 8:00 pm"}, "price": null, "location": "See website for details", "categories": ["Food", "Music"], "image": null, "updated_at": "2025-12-03T01:19:02Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/cso-and-rova-present-festive-christmas-11777", "title": "CSO and Rova Present: Festive Christmas", "description": "Central City | Music Get into the holiday spirit with the Christchurch Symphony Orchestra. Join us as we deck the halls with Christmas treasures in a concert for the whole whānau. Paid event A joyful night of music to warm your heart and fill you with cheer. Join CSO, led by NZ Assistant Conductor in Residence Reuben Brown, as we deck the halls with Christmas treasures in a concert perfect for the whole whānau. Whether you’re singing along to your favourite carols or enjoying the rich sound of the orchestra, this concert promises to leave you glowing with Christmas joy. Come celebrate the most wonderful time of the year with us. $25 - $50 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11777 managed by ccc.", "dates": {"start": "2025-12-13T18:30:00", "end": "2025-12-13T20:30:00", "text": "13 Dec 2025 | 6:30 pm - 8:30 pm"}, "price": "$25 - $50", "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:19:02Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/south-christchurch-farmers-market-christmas-markets-13366", "title": "South Christchurch Farmers' Market Christmas Markets", "description": "Food All your usual quality, fresh produce stalls plus seasonal fruits and extra arts, crafts and specialty stalls created by local artisans. 370 Colombo Street , South Christchurch Farmers' Market Free event Come on down for some Festive Farmers' Market shopping! Stock up on fresh, quality local produce for Christmas Day and browse the additional arts, crafts and specialty stalls for stocking fillers and unique gifts for family and friends. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13366 managed by ccc.", "dates": {"start": "2025-12-14", "end": "2025-12-14", "text": "14 Dec 2025"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:02Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/waitomo-triathlon-festival-11909", "title": "Waitomo Triathlon Festival", "description": "The Waitomo Triathlon Festival is a collection of multisport events for all ages and abilities from 5 years up. Entries can be made as teams or individuals. 54 Greywacke Road , Lake Rua Paid event Get ready for an awesome freshwater swim, a flat and fast bike and finish with a scenic trail run on a spectator-friendly course. From its inception in 2010, the Triathlon Festival has set a new standard for multisport events in Canterbury. With a wide variety of events from which to choose, there is something for everyone from the first-time runner to the professional athlete. If you have ever had the desire to give a triathlon a go, the festival atmosphere and safe environment at Lake Rua make it an ideal starting point. The festival comprises: $25 - $99 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11909 managed by ccc.", "dates": {"start": "2025-12-14T08:00:00", "end": "2025-12-14T12:00:00", "text": "14 Dec 2025 | 8:00 am - 12:00 pm"}, "price": "$25 - $99", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:03Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/natural-textured-rings-christmas-gift-making-909761", "title": "Natural Textured Rings - Christmas gift-making", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $115.00 $128.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #909761 managed by eventfinda.", "dates": {"start": "2025-12-14T10:00:00", "end": "2025-12-14T13:00:00", "text": "14 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:03Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/otautahi-preloved-clothing-markets-december-13235", "title": "Ōtautahi Preloved Clothing Markets | December", "description": "Sustainability | Environment Christmas preloved clothing market. Refresh your wardrobe by browsing and buying someone else's. 75 London Street , Richmond Club, The Borough (Workingmen's Club) Donation/koha There will be 25+ amazing stallholders selling their recently cleared-out wardrobes. Just in time for Christmas. Preloved clothing, shoes, handbags & accessories. Womenswear, menswear and kids wear. Please bring cash, as only some stalls will accept bank transfers. Cafe, restaurant and playground on site. Heaps of free carparking, New World across the road. We can't wait to see you there! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13235 managed by ccc.", "dates": {"start": "2025-12-14T10:00:00", "end": "2025-12-14T13:00:00", "text": "14 Dec 2025 | 10:00 am - 1:00 pm"}, "price": null, "location": "See website for details", "categories": ["Sustainability", "Environment"], "image": null, "updated_at": "2025-12-03T01:19:03Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/folk-dances-from-bulgaria-and-the-balkans-lessons-868376", "title": "Folk Dances From Bulgaria and The Balkans: Lessons", "description": "Dance Classes 170 Clyde Road, Fendalton, Christchurch Fendalton Community Centre, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #868376 managed by eventfinda.", "dates": {"start": "2025-12-14T15:00:00", "end": "2025-12-14T17:00:00", "text": "14 Dec 2025 | 3:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:04Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/in-your-community-a-woolston-brass-christmas-13351", "title": "In your Community - A Woolston Brass Christmas!", "description": "Central City Celebrate Christmas with the entire Woolston Brass family for a relaxed Christmas celebration at The Arts Centre. Free event Celebrate Christmas with the entire Woolston Brass family, encompassing Woolston Junior Band, Woolston Concert Brass, and the mighty Woolston Brass Band as this iconic Christchurch organisation presents a relaxed Christmas Celebration in an equally iconic Christchurch venue - the North Quad of the magnificent Arts Centre. From massed Christmas brassiness combining all three bands to breathtaking individual performances by each band, this uniquely-Christchurch Christmas spectacle is not to be missed! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13351 managed by ccc.", "dates": {"start": "2025-12-14T15:00:00", "end": "2025-12-14T16:30:00", "text": "14 Dec 2025 | 3:00 pm - 4:30 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:04Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/a-balkan-christmas-13373", "title": "A Balkan Christmas", "description": "Music | Performance The Musica Balkanica Choir is pleased to present it's annual Christmas concert. Enjoy Carolling the Balkan way 22 Main South Road , St Peter's Anglican Church Donation/koha Please enjoy an evening of carolling the Balkan way and learn of the Christmas traditions from the region. Carols from Bulgaria, Hungary, Ukraine, Romania, Serbai and other countries will put you in the festive mood. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13373 managed by ccc.", "dates": {"start": "2025-12-14T17:30:00", "end": "2025-12-14T19:00:00", "text": "14 Dec 2025 | 5:30 pm - 7:00 pm"}, "price": null, "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:04Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/punching-up-performer-workshop-912775", "title": "Punching Up: Performer Workshop", "description": "Arts and Crafts 224 Saint Asaph Street, Christchurch Good Times Comedy Club, Christchurch $30.00 $35.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #912775 managed by eventfinda.", "dates": {"start": "2025-12-15T18:00:00", "end": "2025-12-15T19:30:00", "text": "15 Dec 2025 | 6:00 pm - 7:30 pm"}, "price": null, "location": "224 Saint Asaph Street, Christchurch | Good Times Comedy Club, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/get-your-skate-on-disco-13409", "title": "Get Your Skate On Disco", "description": "Council events Roll into the festive season with a roller-skating disco. We'll equip you with everything you need to get you rolling along with friends and family. 70 Broadlands Drive , Selwyn Sports Centre Paid event Our Get Your Skates On programme is getting festified thanks to Phat Sk8 Roller Discos. To celebrate the final week of this class, we're opening it up to all ages and adding disco lights to brighten up your evening. The event is indoors across 2 basketball courts and there'll be a skating pro to provide tips to getting you rolling along with confidence. Fun games, music and goodies galore! All skates, helmets and protective gear are provided. Suitable for all ages 2yrs+ including adults. $8 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13409 managed by ccc.", "dates": {"start": "2025-12-16T15:30:00", "end": "2025-12-16T17:00:00", "text": "16 Dec 2025 | 3:30 pm - 5:00 pm"}, "price": "$8", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-art-of-banksy-13063", "title": "The Art of Banksy", "description": "Central City | Exhibition Visiting the South Island for the first time this summer, the world's largest exhibition of Banksy art. Paid event The Art of Banksy showcases more than 150 pieces of original and authenticated Banksy artworks, including prints, canvases and unique pieces. These artworks will be on display at its new temporary home in the heart of the city. The exhibition includes artworks which brought Banksy to international attention, including the first Flower Thrower and the Girl with Balloon, which will be displayed in four different colour variations – including a rare Gold Edition. This will be your last chance to see these pieces in New Zealand and is one of the final steps on The Art of Banksy’s 10-year global tour. The collectors who lent these artworks have now decided the works need to come home. Don't miss the opportunity to see this must-see exhibition of thought-provoking artwork from the global phenomenon Banksy! $35 - $60 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13063 managed by ccc.", "dates": {"start": null, "end": null, "text": "17 Dec 2025 - 27 Jan 2026 | 10:00 am - 5:00 pm"}, "price": "$35 - $60", "location": "See website for details", "categories": ["Central City", "Exhibition"], "image": null, "updated_at": "2025-12-03T01:19:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/kids-christmas-crafts-13482", "title": "Kids Christmas Crafts", "description": "Festival Join us at one of our Christmas crafternoon sessions and enjoy festive creativity for kids and families. 78 Nortons Road Paid event With over 25 different crafts to choose from, kids and adults alike will enjoy wandering around the tables and selecting Christmas crafts, decorations, and festive creations to make. This is a \"Stay, Play, and Make\" event; adults are required to stay with children for the duration of the event to help and support, regardless of children's age. Hands-on fun with tons of freedom for kids to make their own choices and enjoy the Christmassy creativity. Kids will make up to 12 crafts each. Parents and caregivers, you are welcome to buy tickets and join in the making too!! All of the Christmas crafts can be viewed on our website. $20 - $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13482 managed by ccc.", "dates": {"start": "2025-12-17T13:30:00", "end": "2025-12-17T15:00:00", "text": "17 Dec 2025 | 1:30 pm - 3:00 pm"}, "price": "$20 - $25", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/award-winning-woodcut-with-artist-ben-reid-13442", "title": "Award-winning Woodcut with Artist Ben Reid", "description": "Central City Learn the timeless art of woodcut printing with award-winning local artist Ben Reid. Bookings essential, see our website for details. Paid event Join us for a relaxing and inspiring evening as you design, carve and print your own original artwork using traditional tools and techniques. no experience needed - just bring your creativity. $20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13442 managed by ccc.", "dates": {"start": "2025-12-17T18:00:00", "end": "2025-12-17T20:00:00", "text": "17 Dec 2025 | 6:00 pm - 8:00 pm"}, "price": "$20", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/inspired-life-drawing-with-hannah-beehre-13441", "title": "Inspired Life drawing with Hannah Beehre", "description": "Central City | Live Step into the 1920s, as you explore Raymond McIntyre’s era through clothed life drawing. Bookings essential, see our website for detail Donation/koha Discover the mode of the 1920s and the look of Mcintyre's portraiture with 2 models and a range of period dress. Image: Raymond McIntyre Suzette c 1914 oil on panel. Collection of Christchurch Art Gallery Te Puna o Waiwheū, presented by Mary Good, London, 1975 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13441 managed by ccc.", "dates": {"start": "2025-12-17T18:00:00", "end": "2025-12-17T20:00:00", "text": "17 Dec 2025 | 6:00 pm - 8:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:19:10Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/paint-an-ornament-with-paint-and-sip-13355", "title": "Paint an Ornament with Paint and Sip", "description": "Central City Paint your very own unique Kiwiana ornament to hang on the christmas tree. Suitable for adults and children ages 5+. (Caregiver required for under 12 years). Paid event Paint your very own unique Kiwiana ornament to hang on the Christmas tree. Suitable for adults and children ages 5+. (Caregiver required for under 12 years) Includes: Ornament painting takes approximately 30 minutes - 1 hour, depending on the age/level of detail applied to the work. $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13355 managed by ccc.", "dates": {"start": "2025-12-18T11:00:00", "end": "2025-12-18T12:00:00", "text": "18 Dec 2025 | 11:00 am - 12:00 pm"}, "price": "$25", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:10Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/silverlocks-swing-christmas-13364", "title": "Silverlocks Swing Christmas", "description": "Central City | Music Join your favourite Silverlockians as they bring swing and a smile to your lead up to Christmas. This band will put you in the mood for the festive season. Paid event Join your favourite Silverlockians as they bring swing and a smile to your lead up to Christmas. Known for their banter and swinging style this band will put you in the mood for the festive fun to come. Premium tickets include a reserved seat at a table and a free tipple or just find a seat in our theatre style seating. Featuring a fantastic lineup of Ōtautahi musicians - Mike Bickers (trumpet), Clara Dujakovic (trombone), Alex Boot (alto saxophone), James Lawton (tenor saxophone), Lana Law (baritone saxophone), Mike Kime (double bass), Nicholae Didenco (drums) and Molly McGee (vocals). Led by the super smiley Katie Martin on keys these swinging Christmas songs will have you singing along. $20 - $40 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13364 managed by ccc.", "dates": {"start": "2025-12-18T19:00:00", "end": "2025-12-18T21:00:00", "text": "18 Dec 2025 | 7:00 pm - 9:00 pm"}, "price": "$20 - $40", "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:19:10Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/perfuct-storm-december-13200", "title": "Perfuct Storm - December", "description": "Central City | Performance Watch lightning strike, not once, not twice, but over and over again as the Perfuct team blows the roof off with 10 rounds of knockout improvised comedy. Paid event Your special favourites Burns, Bain, Cusdin, and Nelis, along with regular special guests, return monthly to deliver your special fix of the most delicious, special, improvised comedy show in town, Perfuct Storm for the last time in 2025! $15 - $20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13200 managed by ccc.", "dates": {"start": "2025-12-19T20:30:00", "end": "2025-12-19T21:30:00", "text": "19 Dec 2025 | 8:30 pm - 9:30 pm"}, "price": "$15 - $20", "location": "See website for details", "categories": ["Central City", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/festive-holiday-fun-zone-and-brick-building-13352", "title": "Festive Holiday Fun Zone and Brick Building", "description": "Central City Enjoy some outdoor fun in the sun with games and activities for tamariki, then head indoors for festive LEGO building. Free event Enjoy some outdoor fun in the sun with games and activities for tamariki, then head indoors for festive LEGO building when it’s time to cool off - while you take a moment to unwind! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13352 managed by ccc.", "dates": {"start": "2025-12-20T10:00:00", "end": "2025-12-20T15:00:00", "text": "20 Dec 2025 | 10:00 am - 3:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/imagination-playground-13458", "title": "Imagination Playground", "description": "Central City | Live Come along and create. Free event The Imagination Playground is back for another summer of fun, so come and create your own exciting space in the Gallery. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13458 managed by ccc.", "dates": {"start": "2025-12-20T10:00:00", "end": "2025-12-20T17:00:00", "text": "20 Dec 2025 | 10:00 am - 5:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:19:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/linwood-drain-enhancement-project-12408", "title": "Linwood Drain Enhancement Project", "description": "Environment | Sustainability Local groups and residents are getting together to enhance the Linwood Drain, including beautifying the walking track and improving water quality. 112 Tilford Street , Linwood Drain on the east side of Tilford Free event A few local groups and residents are getting together to enhance the look of the Linwood Drain. Not just to beautify this walking track for all to enjoy, but also to improve the water quality for our special eel (tuna) and whitebait found here. We need your help! Can you spare the occasional Saturday morning? No need to book, just be there. We will be planting, removing weeds, watering, mulching, removing litter and pruning as required. Plants are kindly donated by 'Trees for Canterbury' native tree nursery. Tools, good company and morning tea are provided. Wear closed footwear and dress for the weather. Together we can make a difference. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12408 managed by ccc.", "dates": {"start": "2025-12-20T10:00:00", "end": "2025-12-20T12:00:00", "text": "20 Dec 2025 | 10:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": ["Environment", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:19:11Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/otautahi-crafters-market-christmas-edition-13481", "title": "Ōtautahi Crafters Market Christmas Edition", "description": "Central City | Sustainability Shop local this Christmas at the Ōtautahi Crafters Market! 100+ makers, festive treats, sensory hour and tote bags! Free event With 100+ incredible local makers, you’ll find unique gifts, handmade treasures, festive treats, art, home décor, jewellery, clothing, and so much more — all lovingly crafted by Christchurch creatives and small businesses. This year we’re giving away 400 Christmas tote bags: A custom charity claw machine, festive décor, food options, and plenty of indoor space to explore. Come celebrate the season, support local, and discover the magic of handmade this Christmas. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13481 managed by ccc.", "dates": {"start": null, "end": null, "text": "20 Dec 2025 - 21 Dec 2025 | 10:00 am - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:19:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/relax-in-our-reading-nook-and-manuka-stories-13459", "title": "Relax in Our Reading Nook and Mānuka Stories", "description": "Central City | Libraries Pick a book connected to our exhibitions and settle into our brand-new summer reading nook. Bring family and enjoy this new space. Along with CCC Mānuka stories Free event Come and enjoy our reading Nook all summer long starting on the 20 December through to 25 January, with special librarian reading days 7 and 21 January at 2.30pm for the Mānuka Stories. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13459 managed by ccc.", "dates": {"start": "2025-12-20T10:00:00", "end": "2025-12-20T17:00:00", "text": "20 Dec 2025 | 10:00 am - 5:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Libraries"], "image": null, "updated_at": "2025-12-03T01:19:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/taniwha-in-motion-13460", "title": "Taniwha in Motion", "description": "Central City | Exhibition Drop in and create your own moving taniwha with coloured and patterned paper, pencils, scissors and clips. Free event Fun for the whole family - come along and have some fun! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13460 managed by ccc.", "dates": {"start": "2025-12-20T10:00:00", "end": "2025-12-20T14:00:00", "text": "20 Dec 2025 | 10:00 am - 2:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Exhibition"], "image": null, "updated_at": "2025-12-03T01:19:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/pool-party-summer-chill-out-13329", "title": "Pool Party - Summer Chill Out", "description": "Council events Summer’s heating up, come chill out by the pool! Join us for an epic pool party, complete with an obstacle course and towering king slide. Paid event Slip, slop, slap, and wrap, and join us at Waltham Summer pool on Saturday 20 December from 12 to 5pm—this is one day your tamariki will be talking about long after the splash-filled fun ends! Thanks to Streets, you can even treat yourself to a free ice cream! It doesn’t get better than this! Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13329 managed by ccc.", "dates": {"start": "2025-12-20T12:00:00", "end": "2025-12-20T17:00:00", "text": "20 Dec 2025 | 12:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/manu-competition-waltham-summer-pool-13335", "title": "Manu Competition – Waltham Summer Pool", "description": "Council events Get amongst the fun and join our manu competitions this summer to win prizes and become the Christchurch City Council manu champion. Paid event Things are heating up at Waltham Summer Pool this weekend with a day of pool parties and the third manu competition of the summer. Don’t miss your chance to join us for an epic showdown. Head over to show us what you’ve got. Feeling hungry? Our friends at Streets have you covered with free ice creams to keep you cool. Enter the manu competition in one of four categories. At the end of the competition season, the top three queens or kings of the manu will be awarded an official trophy and prizes. There will also be spot prizes up for grabs throughout the competition. The general pool admission price applies. Please check out the before you arrive. Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13335 managed by ccc.", "dates": {"start": "2025-12-20T12:00:00", "end": "2025-12-20T14:00:00", "text": "20 Dec 2025 | 12:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:16Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christmas-kate-sheppard-cycle-tour-13348", "title": "Christmas Kate Sheppard Cycle Tour", "description": "Central City | Tour Come and enjoy a Christmas Tour, with a difference! Paid event Ride in the wheel tracks of history and revolution! $36.90 - $39.90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13348 managed by ccc.", "dates": {"start": "2025-12-21T09:00:00", "end": "2025-12-21T12:00:00", "text": "21 Dec 2025 | 9:00 am - 12:00 pm"}, "price": "$36.90 - $39.90", "location": "See website for details", "categories": ["Central City", "Tour"], "image": null, "updated_at": "2025-12-03T01:19:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/gatherings-christmas-market-13400", "title": "Gatherings Christmas Market", "description": "Central City | Sustainability Our annual Christmas Market is back! Local makers, live music, drinks & festive fun across Gatherings and our new bar, Kisi. 5/2 Papanui Road , Gatherings Restaurant & Kisi Bar Free event It’s that time again — our annual Christmas Market is back! A sunny afternoon of local makers, live tunes, drinks, and festive fun spilling through Gatherings and our brand-new bar Kisi. Come for the creativity, stay for the snacks, and soak up the good vibes of summer, community, and Christmas cheer. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13400 managed by ccc.", "dates": {"start": "2025-12-21T12:00:00", "end": "2025-12-21T15:00:00", "text": "21 Dec 2025 | 12:00 pm - 3:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:19:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/plainsmen-chorus-13457", "title": "Plainsmen Chorus", "description": "Music | Performance Come in, take a seat and celebrate the festive season with the sounds of Ōtautahi’s Plainsmen Chorus. Free event The choral will sing a medley of classic yuletide songs to give festive cheer Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13457 managed by ccc.", "dates": {"start": "2025-12-22T13:00:00", "end": "2025-12-22T13:40:00", "text": "22 Dec 2025 | 1:00 pm - 1:40 pm"}, "price": null, "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/public-backstage-tours-902415", "title": "Public Backstage Tours", "description": "Public Talks & Tours 129 Gloucester Street, Christchurch The Court Theatre, Christchurch $15.00 $10.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #902415 managed by eventfinda.", "dates": {"start": "2025-12-22T16:00:00", "end": "2025-12-22T17:00:00", "text": "22 Dec 2025 | 4:00 pm - 5:00 pm"}, "price": null, "location": "129 Gloucester Street, Christchurch | The Court Theatre, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:17Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/public-backstage-tours-the-court-theatre-12801", "title": "Public Backstage Tours | The Court Theatre", "description": "Tour Step behind the curtain and discover how the magic is made at The Court Theatre, from the first sketch to the final spotlight. Paid event Guided Tours are back but with a friendly twist!* Step behind the curtain and discover how the magic is made at The Court Theatre. From the first sketch to the final spotlight, everything that appears on stage is carefully designed and lovingly crafted to transport our audiences into entirely new worlds. Now back in the heart of Christchurch, The Court Theatre creates everything on-site, from the construction of grand sets in our workshop to the design and fabrication of the stunning costumes you’ve seen in productions like Strictly Ballroom and Something Rotten!. A Friend of The Court Theatre will host your tour, sharing stories of past productions and giving you a real taste of what goes on behind the scenes at the South Island's largest theatre company. Please note that as this tour may go through the workshop and backstage areas, closed toe shoes must be worn for health and safety reasons. *Court Theatre Guided Tours are proudly supported and delivered by the Friends of The Court Theatre. $10 - $15 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12801 managed by ccc.", "dates": {"start": "2025-12-22T16:00:00", "end": "2025-12-22T17:00:00", "text": "22 Dec 2025 | 4:00 pm - 5:00 pm"}, "price": "$10 - $15", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:18Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/carols-by-candlelight-13145", "title": "Carols by Candlelight", "description": "Central City | Live Join us on Christmas Eve in Victoria Square for this extra special carol-singing candlelight event, as we celebrate Christmas with our Christchurch community. Free event Since 1948 Carols by Candlelight has been a unique event in Christchurch, that encourages people to get together and celebrate family and Christmas in a traditional and magical manner. Bringing together all faiths, age groups and cultures, Carols by Candlelight is a true celebration of family, of Christmas and of community spirit. Carols by Candlelight starts at 9pm and features the Salvation Army Band, guest performers, a combined Christchurch choir and a special Children's choir, who lead us through a programme of traditional and fun carol singing. Candles and carol books will be on sale, the proceeds of which help make this event possible. Food and coffee vendors will be on-site for refreshments, head down early to get a great spot. This event is brought to you by The Kind Foundation, with the kind support of the Noelene and Dave Diggs Foundation, Christchurch City Council and The Elizabeth Ball Trust. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13145 managed by ccc.", "dates": {"start": "2025-12-24T21:00:00", "end": "2025-12-24T22:00:00", "text": "24 Dec 2025 | 9:00 pm - 10:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:19:18Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/lakes-festival-2025-13449", "title": "Lakes Festival 2025", "description": "Festival | Music Lakes Festival is live for its fifth instalment in 2025 - escape the ordinary and embrace the extraordinary in our beautiful Hagley Park this December. Paid event Lakes Festival is live for its fifth instalment in 2025 - escape the ordinary and embrace the extraordinary in our beautiful Hagley Park this December. Eat, Drink & Dance the day away with 10 hours of outstanding international, national, and local talent at one of the most breathtaking event locations New Zealand has to offer. We have greatly increased our live entertainment offering this year featuring bands and live electronica performing across three uniquely designed stages, delivering a fully immersive festival experience like no other. New to the festival this year is Racket Club, a dedicated blackout techno space designed to make you sweat plus complement and contrast our interactive Lake and Park stages. $193.24 - $453 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13449 managed by ccc.", "dates": {"start": "2025-12-28T12:00:00", "end": "2025-12-28T22:30:00", "text": "28 Dec 2025 | 12:00 pm - 10:30 pm"}, "price": "$193.24 - $453", "location": "See website for details", "categories": ["Festival", "Music"], "image": null, "updated_at": "2025-12-03T01:19:18Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/nye25-13101", "title": "NYE25", "description": "Council events | Music Ōtautahi Christchurch! NYE25 – powered with Hydrate by IHF, is your biggest free NYE party, and it's back with Kora - one of New Zealand’s most electrifying live acts. Free event NYE25 – powered with Hydrate by IHF, has never looked better. New Year's Eve will be headlined by Kora, one of New Zealand’s most electrifying live acts, with an enduring career and legacy that resonates across the generations. Joining the lineup are top Kiwi talents Dillastrate, Brad Staley and DJ Sambora, setting the stage for an unforgettable night. To top things off, we'll wrap up the night and welcome in 2026 with an epic fireworks display. The best part... entry is free. Entry into the event will close at 11.45pm. This is a smoke-free, vape-free and alcohol-free event (24-hour liquor ban). For quick entry, don’t bring a bag as these may be searched upon entry. No glass allowed. Got little ones? Before entry, all eventgoers must agree to a bag search. Sambora aka Sam Trevethick brings over two decades of global experience as a producer, DJ, and founding member of Shapeshifter to the decks this New Year’s Eve. Known for his ability to read any crowd and deliver high-energy, genre-spanning sets from drum and bass to soul, house, and party classics, Sam’s performances are immersive, expertly crafted, and guaranteed to ignite the dancefloor. With a resume that includes festival mainstages, corporate events, and national broadcasts, Sam is set to bring serious vibes to the celebration. A huge thanks to our sponsor - Hydrate by IHF. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13101 managed by ccc.", "dates": {"start": "2025-12-31T20:00:00", "end": "2025-12-31T00:00:00", "text": "31 Dec 2025 | 8:00 pm - 12:00 am"}, "price": null, "location": "See website for details", "categories": ["Council events", "Music"], "image": null, "updated_at": "2025-12-03T01:19:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/nye-kids-countdown-13103", "title": "NYE Kids Countdown", "description": "Council events | Music Bring in 2026 with your whānau at NYE Kids Countdown - powered with Hydrate by IHF, for the biggest afternoon family event in Ōtautahi Christchurch! Free event NYE Kids Countdown - powered with Hydrate by IHF, is kicking off the New Year’s Eve celebrations early with a special kids’ event that your whānau won’t want to miss. Join the fun without having to stay out late! The free event is headlined by The Backseats, who will lead the celebrations with songs and kid-friendly entertainment. DJ Chick will be there to bring the beats, and That Dance Studio will bring some talented young dancers to the stage. To wrap up the festivities, there will be a mock countdown at 7pm, complete with confetti canons. A range of food trucks will be onsite, selling yummy kai and drinks. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13103 managed by ccc.", "dates": {"start": "2025-12-31T16:00:00", "end": "2025-12-31T19:00:00", "text": "31 Dec 2025 | 4:00 pm - 7:00 pm"}, "price": null, "location": "See website for details", "categories": ["Council events", "Music"], "image": null, "updated_at": "2025-12-03T01:19:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/awaken-to-higher-consciousness-888233", "title": "Awaken to Higher Consciousness", "description": "Mind & Body 166 Waimairi Rd, Ilam, Christchurch Waimairi Road Community Centre, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #888233 managed by eventfinda.", "dates": {"start": "2026-01-06T19:00:00", "end": "2026-01-06T20:00:00", "text": "6 Jan 2026 | 7:00 pm - 8:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/studio101-basics-workshop-13313", "title": "Studio101: Basics Workshop", "description": "Central City Nail the basics of studio use with this interactive course. During this intimate and hands-on workshop, experiment and learn in a welcoming environment. 400 St Asaph Street , Photosynthesis Paid event Studio photography opens up opportunities for fine art that pushes beyond the limits of ambient light. Complete control of light, environment, and camera settings: but where to start? The aim of this workshop is teaching the basics of using a photography studio. Learn about common equipment, what types of lights and modifiers to use for different projects, how to construct multi-light set-ups and more. This hands-on course will see you experimenting in real time, trialling ideas and answering your questions. You will leave the workshop understanding how to take images of subjects using basic strobe and continuous lighting set-ups. Build your confidence and give yourself a strong foundation as you enter the world of studio photography and its possibilities. $25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13313 managed by ccc.", "dates": {"start": "2026-01-08T19:30:00", "end": "2026-01-08T21:00:00", "text": "8 Jan 2026 | 7:30 pm - 9:00 pm"}, "price": "$25", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:23Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/anthony-harper-summer-theatre-13288", "title": "Anthony Harper Summer Theatre", "description": "Central City | Council events The Lord of the Rings in 90 Minutes! is a playful spin on Tolkien’s epic trilogy The Lord of the Rings, set against the stunning backdrop of the Botanic Gardens. Donation/koha Calling all elves, orcs and halflings! Buckle up for a glorious, laugh a minute journey into Middle Earth (and back again). Rollicking Entertainment (from the 2025 Summer Theatre hit, The Complete Voyage of the RMS Titanic) returns this summer, as three actors and a musician attempt the impossible - to retell the famous trilogy in one outrageous live experience! Complete with battles, LOTR bingo and a banging early noughties soundtrack, expect an evening filled with irreverent delight. In 2026 we welcome back the wizardry of familiar faces (and variety entertainment legends) Darlene Mohekey, Dan Pengelly and Lizzie Tollemache to the Archery Lawn. The influential Lord of the Rings film series changed the face of tourism in Aotearoa forever. Now it's time for a version that delivers live music, ridiculous impersonations, and local jokes. Pack up a picnic (be it lembas bread, potatoes or something raw and wriggling) and see you in the gardens, for the return of the zing! Anthony Harper Summer Theatre is free to attend, but koha donations will be gratefully accepted by Rollicking Entertainment. Audiences are encouraged to bring chairs, picnic blankets and food to enjoy during the show (whether it be economy or first-class level dining). All ages are welcome, although these shows are best enjoyed by ages 12 years and over. Rollicking Entertainment previously produced Summer Theatre’s The Complete Voyage of the RMS Titanic, Treasure Island and King Arthur, while collaborator Dan Pengelly was the director for Peter Pan, The Wizard of Oz and Robin Hood. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13288 managed by ccc.", "dates": {"start": "2026-01-09T19:00:00", "end": "2026-01-09T20:30:00", "text": "9 Jan 2026 | 7:00 pm - 8:30 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Council events"], "image": null, "updated_at": "2025-12-03T01:19:24Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/finding-the-still-point-in-uncertainty-13489", "title": "Finding the Still Point in Uncertainty", "description": "Live | Talk A public Dharma talk with visiting Zen teacher Jody Hojin Kimmel Sensei exploring how we meet change and uncertainty with presence, insight, and stillness. 217 Ferry Road , The Quaker Centre Donation/koha Join visiting Zen teacher Jody Hojin Kimmel Sensei for an evening exploring how we meet change and uncertainty with presence and clarity. As T.S. Eliot wrote, “At the still point of the turning world, there the dance is.” Through story, reflection, and moments of shared stillness, Hojin Sensei invites us to reconnect with what remains steady even when life feels unpredictable. Hojin Sensei is the Abbot of the Zen Center of New York City and a long-time teacher in the Mountains and Rivers Order, with more than three decades of residential training and teaching experience. This talk includes time for questions and is one of two teachings offered during her visit to Christchurch. No prior experience with meditation or Zen is required. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13489 managed by ccc.", "dates": {"start": "2026-01-09T19:00:00", "end": "2026-01-09T21:00:00", "text": "9 Jan 2026 | 7:00 pm - 9:00 pm"}, "price": null, "location": "See website for details", "categories": ["Live", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:24Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/finding-the-still-point-in-uncertainty-an-evening-with-hojin-sensei-916307", "title": "Finding the Still Point in Uncertainty: An Evening with Hojin Sensei", "description": "Public Talks & Tours 217 Ferry Rd, Christchurch Quaker Centre, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #916307 managed by eventfinda.", "dates": {"start": "2026-01-09T19:00:00", "end": "2026-01-09T20:30:00", "text": "9 Jan 2026 | 7:00 pm - 8:30 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:24Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/a-brush-with-words-haiga-and-ekphrasis-workshop-916313", "title": "A Brush with Words: Haiga and Ekphrasis Workshop", "description": "Arts and Crafts 4 Kennedy Place, Hillsborough, Christchurch Opawa Zendo, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #916313 managed by eventfinda.", "dates": {"start": "2026-01-10T09:00:00", "end": "2026-01-10T15:00:00", "text": "10 Jan 2026 | 9:00 am - 3:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:24Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/pool-party-summer-splash-13330", "title": "Pool Party - Summer Splash!", "description": "Council events No plans? No worries! We’ve got you covered with an unforgettable pool party, with fun for the whole whānau. Paid event With massive inflatables and epic bouncy castles, there’s hours of fun to be had! Plus, thanks to our friends at Streets, we’ll even have free ice creams—get in quick, they’ll go fast! Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13330 managed by ccc.", "dates": {"start": "2026-01-10T12:00:00", "end": "2026-01-10T17:00:00", "text": "10 Jan 2026 | 12:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/a-brush-with-words-haiga-and-ekphrasis-workshop-13490", "title": "A Brush with Words: Haiga and Ekphrasis Workshop", "description": "Exhibition | Talk A workshop with visiting Zen teacher Jody Hojin Kimmel Sensei exploring haiga, poetry, and contemplative creativity through brushwork, writing, and presence. 4 Kennedy Place , Opawa Zendo Paid event Join visiting Zen teacher Jody Hojin Kimmel Sensei for a creative full-day workshop exploring haiga and ekphrasis. Haiga brings together brushwork and poetry, while ekphrasis invites writing shaped by images. Through guided practice, steady attention, and simple materials, participants discover how creativity can arise naturally from presence itself. Hojin Sensei is the Abbot of the Zen Center of New York City and a long-time teacher in the Mountains and Rivers Order, with more than three decades of residential Zen training and creative teaching experience. The day includes meditation instruction for newcomers, time for reflection, and supportive group practice. No artistic background, writing experience, or Zen training is required — this workshop is open to complete beginners as well as those with established practice. All materials are provided. $100 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13490 managed by ccc.", "dates": {"start": "2026-01-10T09:00:00", "end": "2026-01-10T15:00:00", "text": "10 Jan 2026 | 9:00 am - 3:00 pm"}, "price": "$100", "location": "See website for details", "categories": ["Exhibition", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/jimmy-carr-laughs-funny-tour-12338", "title": "Jimmy Carr: Laughs Funny Tour", "description": "Performance | Talk If you like fast-paced, edgy one-liners, then get ready to be happy. Paid event Jimmy Carr is going back on tour with his brand-new show, Jimmy Carr: Laughs Funny. Jimmy tells jokes, and jokes are like magnets. Jokes attract people, but they can also repel. Some people are repelled by Jimmy's dark brand of comedy. This show is not for them. But if it's the kind of thing you like, then this is the kind of thing you’ll like. Hurry, this will definitely sell out. $89.90 - $99.90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12338 managed by ccc.", "dates": {"start": "2026-01-10T20:00:00", "end": "2026-01-10T00:00:00", "text": "10 Jan 2026 | 8:00 pm - 12:00 am"}, "price": "$89.90 - $99.90", "location": "See website for details", "categories": ["Performance", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:25Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/level-2-eft-training-course-913665", "title": "Level 2 EFT Training Course", "description": "Mind & Body 12 Oakview Lane, Cashmere, Christchurch Set Free with EFT, Christchurch $970.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #913665 managed by eventfinda.", "dates": {"start": "2026-01-12T09:00:00", "end": "2026-01-12T17:00:00", "text": "12 Jan 2026 | 9:00 am - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:26Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/skate-n-splash-13410", "title": "Skate 'n' Splash", "description": "Join an affordable, active day out for the whole whānau with a raging roller-skating party then cool off at the local indoor swimming pool. 70 Broadlands Drive , Selwyn Sports Centre Paid event Start with roller-skating fun at the Selwyn Sports Centre and then head across the road to the Selwyn Aquatic Centre any time to enjoy the water and fun pool activities for as long as you'd like. An active day out, guaranteed to be lots of fun for all. All skates and protective gear are provided for roller-skating. One free ice block available at the Selwyn Aquatic Centre for each Skate 'n' Splash participant. Need a break between skating and swimming? Enjoy the outdoor reserves and playgrounds between the facilities, all within walking distance. $12 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13410 managed by ccc.", "dates": {"start": "2026-01-13T12:30:00", "end": "2026-01-13T16:00:00", "text": "13 Jan 2026 | 12:30 pm - 4:00 pm"}, "price": "$12", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/film-the-wild-robot-13461", "title": "FILM The Wild Robot", "description": "Central City | Film A wonderful tale of friendship. Free event In this animated epic an intelligent robot is stranded on an uninhabited island and must learn to adapt, building relationships with the animals on the island. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13461 managed by ccc.", "dates": {"start": "2026-01-15T10:00:00", "end": "2026-01-15T11:30:00", "text": "15 Jan 2026 | 10:00 am - 11:30 am"}, "price": null, "location": "See website for details", "categories": ["Central City", "Film"], "image": null, "updated_at": "2025-12-03T01:19:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/bricks-of-olympus-13412", "title": "Bricks of Olympus", "description": "Exhibition See ancient myth brought to life in brick form at the UC Teece Museum, & marvel at awe-inspiring models created by LEGO® masterminds Jake Roos and Emily Fryer. 3 Hereford Street , UC Teece Museum Free event See ancient myth brought to life in ‘Bricks of Olympus’ at the UC Teece Museum. Created by LEGO® masterminds Jake Roos and Emily Fryer, (winner and runner up in Season One of LEGO® Masters New Zealand), this brick-shaped tribute to the gods will feature ancient myth as its story telling heart. Marvel at a large-scale automated theatre, constructed from LEGO® bricks, telling the epic adventure of Odysseus – monsters and shipwrecks galore! Discover the science behind the build. Explore the dynamics of brick construction with our minifigure legions, who will be demonstrating the principles of simple machines in motion around the gallery. More levers, wheels, pulleys, inclined planes, wedges, and screws than you can throw a lightning bolt at. See centaurs transporting an ancient tombstone on wheels and marvel at the warriors lifting a giant amphora with a pulley. Whether you are into building brick masterpieces, or are fascinated by the construction of ancient myth, this is the exhibition for you! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13412 managed by ccc.", "dates": {"start": "2026-01-15T11:00:00", "end": "2026-01-15T16:00:00", "text": "15 Jan 2026 | 11:00 am - 4:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/bricks-of-olympus-grand-opening-13411", "title": "Bricks of Olympus Grand Opening", "description": "Exhibition Bring your family and friends to celebrate the launch of Bricks of Olympus with the UC Teece Museum and Maths Craft NZ! Free event Bring your family and friends to celebrate the launch of Bricks of Olympus with the UC Teece Museum and Maths Craft NZ! Join us for a day packed full of crafty brick fun for all ages. Bring the family to this event to experience the fun of LEGO® mosaic making and maths craft and be inspired to start building your own epic arty creations. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13411 managed by ccc.", "dates": {"start": "2026-01-15T11:00:00", "end": "2026-01-15T16:00:00", "text": "15 Jan 2026 | 11:00 am - 4:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/manu-competition-te-hapua-halswell-summer-pool-13336", "title": "Manu Competition – Te Hāpua Halswell Summer Pool", "description": "Council events Get amongst the fun and join our manu competitions this summer to win prizes and become the Christchurch City Council manu champion. Paid event The manu competition season is nearing its grand finale! Don’t miss your chance to join us for an epic showdown. Head over to Te Hāpua Halswell Summer Pooll to show us what you’ve got! Pack your togs, towel, and sunscreen, and bring your mates for an epic afternoon of manu action and prizes. Enter the manu competition in one of four categories. At the end of the competition season, the top three queens or kings of the manu will be awarded an official trophy and prizes. There will also be spot prizes up for grabs throughout the competition. The general pool admission price applies. Please check out the before you arrive. Standard entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13336 managed by ccc.", "dates": {"start": "2026-01-17T12:00:00", "end": "2026-01-17T14:00:00", "text": "17 Jan 2026 | 12:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/pool-party-summer-palooza-13331", "title": "Pool Party - Summer Palooza", "description": "Council events Round up your friends and whānau for a day packed with excitement at Te Hāpua Halswell Summer Pool! Paid event Round up your friends and whānau for an epic afternoon at Te Hāpua Halswell Summer Pool! Bounce, slip, slide, and splash on our slides, bouncy castles, GIANT inflatables, and obstacle course! Plus, enjoy face painting, and a free ice cream courtesy of our mates at Streets. Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13331 managed by ccc.", "dates": {"start": "2026-01-17T12:00:00", "end": "2026-01-17T17:00:00", "text": "17 Jan 2026 | 12:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/art-therapy-13462", "title": "Art Therapy", "description": "Central City | Tour Christchurch Art as Therapy Group create a gentle space where visitors can connect with the Artworks and be carefully guided through creative responses Donation/koha Your guides are professionally qualified Creative Art Therapists from New Zealand (Viv Kepes) and abroad (Diana Alieva). Together developing their practice, aiding personal growth and learning. Meeting in the Christchurch Art Gallery, Te Puna o Waiwhetū Foyer the group will move through gallery spaces discussing and connecting to the Artwork, then in response, move through to the classroom where creativity can begin. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13462 managed by ccc.", "dates": {"start": "2026-01-17T14:00:00", "end": "2026-01-17T16:00:00", "text": "17 Jan 2026 | 2:00 pm - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Tour"], "image": null, "updated_at": "2025-12-03T01:19:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/beats-by-bingo-at-renegade-brewing-co-13484", "title": "Beats By Bingo at Renegade Brewing Co.", "description": "Central City | Music Beats By Bingo is back at Renegade Brewing Co! Hosted by Taylor Ruddle, this musical bingo show will have you bopping in your seat and singing along in no time. 1/105 Orbell Street , Renegade Brewing Co Free event Beats By Bingo is back at Renegade Brewing Co for 2026! Hosted by Taylor Ruddle, this musical bingo show will have you bopping in your seat and singing along in no time. Expect plenty of laughs, awesome prizes, and a rotating mix of crowd-pleasing playlists. It’s super easy to play. We'll also be giving out spot prizes in a test of skill, as well as a prize every round so that's 6 possible prizes to win! Spots fill up fast, so contact Renegade Brewing Co today to book your table! The wee cartoons on the poster and graphics for this event were drawn by Rosie. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13484 managed by ccc.", "dates": {"start": "2026-01-17T19:00:00", "end": "2026-01-17T21:00:00", "text": "17 Jan 2026 | 7:00 pm - 9:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:19:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/magic-and-circus-3-day-workshop-13398", "title": "Magic and Circus | 3-day workshop", "description": "Central City | Performance Could you be the magician who vanishes into thin air? Would you dare to juggle secrets whispered by the wind? Paid event This holiday, step behind the curtain and into an adventure of creativity, confidence, and performance, where anything is possible. From sleight of hand to circus flair, from storytelling to stage craft, this is your chance to build your own show and become the performer you’ve always dreamed of being. Over three spellbinding days, young people will explore the worlds of magic, circus and theatre in a fun, supportive environment where imagination takes centre stage. The workshop concludes with a live showcase for family and friends, where the stories, skills, and surprises come to life on stage. Will you be the one to say the magic words and bring the show to life? $250 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13398 managed by ccc.", "dates": {"start": null, "end": null, "text": "19 Jan 2026 - 21 Jan 2026 | 9:00 am - 3:00 pm"}, "price": "$250", "location": "See website for details", "categories": ["Central City", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/magic-and-circus-holiday-camp-914823", "title": "Magic and Circus Holiday Camp", "description": "Arts and Crafts 4 Rolleston Avenue, Christchurch Papa Hou - Black Box & Venues, Christchurch $250.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #914823 managed by eventfinda.", "dates": {"start": "2026-01-19T09:00:00", "end": "2026-01-19T15:00:00", "text": "19 Jan 2026 | 9:00 am - 3:00 pm"}, "price": null, "location": "4 Rolleston Avenue, Christchurch | Papa Hou - Black Box & Venues, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:32Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/create-sparkling-waka-and-tiny-taniwha-13506", "title": "Create Sparkling Waka and Tiny Taniwha", "description": "Central City | Live Let your imagination lead the way and draw from books to create your waka and taniwha in the education room. Paid event We will have numerous books that you can draw from to spark your imagination to design your own Waka and craft a tiny taniwha. All materials included, bookings essential. see website. $5 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13506 managed by ccc.", "dates": {"start": "2026-01-19T13:00:00", "end": "2026-01-19T15:00:00", "text": "19 Jan 2026 | 1:00 pm - 3:00 pm"}, "price": "$5", "location": "See website for details", "categories": ["Central City", "Live"], "image": null, "updated_at": "2025-12-03T01:19:33Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/world-buskers-festival-12855", "title": "World Buskers Festival", "description": "Festival | Live The World Buskers Festival returns with street performances, comedy, music and circus acts. A vibrant celebration of local and global talent! Free event Ōtautahi Christchurch mark your calendars! We’re officially back, bringing ten days of wild, world-class street performance back to the heart of the city. It’s time to come and explore another unforgettable summer of comedy, cabaret, circus, and chaos as local legends and global stars transform Ōtautahi into one giant stage. Haere mai, bring the whānau, and get ready to experience the magic. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12855 managed by ccc.", "dates": {"start": null, "end": null, "text": "22 Jan 2026 - 1 Feb 2026 | 10:00 am - 10:00 pm"}, "price": null, "location": "See website for details", "categories": ["Festival", "Live"], "image": null, "updated_at": "2025-12-03T01:19:33Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/saddle-up-and-set-sail-hunt-for-the-malthouse-treasure-13268", "title": "Saddle Up and Set Sail: Hunt For The Malthouse Treasure", "description": "Live | Performance An exciting, swashbuckling adventure featuring amazing magic, terrible jokes, line dancing, shoe-based combat and heaps of interaction with the kids. 71 Colombo Street , The Malthouse Paid event Saddle Up and Set Sail is an exciting, swashbuckling adventure featuring the magical pirate Jack Albatross and \"The Fastest Pun in the West... Coast\" Silly the Kid. Our two heroes clash as both are searching for the same treasure, but over the course of the show learn to appreciate each other's skills and learn about the value of teamwork and friendship. This show contains amazing magic, terrible jokes, line dancing, shoe-based combat and heaps of interaction with the kids. Playing Jack Albatross is Steve Wilbury. Steve is a globe-trotting entertainer whose journey began on the streets with a deck of cards, a few circus props, and an irrepressible grin. Over the past twenty years, he has taken his unique blend of comedy, circus, and award-winning magic to audiences across five continents. Career highlights include five-star reviews and festival awards, multiple international tours, and countless unforgettable performances at events ranging from street festivals to corporate galas. His shows also include heartfelt work about life with a disability and chronic pain. Steve shows how our most difficult circumstances can help us to see life as it really is. The man behind Silly the Kid is 2x award-winning Christchurch comedian Taylor Ruddle. Taylor is known for his friendly, relaxed delivery and performs a mix of storytelling, one liners and satire in his cheeky pop-culture and wordplay-laden style. Taylor has been performing since 2015 and has opened for such acts as Aunty Donna, Joe Daymond and Blake Pavey. Taylor's most recent theatrical performance was as Papa Bear in the completely sold out 12 show run at The Malthouse Theatre in Christchurch. Saddle Up and Set Sail is aimed at children 5 and up and promises to be an interactive experience full of mind-blowing magic and belly laughter that you won't soon forget. $10 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13268 managed by ccc.", "dates": {"start": "2026-01-22T13:00:00", "end": "2026-01-22T14:00:00", "text": "22 Jan 2026 | 1:00 pm - 2:00 pm"}, "price": "$10", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:37Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/uci-continental-series-13429", "title": "UCI Continental Series", "description": "An exciting weekend of premier cross country Olympic format mountain biking. Free event Compete if you can, spectate if you can't! The racing will feature excellent riders from New Zealand, Australia and further afield. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13429 managed by ccc.", "dates": {"start": null, "end": null, "text": "24 Jan 2026 - 25 Jan 2026 | 8:00 am - 6:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:37Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/kite-day-2026-13377", "title": "Kite Day 2026", "description": "Council events Come fly with us at New Brighton Beach! Grab your kite, pack a picnic and get ready for a fun day in the sun. Free event Round up your kites for Kite Day 2026! A busy, colourful and creative display of sky-high creatures, cartoons and shapes for all ages to enjoy. Bring your friends and whānau along for some kite-flying fun or watch the experts show their skills and impressive collections as they fly large groups of kites all at once. It’s also the perfect opportunity for beach activities like swimming, sandcastle building and picnicking. To make a day of it, check out the many local eateries and shops in New Brighton. Remember to be SunSmart – slip, slop, slap and wrap. Let’s leave the beach cleaner than we found it. Please take all your belongings and rubbish away with you, and for safety reasons don’t bring glass. Please leave your dogs at home. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13377 managed by ccc.", "dates": {"start": "2026-01-24T12:00:00", "end": "2026-01-24T16:00:00", "text": "24 Jan 2026 | 12:00 pm - 4:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:37Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/manu-competition-grand-final-jellie-park-13337", "title": "Manu Competition GRAND FINAL – Jellie Park", "description": "Council events Our epic grand final is here. Get amongst it – enter the competition or come watch the fun and find out who will be crowned the 2026 Manu Champion. Paid event Who will be crowned the Christchurch City Council Manu Champion of 2026? Will it be you? We have four competition categories: Under 13s, 13 to 18 years, open female and adult. Enter on the day to go up against our semi-final winners. The top three queens or kings of the manu will be awarded an official trophy, t-shirt and prizes. We have spot prizes to give out on the day too, including pool passes and slide passes. Thanks to our sponsor Streets, we’ve got free ice creams to give away – sweet. Pack your togs, towel, and sunscreen and gather your mates. The general pool admission price applies. Please check out the before you come. Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13337 managed by ccc.", "dates": {"start": "2026-01-24T12:00:00", "end": "2026-01-24T14:00:00", "text": "24 Jan 2026 | 12:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:38Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/pool-party-summer-sports-day-13332", "title": "Pool Party – Summer Sports Day", "description": "Council events Grab your friends and whānau, pack your togs, towel and sunscreen and splash into the final pool party of the season! Paid event Get ready for the ultimate summer sports day pool party! We’ve got a GIANT lineup of inflatables – think obstacle courses, the inflatable Gladiator, Bull Rush bouncy castles, and an inflatable basketball hoop. Plus, sports fans can meet their favourite Rams and Tactix players, and sweet treat lovers can enjoy a free ice cream, courtesy of our friends at Streets. We’ve even got our Manu Competition Grand Finale happening – it’s a day packed with excitement! Standard pool entry fees Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13332 managed by ccc.", "dates": {"start": "2026-01-24T12:00:00", "end": "2026-01-24T17:00:00", "text": "24 Jan 2026 | 12:00 pm - 5:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:38Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/ed-sheeran-loop-tour-12857", "title": "Ed Sheeran | Loop Tour", "description": "Live | Music Ed Sheeran is coming to town, for two shows! Fans will experience his chart-topping songs, sure to be an amazing concert! Paid event Frontier Touring and MG Live are thrilled to announce the hotly anticipated return of global superstar Ed Sheeran, who is heading back to New Zealand with his all-new Loop Tour for a massive run of stadium shows. Having already sold over 2.5 million tickets across Australia and New Zealand to date, Ed Sheeran’s Loop Tour sees the beloved singer returning to our shores with a brand-new live show that’ll follow the release of his new album, Play. Performing at stadiums in Auckland, Wellington, and Christchurch (his first show there in 11 years), Ed’s new live show promises to be filled with surprises, new music, as well as his biggest hits. With a brand-new album, a renewed creative spirit and a catalogue of global hits, Ed Sheeran’s 2026 stadium tour is set to be one of the most anticipated live events of the year. Don’t miss the return of one of the world’s most loved live performers! $109.90 - $229.90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12857 managed by ccc.", "dates": {"start": "2026-01-24T17:30:00", "end": "2026-01-24T00:00:00", "text": "24 Jan 2026 | 5:30 pm - 12:00 am"}, "price": "$109.90 - $229.90", "location": "See website for details", "categories": ["Live", "Music"], "image": null, "updated_at": "2025-12-03T01:19:38Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/8-days-of-play-beginners-busking-workshop-914647", "title": "8 Days Of Play - Beginners Busking Workshop", "description": "Family & Lifestyle Central City Christchurch, Christchurch World Buskers Festival, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #914647 managed by eventfinda.", "dates": {"start": "2026-01-25T10:00:00", "end": "2026-01-25T12:00:00", "text": "25 Jan 2026 | 10:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:39Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/8-days-of-play-rock-painting-and-storytelling-914649", "title": "8 Days Of Play - Rock Painting and Storytelling", "description": "Arts and Crafts Central City Christchurch, Christchurch World Buskers Festival, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #914649 managed by eventfinda.", "dates": {"start": "2026-01-26T10:00:00", "end": "2026-01-26T12:00:00", "text": "26 Jan 2026 | 10:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:39Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/new-enterprise-workshops-907754", "title": "New Enterprise Workshops", "description": "Education 4 Rolleston Avenue, Christchurch The Kind Foundation, Christchurch Free event Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #907754 managed by eventfinda.", "dates": {"start": "2026-01-28T09:00:00", "end": "2026-01-28T16:00:00", "text": "28 Jan 2026 | 9:00 am - 4:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:39Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/talk-helen-brown-on-ka-whakatauraki-the-promises-13465", "title": "Talk | Helen Brown on Kā Whakatauraki: The Promises", "description": "Exhibition | Talk Join Helen Brown, Principal Advisor, Ngāi Tahu Archive, as she discusses the documents which were the key evidence at the heart of Te Kerēme, the Ngāi Tahu. Free event Listen and learn the histories of land and people. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13465 managed by ccc.", "dates": {"start": "2026-01-28T18:00:00", "end": "2026-01-28T19:30:00", "text": "28 Jan 2026 | 6:00 pm - 7:30 pm"}, "price": null, "location": "See website for details", "categories": ["Exhibition", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:40Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/run-the-ranges-13048", "title": "Run The Ranges", "description": "Tour Travel deep into the Southern Alps for a three-day trail running adventure through some of New Zealand's most breathtaking alpine landscapes. Paid event Explore winding mountain trails and take in sweeping high country views at an easy-going pace. Each day brings fresh air, shared stories, and unforgettable moments topped off with the welcoming touch of Kiwi hospitality. This trip isn't just about running - it's about connecting to the land, to High Country life, and to a small, like-minded crew of runners. Just pack your trail gear - we'll take care of the rest. Check out the website for all the details! $995 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13048 managed by ccc.", "dates": {"start": null, "end": null, "text": "30 Jan 2026 - 1 Feb 2026 | 9:00 am - 5:00 pm"}, "price": "$995", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:40Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/workshop-cut-paper-forests-13469", "title": "Workshop | Cut-paper Forests", "description": "Central City | Exhibition Inspired by trees and nature, cut-paper artist Sarah Lund will be your guide as you make your own work of art. Free event Create with paper - an artist and family workshop. Bookings essential. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13469 managed by ccc.", "dates": {"start": "2026-01-31T10:00:00", "end": "2026-01-31T12:30:00", "text": "31 Jan 2026 | 10:00 am - 12:30 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Exhibition"], "image": null, "updated_at": "2025-12-03T01:19:40Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/great-kiwi-beer-festival-13372", "title": "Great Kiwi Beer Festival", "description": "Festival | Food The South Island's largest beer festival returns to North Hagley Park for its 15th year. Sample exceptional brews, watch top chefs and enjoy live music all day. Paid event Returning to North Hagley Park on Saturday 31 January 2026, this popular Canterbury festival attracts approximately 10,000 beer enthusiasts for an exceptional summer experience. Choose from hundreds of beers from breweries across New Zealand, with brewers on hand to share their knowledge and passion. Enjoy a comprehensive programme of educational and entertaining seminars designed to enhance your appreciation of craft beer. Watch top chefs demonstrate their culinary skills in the Cooking Theatre, perfectly pairing food with great brews. A full day of live music entertainment keeps the atmosphere buzzing from start to finish. As the largest beer festival in the South Island, this is a must-do event on Canterbury's summer calendar. $59.90 - $289.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13372 managed by ccc.", "dates": {"start": "2026-01-31T11:00:00", "end": "2026-01-31T18:30:00", "text": "31 Jan 2026 | 11:00 am - 6:30 pm"}, "price": "$59.90 - $289", "location": "See website for details", "categories": ["Festival", "Food"], "image": null, "updated_at": "2025-12-03T01:19:44Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/natural-textured-rings-summer-915858", "title": "Natural Textured Rings - Summer", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $122.00 $135.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #915858 managed by eventfinda.", "dates": {"start": "2026-01-31T14:00:00", "end": "2026-01-31T17:00:00", "text": "31 Jan 2026 | 2:00 pm - 5:00 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:44Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/panel-discussion-freshwater-in-te-waipounamu-13471", "title": "Panel Discussion | Freshwater in Te Waipounamu", "description": "Environment | Talk Drawing on Unutai e! Unutai e! panellists including Tumai Cassidy and Aaria Rolleston will explore freshwater issues and discuss the significance of document. Free event An insight into our wai and the protection it deserves. image: Anne noble Te Awa Wakatipu 2024, Digital print, pigment on paper. Collection of Te Rūnanga o Ngāi Tahu. Exhibition developed by Dunedin Public Art gallery. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13471 managed by ccc.", "dates": {"start": "2026-01-31T14:00:00", "end": "2026-01-31T15:15:00", "text": "31 Jan 2026 | 2:00 pm - 3:15 pm"}, "price": null, "location": "See website for details", "categories": ["Environment", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:44Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/canterbury-classic-triathlon-and-duathlon-11915", "title": "Canterbury Classic Triathlon and Duathlon", "description": "The Canterbury Classic is a collection of multisport events for all ages and abilities from 5 years up. Entries can be made as teams or individuals. Lyttelton , Corsair Bay Paid event The Canterbury Classic is an old-school triathlon and duathlon focused on providing a good, honest course with options for all ages and abilities. We offer an Olympic distance and short course race over a testing course with plenty of hills on the bike and run, along with a kids' aquathon. If you are not planning on racing, we need the support of the tri community to make this event happen. The event will include: Olympic distance triathlon/duathlon: Aquabike options (swim/bike/no run). Short-distance triathlon: Kids Aquathon 5 to 12-year-olds $25 - $99 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11915 managed by ccc.", "dates": {"start": "2026-02-01T07:00:00", "end": "2026-02-01T13:00:00", "text": "1 Feb 2026 | 7:00 am - 1:00 pm"}, "price": "$25 - $99", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:45Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/summer-in-the-styx-2026-13318", "title": "Summer in the Styx 2026", "description": "Environment | Sustainability Join the Styx Living Laboratory Trust for our annual Summer in the Styx event. It's a fun day of family-friendly festivities in Te Waoku Kahikatea Reserve. 303 Radcliffe Road , Te Waoku Kahikatea Reserve Free event Summer in the Styx is an event for the community to come and learn more about the amazing conservation mahi happening in Ōtautahi Christchurch and in particular the Pūharakekenui/Styx River Catchment. We'll have a range of stallholders, food, kayaking, guided walks, games, and so much more. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13318 managed by ccc.", "dates": {"start": "2026-02-01T10:00:00", "end": "2026-02-01T14:00:00", "text": "1 Feb 2026 | 10:00 am - 2:00 pm"}, "price": null, "location": "See website for details", "categories": ["Environment", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:19:45Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/summer-sundays-13368", "title": "Summer Sundays", "description": "Council events | Music First up in our outdoor summer music series is DnD Showband – Fleetwood Mac tribute and Silver Train – The Rolling Stones tribute! Free event Summer Sundays, Christchurch's outdoor summer music series returns this summer with three free concerts to entertain the crowds. First up, DnD Showband – Fleetwood Mac tribute and Silver Train – The Rolling Stones tribute! Picnic food, drinks and chairs are welcome – no glass, please. Check out our other Summer Sundays live sessions happening on 8 and 22 February! One of NZ's longest established tribute-covers acts, DnD Showband is set to perform at Christchurch City Council’s Summer Sundays Series in February 2026. Over the years the South Island based showband has played on the main stage at many of the major events across of the country including food festivals, masters games, carnivals and sporting events. They are also a regular act on the chartered club circuit across the country, performing tribute shows from their extensive catalogue of costumed theme shows such as Fleetwood Mac, ABBA, Grease, 60s, 70s, 80s, Rocky Horror and Moulin Rouge. DnD's performances reﬂect their experience as entertainers and artists. Their shows are skilfully delivered, visually energetic and brimming with enthusiasm. On Sunday 1 February 2026, as part of Summer Sundays in the Botanic Gardens, the five-piece band pays tribute to legendary rock band, Fleetwood Mac, with a set spanning 1968's Albatross through to 1987's Little Lies. Christchurch’s own Silver Train comprises some of the city’s finest musicians bringing the spirit, swagger and raw energy of The Rolling Stones to life with every performance. More than just a tribute group, they channel the electricity of rock’s greatest band with fiery renditions delivered with attitude and stage presence. From the infectious groove of ‘Sympathy for the Devil’ to the strut of ‘Start Me Up’, Silver Train deliver the hits with an edge that keeps audiences wanting more! Armed with gritty vocals, snarling guitars, and a rhythm section that rolls as hard as it rocks, Silver Train captures not just the sound, but the magic of the Stones on stage. Every show is a celebration of timeless rock’n’roll. Expect to hear all the classics from ‘Can’t always get what you want’ to ‘Wild Horses,’ ‘Jumping Jack Flash,’ ‘Gimme Shelter’ and more. If you are a fan of the Stones or just love live rock’n’roll then do not miss this! Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13368 managed by ccc.", "dates": {"start": "2026-02-01T13:00:00", "end": "2026-02-01T16:00:00", "text": "1 Feb 2026 | 1:00 pm - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Council events", "Music"], "image": null, "updated_at": "2025-12-03T01:19:45Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-quarter-13479", "title": "The Quarter", "description": "Music | Performance Enjoy an evening at The Quarter, set to debut with Queer Horizons – a special night of ambient music and poetry in response to Whāia te Taniwha. Free event Soak up the waiata of Dj's AAKI, Rōrepo and tom plum as you relax in comfy spaces, enjoy kai and inu from food trucks, and experience in a whole new light. Photo: Bri Leone-Rhea Lawrence Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13479 managed by ccc.", "dates": {"start": "2026-02-04T18:00:00", "end": "2026-02-04T21:00:00", "text": "4 Feb 2026 | 6:00 pm - 9:00 pm"}, "price": null, "location": "See website for details", "categories": ["Music", "Performance"], "image": null, "updated_at": "2025-12-03T01:19:46Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/nerd-nite-christchurch-908188", "title": "Nerd Nite Christchurch", "description": "Public Talks & Tours 579 Colombo St, Christchurch A Rolling Stone, Christchurch $15.00 $10.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #908188 managed by eventfinda.", "dates": {"start": "2026-02-04T18:30:00", "end": "2026-02-04T20:20:00", "text": "4 Feb 2026 | 6:30 pm - 8:20 pm"}, "price": null, "location": "579 Colombo St, Christchurch | A Rolling Stone, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:46Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/art-safari-13468", "title": "Art Safari", "description": "Central City Bring your pre-schooler along for a fun artmaking session. Free event Fun activities for 2-4yr olds. Why not then stay for Storytime at 10.30am presented by Tūranga. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13468 managed by ccc.", "dates": {"start": "2026-02-05T10:00:00", "end": "2026-02-05T12:00:00", "text": "5 Feb 2026 | 10:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:46Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/create-your-own-story-keeper-13467", "title": "Create Your Own Story Keeper", "description": "Central City | Exhibition Cosy up with a storybook in our reading nook and make a special celebratory bookmark to continue your reading and learning at home Free event Come in and create a bookmark with us. Ngataiharuru Taepa. Te Mahara 2018. Oxides and acrylic on wood. Collection of Christchurch Art gallery Te Puna o Waiwhetū, purchased 2018. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13467 managed by ccc.", "dates": {"start": "2026-02-07T10:00:00", "end": "2026-02-07T12:00:00", "text": "7 Feb 2026 | 10:00 am - 12:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Exhibition"], "image": null, "updated_at": "2025-12-03T01:19:47Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/nostalgia-festival-13371", "title": "Nostalgia Festival", "description": "Festival | Music Family-friendly music festival at Ferrymead on Waitangi Weekend featuring Balu Brigada, Ladyhawke, Troy Kingi, Hollie Smith, Harper Finn and Tami Neilson. 50 Ferrymead Park Drive Paid event Now in its 12th year, Nostalgia Festival transforms Ferrymead Historic Park into a music lover's paradise on Saturday 7 February 2026. This boutique Waitangi Weekend celebration brings together around 5,000 people for a day of exceptional live performances across four stages. Headliner Balu Brigada leads a stellar lineup of New Zealand talent in the heritage park's unique 1900s setting. Between sets wander through markets, catch roving theatre acts, and enjoy local food and craft beverages. The new \"New Future Nostalgia Stage\" debuts this year, spotlighting up-and-coming youth bands. With its commitment to sustainability and community connection, this family-friendly festival offers something different on Canterbury's summer calendar. $69.90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13371 managed by ccc.", "dates": {"start": "2026-02-07T12:00:00", "end": "2026-02-07T20:00:00", "text": "7 Feb 2026 | 12:00 pm - 8:00 pm"}, "price": "$69.90", "location": "See website for details", "categories": ["Festival", "Music"], "image": null, "updated_at": "2025-12-03T01:19:47Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/glass-bead-making-taster-summer-915859", "title": "Glass Bead-Making Taster - Summer", "description": "Arts and Crafts 49 Ferry Rd, Christchurch Workspace Studios, Christchurch $128.00 $115.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #915859 managed by eventfinda.", "dates": {"start": "2026-02-07T14:00:00", "end": "2026-02-07T17:00:00", "text": "7 Feb 2026 | 2:00 pm - 5:00 pm"}, "price": null, "location": "49 Ferry Rd, Christchurch | Workspace Studios, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:47Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/summer-sundays-13369", "title": "Summer Sundays", "description": "Council events | Music Chill out and enjoy Going Bush – A Kate Bush Tribute, Lloyd and Doublet and Kelly Horgan at the second Summer Sundays afternoon session! Free event Summer Sundays, Christchurch's outdoor summer music series returns this summer with three free concerts to entertain the crowds. Second in line, Going Bush – A Kate Bush Tribute, Lloyd and Doublet and Kelly Horgan. Picnic food, drinks and chairs are welcome – no glass, please. Check out our other Summer Sundays live sessions happening on 1 and 22 February! Kate Bush, one of the most unique, authentic songwriters and alternative entertainers of last century. Going Bush: A Kate Bush Tribute will fulfil any desires of the hardcore, long time Kate Bush worshipper as well as any newcomers to her legacy. After sellout shows in 2023, Charlotte Crone and the Going Bush band will conjure songs such as ‘Running up that Hill’, ‘Babooshka’ and ‘Wuthering Heights’ as well as some lesser-known personal favourites. Come and get lost in a magical afternoon of carefully selected back Katealogue among the lush surrounds of the Christchurch Botanic Gardens Archery Lawn. Keyboardist John Sanchez-Lloyd has, over the years, played in numerous bands including Tui Award winners The Coalrangers. He has backed a variety of performers including rockabilly artist Rosie Flores, blues singer Ruby Wilson as well as support for John Hammond, The Amazing Rhythm Aces, Blind Boy Paxton and Darren Watson. His session work has seen him contribute to recordings by many NZ artists including The Eastern, Graham Wardrop, Tiny Lies and The Gypsy Pickers. Guitarist Phil Doublet is a multi-award-winning musician and is no stranger to the music scene. As a multi-instrumentalist and working from his home base in Christchurch, he is sought after as a session player for recording projects in Europe, U.S.A, Australia and New Zealand. Phil is a staunch advocate for original music and has produced five albums which have received accolades, including finalist for NZ Best Country Album of the Year 2017. Kelly Horgan is a New Zealand singer-songwriter best known as the frontman and principal songwriter of Heavy Jones Trio, a Christchurch-based band that carved out a distinctive space in Aotearoa’s pop-rock scene during the early 2000s. A natural storyteller, Horgan writes and performs with honesty and melodic clarity, weaving everyday experiences, relationships, and emotional truths into songs that feel both intimate and universal. His music blends thoughtful lyricism with catchy guitar-driven hooks, drawing comparisons to the laid-back yet deeply reflective style of artists like Crowded House and Dave Dobbyn. With Heavy Jones Trio, Horgan released an acclaimed self-titled EP (2000) and the full-length album Nobody Town (2005). Tracks such as Staring at the Ocean received significant commercial radio airplay and support from NZ On Air, introducing Horgan’s songwriting to a national audience. Over the years, Horgan has become known for his heartfelt live performances, both solo and with Heavy Jones Trio, where his ability to connect with listeners through honest storytelling and warm, expressive vocals stands out. His work continues to resonate with those who value melodic pop-rock grounded in New Zealand identity and spirit. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13369 managed by ccc.", "dates": {"start": "2026-02-08T13:00:00", "end": "2026-02-08T16:00:00", "text": "8 Feb 2026 | 1:00 pm - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Council events", "Music"], "image": null, "updated_at": "2025-12-03T01:19:51Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/workshop-artists-toolbox-13474", "title": "Workshop - Artists’ Toolbox", "description": "Central City | Tour Do you know a young person who loves to make art? Artists’ Toolbox is a six-week after-school course, each term on Wednesday afternoons. Bookings essential Paid event held in the Education centre $100 for 6 weeks Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13474 managed by ccc.", "dates": {"start": "2026-02-11T15:30:00", "end": "2026-02-11T17:00:00", "text": "11 Feb 2026 | 3:30 pm - 5:00 pm"}, "price": "$6 - $100", "location": "See website for details", "categories": ["Central City", "Tour"], "image": null, "updated_at": "2025-12-03T01:19:52Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/artist-and-librarian-talk-activating-archives-13470", "title": "Artist and Librarian talk - Activating Archives", "description": "Central City | Talk Join artist Shannon Williamson and Gallery librarian Tim Jones as they discuss the engagement of artists with library and archive collections Free event Archive talk linked with artist practices and the need to archive works. Image Shannon Williamson. Continuous positive i, 2016. Gouche and pencil on paper. purchased in 2016 with funds generously donated by Sarah Lucas, Sadie Coles HQ, London and two rooms, Auckland., in response to February 2011 Canterbury earthquake. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13470 managed by ccc.", "dates": {"start": "2026-02-11T18:00:00", "end": "2026-02-11T19:30:00", "text": "11 Feb 2026 | 6:00 pm - 7:30 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:52Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/workshop-drawing-with-hannah-beehre-13478", "title": "Workshop - Drawing with Hannah Beehre", "description": "Central City | Exhibition Join award-winning artist Hannah Beehre for a six-week course that will transform your drawing. Bookings essential. See our website for details. No experience Paid event The course covers contour drawing, perspective, composition, proportion and shade and mark making. Final week is a full 2-hour life drawing class with a model. $264 for 6 weeks Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13478 managed by ccc.", "dates": {"start": "2026-02-11T18:00:00", "end": "2026-02-11T20:00:00", "text": "11 Feb 2026 | 6:00 pm - 8:00 pm"}, "price": "$6 - $264", "location": "See website for details", "categories": ["Central City", "Exhibition"], "image": null, "updated_at": "2025-12-03T01:19:52Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/ngahuia-harrison-creative-research-in-focus-13477", "title": "Ngahuia Harrison: Creative Research in Focus", "description": "Central City | Talk Discover the evolving relationship between Ngātiwai and tohorahā (whales) and the complexity of kaitiakitanga as it is lived, practiced and adapted in place. Free event image Ngahuia Harrison by Sam Hartnett Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13477 managed by ccc.", "dates": {"start": "2026-02-14T13:00:00", "end": "2026-02-14T14:00:00", "text": "14 Feb 2026 | 1:00 pm - 2:00 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:52Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/mitre10-sparks-13316", "title": "Mitre10 Sparks", "description": "Central City | Council events One of Christchurch's most loved events, Mitre10 Sparks, is back. Featuring the Christchurch Symphony Orchestra and dazzling fireworks, you don't want to miss it! Free event Get your friends and whānau together to celebrate the 43rd year at our city's dazzling fireworks extravaganza, featuring the Christchurch Symphony Orchestra. Gather up your friends and whānau to enjoy a stunning, special Valentine’s Day themed evening of colourful, creative and crowd-pleasing entertainment for all those who love open-air music! No picnic? Onsite food vendors will offer a range of yummy kai. Here's everything else you need to know: Thanks to our amazing sponsor McAlpines Mitre10 MEGA Rangiora, Mitre10 MEGA Hornby, Mitre10 MEGA Papanui and Mitre10 MEGA Ferrymead. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13316 managed by ccc.", "dates": {"start": "2026-02-14T18:25:00", "end": "2026-02-14T21:40:00", "text": "14 Feb 2026 | 6:25 pm - 9:40 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Council events"], "image": null, "updated_at": "2025-12-03T01:19:53Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/best-of-the-bee-gees-greatest-13090", "title": "Best of the Bee Gees \"Greatest\"", "description": "Live | Music The Best of the Bee Gees Show honours the 1979 “Greatest” album with iconic disco, ballads and songs written by the Bee Gees for other legends in February. Paid event Best of the Bee Gees \"Greatest\" with special guests Nick Endacott-Gibb (Maurice Gibb’s son) and Debora McLane (Bee Gees’ niece) “This is the concert for you.” — Lesley Evans (Gibb) “If the Best of the Bee Gees Show comes to your town, don’t miss it!” — Original Bee Gees guitarist Vince Melouney The Best of the Bee Gees Show honours the 1979 “Greatest” album with iconic disco, ballads and songs written by the Bee Gees for other legends in February. Endorsed by the Gibb family and original Bee Gees musicians, the Australian core trio of Evan Webster (Barry Gibb), Russell Davey (Robin Gibb) and Greg Wain (Maurice Gibb), will be joined by special guests - Nick Endacott-Gibb (Maurice’s son) and Debora McLane (Bee Gees’ niece). It would be a Tragedy to miss the chart busters and memories so BOOK NOW! “So grateful to see it. They really are spectacular. How they sustain the performance is the great wonder. It’s huge in its ambition and they keep rising to it.” — Rick Feneley Journalist $72 - $82 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13090 managed by ccc.", "dates": {"start": "2026-02-14T19:30:00", "end": "2026-02-14T00:00:00", "text": "14 Feb 2026 | 7:30 pm - 12:00 am"}, "price": "$72 - $82", "location": "See website for details", "categories": ["Live", "Music"], "image": null, "updated_at": "2025-12-03T01:19:53Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/giving-garden-festival-12822", "title": "Giving Garden Festival", "description": "Festival | Food Every Bloom, Every Step, Every Contribution Makes a Difference. 250 Selwyn Road , Broadfield Garden Donation/koha A fundraising event set within the beautiful Broadfield Garden. With so many options of food and drink, with varieties of wine and cheese. You'll find horticulture stalls and vendor demos and be able to enjoy garden tours. With bouncy castles and face painting for the little ones! Rolleston brass band will be providing entertainment, and you'll be able to see some classic cars. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12822 managed by ccc.", "dates": {"start": "2026-02-15T10:00:00", "end": "2026-02-15T15:00:00", "text": "15 Feb 2026 | 10:00 am - 3:00 pm"}, "price": null, "location": "See website for details", "categories": ["Festival", "Food"], "image": null, "updated_at": "2025-12-03T01:19:53Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/workshop-artist-studio-with-cris-pliego-13475", "title": "Workshop - Artist Studio with Cris Pliego", "description": "Central City | Exhibition Unwind on a Monday evening and find your next art-making obsession with weekly art workshops. Bookings essential. See our website for details. Paid event Cris will be concentrating on journalling this term with different medium used. $150 for 6 weeks Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13475 managed by ccc.", "dates": {"start": "2026-02-16T18:30:00", "end": "2026-02-16T20:00:00", "text": "16 Feb 2026 | 6:30 pm - 8:00 pm"}, "price": "$6 - $150", "location": "See website for details", "categories": ["Central City", "Exhibition"], "image": null, "updated_at": "2025-12-03T01:19:53Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/introduction-to-art-history-13480", "title": "Introduction to Art History", "description": "Central City | Talk Join curator Melanie Oliver and explore Māori art, architecture and philosophy with curator and academic Jonathan Mane-Wheok Free event credit: Buck Nin Green Valley 1965. Acrylic on board. collection of Christchurch Art Gallery Te Puna o Waiwhetū, transferred from Christchurch City libraries Ngā Kete Wānanga-o-Ōtautahi collection, 2025. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13480 managed by ccc.", "dates": {"start": "2026-02-18T18:00:00", "end": "2026-02-18T19:15:00", "text": "18 Feb 2026 | 6:00 pm - 7:15 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Talk"], "image": null, "updated_at": "2025-12-03T01:19:54Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/community-expo-for-not-for-profit-organisations-13320", "title": "Community Expo for Not for Profit Organisations", "description": "Environment Discover local not for profit clubs & groups at the Community Expo! Connect, join, and get involved! 102 Avonhead Road , Avonhead Baptist Church Free event This is a non-fundraising event designed purely to connect local residents with the many not-for-profit organisations operating in the Russley–Avonhead areas. The EXPO provides an excellent opportunity for groups to showcase their activities, recruit new members or volunteers, and share information with the public. Food and refreshments, including a sausage sizzle and drinks, will be available. Register here: Registrations closes: 15 December 2025 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13320 managed by ccc.", "dates": {"start": "2026-02-21T10:00:00", "end": "2026-02-21T15:00:00", "text": "21 Feb 2026 | 10:00 am - 3:00 pm"}, "price": null, "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:19:54Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/crankworx-christchurch-13507", "title": "Crankworx Christchurch", "description": "Festival | Live Crankworx Christchurch brings the best of the Crankworx World Tour to the Port Hills, with four action-packed days of speed, big tricks and family friendly fun. Paid event February 19-22 2026: Crankworx Christchurch returns to the slopes of the Port Hills, at Christchurch Adventure Park. This is the official page to purchase tickets for the festival. You'll be able to catch the following events at this location: You'll also be able to grab a bite to eat while checking out the latest industry goods in the Expo Zone! IMPORTANT: If you hold a valid Christchurch Adventure Park Annual Pass, you are eligible for free entry to the festival for the entire duration, per passholder. To redeem this offer, you must visit the Christchurch Adventure Park Ticketing Office and register for a ticket in the week of the event (you cannot redeem online). Proof of pass and a ID may be required. This year, we're thrilled to introduce the Anytime Pass for ultimate flexibility and convenience! Enjoy access to as little or as many days of the festival with just one pass! $0.00 - $86.25 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13507 managed by ccc.", "dates": {"start": null, "end": null, "text": "19 Feb 2026 - 22 Feb 2026"}, "price": "$0 - $86.25", "location": "See website for details", "categories": ["Festival", "Live"], "image": null, "updated_at": "2025-12-03T01:19:54Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/lexus-urban-polo-2026-12489", "title": "Lexus Urban Polo 2026", "description": "Central City | Music Lexus Urban Polo is an unforgettable fusion of sport, music, fashion and food. Hagley Park , Bob Deans Field Paid event Urban Polo is more than just polo! Watch action-packed polo matches, stomp the divots, try polo for yourself on top of our hitting boxes, meet the polo players, and check out the epic DJs on the main stage. Grab a bite to eat, a refreshing drink or try out one of the activations. F3polo® is Urban Polo’s contemporary spin on the traditional game of polo. F3polo or “fast3polo” is faster paced, with a smaller field for better viewability and is played in the heart of the city. There are three players per team, the rules are simplified, and the chukkas (or quarters) are shorter. These key differences help to create a more exciting experience like no other for spectators. The event of the summer – it’s truly an experience like no other! All events are R18. $69 - $45k+ Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12489 managed by ccc.", "dates": {"start": "2026-02-21T12:00:00", "end": "2026-02-21T19:30:00", "text": "21 Feb 2026 | 12:00 pm - 7:30 pm"}, "price": "$45 - $69", "location": "See website for details", "categories": ["Central City", "Music"], "image": null, "updated_at": "2025-12-03T01:19:58Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/southern-cross-round-the-bays-13451", "title": "Southern Cross Round the Bays", "description": "Central City | Environment Legendary in Auckland and Wellington and now in Christchurch. Grab your friends, whānau or workmates for 8.4km course packed with entertainment and vitamin sea. 23 Humphreys Drive , Christchurch Estuary Paid event Enjoy a morning of ridiculous fun! Pound the pavement - and the beach - as you take on the 8.4km course. Run, walk or stroll around the bays from the estuary to the pier - at your pace. You bring your friends, whanau or workmates and we bring the entertainment, a finisher’s medal and picturesque views. Round the Bays is for all ages and fitness stages. The course is where it's at .... Whether you're a Walker, Jogger, CELSIUS® Runner or a Competitive or Non-Competitive participant. To inject the fun into fun run, we will be starting on the edge of the Christchurch Estuary on on the corner of Humphreys Drive and Kite Lane. Head along Linwood Ave and turn right into Dyers Road where entertainment will keep you moving and grooving. It's then a right onto Bridge Street up to The Parade. This is where the fun really kicks up a notch - as you get to choose your route! Will you go 'fast' or 'scenic'? For those Harry Hard-outs where time is of the essence, boost down Marine Parade past the pier. Or for those that want to change it up and have some sand between their toes, go for a bit more of a burn run along the beach - then join your friends for the final push along the Parade to Thomson Park. At the finish line, collect your well-deserved finisher's medal, a cool drink and enjoy the after-party. $25 - $75 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13451 managed by ccc.", "dates": {"start": "2026-02-22T09:15:00", "end": "2026-02-22T13:00:00", "text": "22 Feb 2026 | 9:15 am - 1:00 pm"}, "price": "$25 - $75", "location": "See website for details", "categories": ["Central City", "Environment"], "image": null, "updated_at": "2025-12-03T01:19:59Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/leadership-and-management-part-1-884364", "title": "Leadership and Management Part 1", "description": "Business & Professional 88-96 Papanui Road, Christchurch Scenic Hotel Cotswold, Christchurch Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #884364 managed by eventfinda.", "dates": {"start": "2026-02-24T08:30:00", "end": "2026-02-24T17:00:00", "text": "24 Feb 2026 | 8:30 am - 5:00 pm"}, "price": null, "location": "88-96 Papanui Road, Christchurch | Scenic Hotel Cotswold, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:00Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/summer-sundays-13370", "title": "Summer Sundays", "description": "Council events | Music Last but not least, chill out and enjoy Karra Rhodes, Lauren Marshall and Under the Wind at the last Summer Sundays session! Free event Last but not least, chill out and enjoy Karra Rhodes, Lauren Marshall and Under the Wind at the last Summer Sunday's session! Summer Sundays, Christchurch's outdoor summer music series, returns this summer with three free concerts to entertain the crowds. Last up are the talented, Karra Rhodes, Lauren Marshall and Under the Wind. Picnic food, drinks and chairs are welcome – no glass, please. Karra Rhodes is a Scottish-born, Kiwi-based country-pop singer-songwriter whose music shines a light on real stories and serious subjects, while still being songs you can shout and sing at the top of your voice. Inspired by artists like Shania Twain, Carrie Underwood, and Delta Goodrem, her sound blends modern country grit with pop. Over the past year, she has opened for NZ pop artist PRINS, performed at large music events across Canterbury and the South Island, and has been recognised as a finalist in both the MLT Songwriting Awards and the International Songwriting Competition (as a semi-finalist). Her debut album Hometown Therapy, released on 7 November 2025, captures her honest storytelling and the energy that makes her live shows worth every minute. Lauren Marshall is an accomplished vocalist, musician, and performing artist originally from Hawke's Bay, and now based in Otautahi, Christchurch. With a background in jazz, soul, and theatre, she regularly plays solo and with multiple bands around the city. Lauren has spent many years working professionally in touring shows and musical theatre, as well as performing on board cruise ships in New Zealand and overseas. Lauren also writes and performs her own music under the artist name 'LOVETA', recently opening for the legendary Dionne Warwick, and playing at Electric Avenue Festival earlier this year. Last year Lauren joined the iconic kiwi rock band 'Tadpole' as their new lead singer and is currently writing and performing music with them around the country. Under the Wind duo was formed in 2023 by Ara Music Arts graduates Keren Mara and Harry Finlayson-Hood. Brought together by a shared love of music, the duo set out to create easy-listening originals and covers with their own unique twist — think lazy Sunday meets road trip vibes. Keren Mara’s role is the acoustic guitar and lead vocals, bringing a folky/indie style to the mix. She’s complemented by Harry Finlayson-Hood on electric guitar and backing vocals, whose skilled playing weaves around the melodies to create a rich, full sound. Under the Wind will perform original songs and material recorded and produced with the creative input and technical support of Harry Finlayson-Hood. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13370 managed by ccc.", "dates": {"start": "2026-02-22T13:00:00", "end": "2026-02-22T16:00:00", "text": "22 Feb 2026 | 1:00 pm - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Council events", "Music"], "image": null, "updated_at": "2025-12-03T01:20:00Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/introduction-to-art-history-talk-13476", "title": "Introduction to Art History - talk", "description": "Central City | Talk Curator Melanie Oliver focuses on art histories from across the Pacific region though research of art historian and collector Karen Stevenson. Free event Tungane Broadbent and Vereara Maeva-Taripo Kaute (Hibiscus). Cotton thread, cotton sheeting. Collection of Christchurch Art gallery te Puna o Waiwhetū, purchased 2022. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13476 managed by ccc.", "dates": {"start": "2026-02-25T18:00:00", "end": "2026-02-25T19:15:00", "text": "25 Feb 2026 | 6:00 pm - 7:15 pm"}, "price": null, "location": "See website for details", "categories": ["Central City", "Talk"], "image": null, "updated_at": "2025-12-03T01:20:00Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/psychic-medium-kerry-marie-bridging-the-2-worlds-christchurch-907838", "title": "Psychic Medium Kerry-Marie 'Bridging The 2 Worlds' - Christchurch", "description": "Mind & Body 110 Marshland Rd, Christchurch Garden Hotel & Restaurant, Christchurch $65.00 $60.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #907838 managed by eventfinda.", "dates": {"start": "2026-03-09T19:00:00", "end": "2026-03-09T21:00:00", "text": "9 Mar 2026 | 7:00 pm - 9:00 pm"}, "price": null, "location": "110 Marshland Rd, Christchurch | Garden Hotel & Restaurant, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:00Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/leadership-management-part-2-907552", "title": "Leadership & Management Part 2", "description": "Business & Professional 88-96 Papanui Road, Christchurch Scenic Hotel Cotswold, Christchurch $995.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #907552 managed by eventfinda.", "dates": {"start": "2026-03-10T08:30:00", "end": "2026-03-10T17:00:00", "text": "10 Mar 2026 | 8:30 am - 5:00 pm"}, "price": null, "location": "88-96 Papanui Road, Christchurch | Scenic Hotel Cotswold, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:00Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/twominds-festival-2026-13488", "title": "Twominds Festival 2026", "description": "Festival | Music Each summer, we gather amongst the trees and present a lineup featuring international icons and the forerunners of Aotearoa’s creative scenes. 100 Heyders Road , Spencer Beach Top 10 Holiday Park Paid event In 2026, memories will be made! Welcome to Twominds Festival, we cannot wait to welcome you back to Spencer Beach Holiday Park in March 2026. A boutique festival experience set amongst the trees at our uniquely beautiful site just 20 minutes away from the Christchurch City CBD. Over 80 artists from all around Aotearoa and beyond are converging to deliver a weekend of music, discovery, and endless dancing. Escape the stress and breathe in the fresh air while connecting with the community around you. Experience the festival's renowned sensory experience across the weekend and enjoy rest breaks at the most comfortable on-site camping around, with full shower, toilet, and cooking facilities on offer. Campervan passes are also available, as well as a range of accommodation upgrades. Day splits, and activities to be announced. Make sure you're following us on socials to stay in the know and learn more about our festival programme. $119 - $324 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13488 managed by ccc.", "dates": {"start": null, "end": null, "text": "13 Mar 2026 - 15 Mar 2026 | 1:00 pm - 2:00 pm"}, "price": "$119 - $324", "location": "See website for details", "categories": ["Festival", "Music"], "image": null, "updated_at": "2025-12-03T01:20:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/the-brad-richards-building-sea2sky-challenge-11914", "title": "The Brad Richards Building Sea2Sky Challenge", "description": "The Sea2Sky Challenge is a triathlon, duathlon & trail run event for all ages and abilities. Enter solo or in teams for an unforgettable experience! Paid event The Sea2Sky Challenge is a triathlon, duathlon, and trail running event set on a spectacular course around Christchurch’s Port Hills and Godley Head, with options for all ages and abilities. Full Challenge – Begin with a swim at Scarborough Beach, ride up Evans Pass and along the Summit Road, then finish with a run over the stunning Godley Head and Taylors Mistake tracks. Juniors & Novices – Enjoy a friendly, accessible event on the flat streets of Sumner, perfect for those new to triathlon. Trail Run – Take on the 17km run, featuring the Captain Thomas Track, Summit Road, and the Godley Head and Taylors Mistake trails. Kids (5–9 years) – Have fun in a short wade/run designed to give young athletes their first taste of multisport. $25 - $99 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #11914 managed by ccc.", "dates": {"start": "2026-03-15T08:00:00", "end": "2026-03-15T12:00:00", "text": "15 Mar 2026 | 8:00 am - 12:00 pm"}, "price": "$25 - $99", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/customer-service-excellence-907903", "title": "Customer Service Excellence", "description": "Business & Professional 456 Papanui Road, Christchurch The Quality Hotel Elms, Christchurch $745.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #907903 managed by eventfinda.", "dates": {"start": "2026-03-19T08:30:00", "end": "2026-03-19T16:30:00", "text": "19 Mar 2026 | 8:30 am - 4:30 pm"}, "price": null, "location": "456 Papanui Road, Christchurch | The Quality Hotel Elms, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/golden-homes-le-race-13218", "title": "Golden Homes Le Race", "description": "Le Race is a 100km road bike race from Christchurch to Akaroa in beautiful Canterbury. The event offers a number of options to enter something for everyone! 28 Cathedral Square , Startline - Cathedral Square Paid event Le Race is a well-known Christchurch City and national cycling event. It has run annually since its beginnings in 1999 and, over that time, it has achieved significant iconic value. It is one of New Zealand’s most distinctive and exciting cycle events, attracting top competitors from around New Zealand as well as a core of keen road cyclists, mountain bikers and lots of recreational cyclists at varying levels of ability. The course is a challenging one and this adds immeasurably to the whole attraction of the event. Stunning scenery, a challenging course and people who share this journey from the tense filled atmosphere of the start in Cathedral Square to the scenes of elation at the finish in Akaroa makes Le Race unique. Its appeal has extended beyond. $185 - $220 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13218 managed by ccc.", "dates": {"start": "2026-03-21T08:00:00", "end": "2026-03-21T14:00:00", "text": "21 Mar 2026 | 8:00 am - 2:00 pm"}, "price": "$185 - $220", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/leadership-and-management-part-3-907554", "title": "Leadership and Management Part 3", "description": "Business & Professional 456 Papanui Road, Christchurch The Quality Hotel Elms, Christchurch $1695.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #907554 managed by eventfinda.", "dates": {"start": "2026-03-24T08:30:00", "end": "2026-03-24T17:00:00", "text": "24 Mar 2026 | 8:30 am - 5:00 pm"}, "price": null, "location": "456 Papanui Road, Christchurch | The Quality Hotel Elms, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:01Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/culture-fest-2026-13253", "title": "Culture Fest 2026", "description": "Food | Performance This event celebrates the amazing cultural diversity in our community. Including offerings of local food, cultural music, and more! 31 Vicki Street , Riccarton High School Donation/koha We are delighted to invite you to Culture Fest — Riccarton’s vibrant multicultural celebration of our community’s amazing diversity. Enjoy a fun-filled day with local food trucks, cultural performances, community group displays, and more! Bring your whānau and friends and experience the flavours, music, and energy of our wonderfully diverse community. Please bring cash for food trucks and a gold coin donation/koha. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13253 managed by ccc.", "dates": {"start": "2026-03-27T16:00:00", "end": "2026-03-27T19:30:00", "text": "27 Mar 2026 | 4:00 pm - 7:30 pm"}, "price": null, "location": "See website for details", "categories": ["Food", "Performance"], "image": null, "updated_at": "2025-12-03T01:20:06Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/joanne-mcnally-pinotphile-13405", "title": "Joanne McNally - Pinotphile", "description": "After the success of her record-breaking tour The Prosecco Express, Joanne McNally returns with her hotly anticipated new stand-up show Pinotphile. Paid event After the success of her record-breaking tour The Prosecco Express, Joanne McNally returns with her hotly anticipated new stand-up show Pinotphile. Hailed by Variety as One to Watch, McNally has been keeping herself busy by ruining men's lives (and her own) and now she's back; still single, still unfertilised, and laden with irreverent, ridiculous and hilarious war stories. Join Joanne for a wild ride as she navigates situationships, revenge, frenemies and rejection in her “terrifyingly funny” (Evening Standard) and “joyously nuts” (Irish Examiner) trademark style. She's the co-host of award-winning podcast My Therapist Ghosted Me, and with riotous appearances on Taskmaster, The Jonathan Ross Show and The Big Fat Quiz of Everything. Joanne also hosts the hugely successful BBC Sounds series Joanne McNally Investigates: Who Replaced Avril Lavigne and Do Furbys Spy on Us? $69.90 - $79.90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13405 managed by ccc.", "dates": {"start": "2026-04-15T20:00:00", "end": "2026-04-15T22:00:00", "text": "15 Apr 2026 | 8:00 pm - 10:00 pm"}, "price": "$69.90 - $79.90", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:06Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/relay-for-life-christchurch-13485", "title": "Relay For Life Christchurch", "description": "Festival | Live Relay For Life is a community fundraising event that brings friends, whanau, schools and workplace together to Celebrate, Remember and Fight Back against Cancer Paid event Relay For Life is a community fundraising event that brings friends, whanau, schools and workplaces together to: Everyone is welcome at Relay For Life What happens at a Relay For Life? At Relay. Teams take to the track, cheered on by supporters, and keep their batons moving to symbolise our community's unstoppable fight against cancer. To keep the energy alive, the event will have loads of special performances, awesome activities, good music and even better food. How you I get involved? Visit Christchurch.relayforlife.org.nz or the relayforlife.org.nz/events page. Sign up now during the early bird period, build your team and start fundraising. $10 - $20 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13485 managed by ccc.", "dates": {"start": "2026-03-28T10:00:00", "end": "2026-03-28T22:00:00", "text": "28 Mar 2026 | 10:00 am - 10:00 pm"}, "price": "$10 - $20", "location": "See website for details", "categories": ["Festival", "Live"], "image": null, "updated_at": "2025-12-03T01:20:06Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/dealing-with-difficult-people-situations-908141", "title": "Dealing With Difficult People & Situations", "description": "Business & Professional 88-96 Papanui Road, Christchurch Scenic Hotel Cotswold, Christchurch $745.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #908141 managed by eventfinda.", "dates": {"start": "2026-04-21T08:30:00", "end": "2026-04-21T17:00:00", "text": "21 Apr 2026 | 8:30 am - 5:00 pm"}, "price": null, "location": "88-96 Papanui Road, Christchurch | Scenic Hotel Cotswold, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:06Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/time-management-workshop-908342", "title": "Time Management Workshop", "description": "Business & Professional 76/106 Manchester Street, Christchurch EPIC Christchurch, Christchurch $745.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #908342 managed by eventfinda.", "dates": {"start": "2026-04-22T08:30:00", "end": "2026-04-22T16:30:00", "text": "22 Apr 2026 | 8:30 am - 4:30 pm"}, "price": null, "location": "76/106 Manchester Street, Christchurch | EPIC Christchurch, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:07Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/charlie-and-the-chocolate-factory-13312", "title": "Charlie and the Chocolate Factory", "description": "Live | Performance Showbiz Christchurch presents the New Zealand premiere of Roald Dahl’s Charlie and the Chocolate Factory – The Musical. Paid event Packed with pure imagination, this spectacular stage adaptation of Dahl’s classic story features songs from the much-loved 1971 film — Pure Imagination, The Candy Man and I’ve Got a Golden Ticket — alongside dazzling new music by the Grammy, Tony and Olivier Award-winning team behind Hairspray. Directed by Stephen Robertson, with musical direction by Richard Marrett and co-choreography by Glen Harris and Gemma Kearney, this production promises to be a feast for the senses — combining dazzling design, showstopping performances, and heartwarming storytelling. $73 - $148 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13312 managed by ccc.", "dates": {"start": "2026-04-23T19:30:00", "end": "2026-04-23T22:00:00", "text": "23 Apr 2026 | 7:30 pm - 10:00 pm"}, "price": "$73 - $148", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:20:07Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/murder-mystery-on-the-tormore-express-13390", "title": "Murder mystery on the Tormore Express", "description": "Live | Performance Step into the ultimate murder mystery dinner, theatre, and train experience, brought to you by Great Journeys New Zealand and The Court Theatre. 35 Troup Drive , Great Journeys NZ train Paid event Step into the ultimate murder mystery dinner, theatre, and train experience, brought to you by Great Journeys New Zealand and The Court Theatre. As the chill of night settles in, you’ll glide through the wintery Canterbury landscapes, enjoying a multi-course dinner. As the night falls outside, a thrilling murder mystery unfolds on board the train. Channel your inner detective and work quickly to solve the crime before the journey reaches its end... $379 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13390 managed by ccc.", "dates": {"start": "2026-04-26T17:15:00", "end": "2026-04-26T22:30:00", "text": "26 Apr 2026 | 5:15 pm - 10:30 pm"}, "price": "$379", "location": "See website for details", "categories": ["Live", "Performance"], "image": null, "updated_at": "2025-12-03T01:20:07Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/eddie-izzard-the-remix-tour-live-12814", "title": "Eddie Izzard | The Remix Tour Live", "description": "Live The Remix Tour Live is a chance for Eddie, inspired by her ever-loyal audiences, to remix and re-imagine some of her own favourite, personal comedy highlights. Paid event Eddie's 35 years of sell-out comedy shows stretch from The Ambassadors in 1993 to Wunderbar in 2019. Ever wondered what became of Darth Vader and Mr Stevens or the monkey in the tree, did the pears ever ripen… and will God ever appear? It’s a glorious chance to ‘maybe’ find out the answers or discover more questions to those Izzard conundrums. No night will likely be exactly the same so as ever with Eddie, expect the unexpected. This show promises to be a beautiful, hilarious journey spanning a 35-year career of thought-provoking, intelligent and surreal ideas. Who could resist? This show may contain strong and imaginative language. “In the first 35 years of my stand-up career, I came up with many weird and crazy comedy stories. The ones I like the best will be in my 2025 live Remix Tour. “ – Eddie Izzard $92.90 - $112.90 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12814 managed by ccc.", "dates": {"start": "2026-05-25T20:00:00", "end": "2026-05-25T00:00:00", "text": "25 May 2026 | 8:00 pm - 12:00 am"}, "price": "$92.90 - $112.90", "location": "See website for details", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:08Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/professor-brian-cox-emergence-913545", "title": "Professor Brian Cox - Emergence", "description": "Public Talks & Tours 55 Jack Hinton Drive, Christchurch Wolfbrook Arena, Christchurch $210.00 $175.00 $145.00 $95.00 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #913545 managed by eventfinda.", "dates": {"start": "2026-06-02T19:30:00", "end": "2026-06-02T22:00:00", "text": "2 Jun 2026 | 7:30 pm - 10:00 pm"}, "price": null, "location": "55 Jack Hinton Drive, Christchurch | Wolfbrook Arena, Christchurch", "categories": null, "image": null, "updated_at": "2025-12-03T01:20:08Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/momentum-2026-13344", "title": "Momentum 2026", "description": "Central City | Talk Back by demand - and bigger than ever. Momentum isn’t your typical business event. It’s fast-paced, inspiring, and built for people ready to grow! 188 Oxford Terrace , Te Pae Christchurch Convention Centre Paid event What is Momentum? Momentum isn’t your typical conference, and it’s not just another workshop either. It’s a focused, inspiring, and fast-paced afternoon for ANYONE who is ready to grow - in their leadership, business, or personal drive. You’ll hear from five of New Zealand's boldest entrepreneurs - people who’ve faced turning points, taken bold steps, and built something meaningful. Each one will share the mindset shifts, decisions, and lessons that helped them move forward when it mattered most. Whether you’re building something new, scaling something bigger, or still figuring it out - you’ll leave with insight, inspiration, and quality connections. $199 - $349 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13344 managed by ccc.", "dates": {"start": "2026-07-30T12:30:00", "end": "2026-07-30T16:30:00", "text": "30 Jul 2026 | 12:30 pm - 4:30 pm"}, "price": "$199 - $349", "location": "See website for details", "categories": ["Central City", "Talk"], "image": null, "updated_at": "2025-12-03T01:20:08Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/christchurch-go-green-expo-12890", "title": "Christchurch Go Green Expo", "description": "Exhibition | Sustainability New Zealand’s largest sustainable lifestyle show. This is your one-stop shop for everything you need to live a sustainable life. Free event Eco home/building, food and beverages, advisory services, supplements, organic products, health and wellness, beauty and personal care, household products, pet products, gardening, grocery and many more categories are showcased at this fantastic event that is not to be missed. A large, diverse range of companies and brands cannot wait to transform your way of life, in favour of the environment and you. This show is dedicated to promoting a healthy, environmentally friendly, sustainable lifestyle for New Zealanders. Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #12890 managed by ccc.", "dates": {"start": null, "end": null, "text": "8 Aug 2026 - 9 Aug 2026 | 10:00 am - 4:00 pm"}, "price": null, "location": "See website for details", "categories": ["Exhibition", "Sustainability"], "image": null, "updated_at": "2025-12-03T01:20:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/creedence-clearwater-collective-13181", "title": "Creedence Clearwater Collective", "description": "Live | Music Join us, a real-life travelling band. Creedence Clearwater Collective brings to the stage a band that captures the unique CCR sound. Paid event We invite you to join as we present the music of one of the world’s most iconic bands – from the songs they wrote, to the songs covered, to the songs they wrote for others. All the hits that defined a generation and have become the soundtrack for many more – all in one night, live, on stage. Creedence Clearwater Collective brings to the stage a band that captures the unique CCR sound. You do not want to hear through the grapevine that you missed out on this howling good time. Presented by: Carter Entertainment $49 - $69 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13181 managed by ccc.", "dates": {"start": "2026-08-29T19:30:00", "end": "2026-08-29T21:45:00", "text": "29 Aug 2026 | 7:30 pm - 9:45 pm"}, "price": "$49 - $69", "location": "See website for details", "categories": ["Live", "Music"], "image": null, "updated_at": "2025-12-03T01:20:09Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/listing/fleetwood-macs-13227", "title": "Fleetwood Macs", "description": "Live | Music The No.1 International Tribute to Fleetwood Mac. FLEETWOOD MACS recreate the timeless music in one extravaganza you do not want to miss! Paid event Dreams really do come true, as we celebrate the incredible discography of Fleetwood Mac. From their formation in 1967, constant lineup changes, crippling addictions, and tumultuous romances – threatening to derail the group’s success. Fleetwood Mac spun inner discord into gold, creating enduring music that would resonate with multiple generations of rock fans, continuing to capture the zeitgeist. We bring all the hits - from their early British days to their US move, and various line-up changes – in this live 2-hour concert FLEETWOOD MACS recreate the timeless music in one extravaganza you do not want to miss! You could Go Your Own Way, or you could join us for a night of Rumours and Dreams. Presented by: Carter Entertainment. $49 - $69 Don't miss a thing Sign up to our newsletter to get valuable updates and news straight to your inbox. Listing #13227 managed by ccc.", "dates": {"start": "2026-09-04T19:30:00", "end": "2026-09-04T00:00:00", "text": "4 Sept 2026 | 7:30 pm - 12:00 am"}, "price": "$49 - $69", "location": "See website for details", "categories": ["Live", "Music"], "image": null, "updated_at": "2025-12-03T01:20:13Z"}
