{"id": "071435c09348d913", "record_type": "event", "name": "NZ Squash Open", "description": "Get ready for world-class action as the NZ Squash Open returns in 2026! This premier international tournament will showcase the world’s top professional players alongside New Zealand’s rising stars, all competing for glory on court.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/nz-squash-open", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F1980x1322%2F4fc33c7850%2Fnz-squash-open.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": "Isaac Theatre Royal", "address": "Isaac Theatre Royal, Christchurch View map", "city": "Christchurch", "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": null, "max": null, "text": null, "free": false}, "booking": {"url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=SQUASH26", "email": null, "phone": null}, "event_dates": {"start": "2026-03-03T00:00:00+13:00", "end": "2026-03-08T23:59:59+13:00", "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:36.123074+00:00", "text_for_embedding": "NZ Squash Open | Get ready for world-class action as the NZ Squash Open returns in 2026! This premier international tournament will showcase the world’s top professional players alongside New Zealand’s rising stars, all competing for glory on court. | Isaac Theatre Royal, Christchurch View map | Christchurch | Canterbury | 3 - 8 March 2026 Address Isaac Theatre Royal, Christchurch View map Ticket info Buy tickets now Event details Expect fast-paced rallies, breath-taking skill, and an electric atmosphere as Christchurch hosts the biggest squash event in the country. With men’s and women’s draws stacked with talent, every match promises drama, intensity, and unforgettable moments. Whether you’re a passionate squash fan or new to the sport, the NZ Squash Open is an event you won’t want to miss. Secure your seats today and be part of the excitement as history is made on the glass court! Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "ef487c32f37d3d3e", "record_type": "event", "name": "World Buskers Festival", "description": "Get amongst the fun this summer as the World Buskers Festival returns to Ōtautahi Christchurch for ten days of street performance, ticketed shows, and pop-up surprises across the city.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/world-buskers-festival", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F1980x1320%2Fe4187db72a%2Fbuskers-performing-in-cashel-mall.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": null, "address": "Multiple venues across the city", "city": null, "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": null, "max": null, "text": null, "free": false}, "booking": {"url": null, "email": null, "phone": null}, "event_dates": {"start": null, "end": null, "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:36.408621+00:00", "text_for_embedding": "World Buskers Festival | Get amongst the fun this summer as the World Buskers Festival returns to Ōtautahi Christchurch for ten days of street performance, ticketed shows, and pop-up surprises across the city. | Multiple venues across the city | Christchurch | Canterbury | 23 January - 1 February 2025 Address Multiple venues across the city Ticket info Visit website Event details This summer the streets of Ōtautahi Christchurch come alive with laughter, spectacle, and the kind of unexpected moments that make the World Buskers Festival one of our most loved festivals. From Friday, 23 January to Sunday, 1 February 2026, across the five city pitches and two pop-up locations, the festival blends the best of international street talent with the creativity and spirit of homegrown performers. Expect jaw-dropping acrobatics, cheeky comedy, world-class circus acts, and unforgettable moments in every corner of the central city. Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "d6d7c933ef3a5e71", "record_type": "event", "name": "New Years Eve", "description": "Ring in the new year at North Hagley Park with family friendly fun. With a ‘kids countdown’ from 4-7pm, followed by a New Years Eve party from 8pm - midnight featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/new-years-eve", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F1980x1320%2F3c095dd727%2Fwhats-on-new-years-eve.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": null, "address": "North Hagley Park View map", "city": null, "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": null, "max": null, "text": null, "free": false}, "booking": {"url": null, "email": null, "phone": null}, "event_dates": {"start": null, "end": null, "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:36.577537+00:00", "text_for_embedding": "New Years Eve | Ring in the new year at North Hagley Park with family friendly fun. With a ‘kids countdown’ from 4-7pm, followed by a New Years Eve party from 8pm - midnight featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora. | North Hagley Park View map | Christchurch | Canterbury | 31 December 2025 Address North Hagley Park View map Ticket info Find out more Event details Say hello to 2026 with New Years Eve celebrations in North Hagley Park. NYE Kids Countdown, 4-7pm - powered with Hydrate by IHF, is kicking off the New Year’s Eve celebrations early with a special kids’ event that your whānau won’t want to miss. Join the fun without having to stay out late! NYE25 8pm to midnight - featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora, all MCed by Henare Kaa. Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "b792866caf39454a", "record_type": "event", "name": "West Indies v BLACKCAPS", "description": "Caribbean flair meets Kiwi fire. The BLACKCAPS face the West Indies in the first Test Match of the series.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/west-indies-v-blackcaps", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F1980x1320%2F279a3368a1%2Fblack-caps.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": "Hagley Oval", "address": "Hagley Oval, Christchurch View map", "city": "Christchurch", "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": null, "max": null, "text": null, "free": false}, "booking": {"url": "https://tickets.nzc.nz/shows/Show.aspx?sh=CTDAYSA26", "email": null, "phone": null}, "event_dates": {"start": "2025-12-02T00:00:00+13:00", "end": "2025-12-06T23:59:59+13:00", "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:36.937043+00:00", "text_for_embedding": "West Indies v BLACKCAPS | Caribbean flair meets Kiwi fire. The BLACKCAPS face the West Indies in the first Test Match of the series. | Hagley Oval, Christchurch View map | Christchurch | Canterbury | 2 - 6 December 2025 Address Hagley Oval, Christchurch View map Ticket info Buy tickets now Event details Big hits. Big names. Big series. Feel the electric atmosphere, soak up the summer vibes, and enjoy world-class cricket right here at home. Hagley Oval’s stunning setting offers the perfect backdrop for world-class cricket and an unforgettable summer. Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "85529afde8904006", "record_type": "event", "name": "Super Rugby Pacific - Super Round", "description": "Super Round heads to New Zealand for the first time, opening One New Zealand Stadium Christchurch.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/super-rugby-pacific-super-round", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F2400x1349%2Fc6a15107bf%2Fone-new-zealand-stadium.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": "One New Zealand Stadium", "address": "One New Zealand Stadium, 218 Madras Street, Christchurch View map", "city": "Christchurch", "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": null, "max": null, "text": null, "free": false}, "booking": {"url": null, "email": null, "phone": null}, "event_dates": {"start": "2026-04-24T00:00:00+12:00", "end": "2026-04-26T23:59:59+12:00", "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:37.220244+00:00", "text_for_embedding": "Super Rugby Pacific - Super Round | Super Round heads to New Zealand for the first time, opening One New Zealand Stadium Christchurch. | One New Zealand Stadium, 218 Madras Street, Christchurch View map | Christchurch | Canterbury | 24 - 26 April 2026 Address One New Zealand Stadium, 218 Madras Street, Christchurch View map Ticket info Find out more Event details Super Round is a festival weekend of Super Rugby Pacific where every team plays at the same venue. Across three days over ANZAC weekend, fans enjoy multiple matches in Ōtautahi Christchurch - it’s rugby’s biggest celebration. Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "73bc813cae826c1a", "record_type": "event", "name": "Supercars Christchurch Super 440", "description": "Ōtautahi Christchurch is geared up to welcome the Repco Supercars Championship to Ruapuna Motorsport Park.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/supercars-christchurch", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F1620x1080%2F8312730b02%2Fsupercars-race-10-ev03.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": "Ruapuna Motorsport Park", "address": "Ruapuna Motorsport Park, Christchurch View map", "city": "Christchurch", "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": 0.0, "max": null, "text": "Multiple transport options will be available to make getting to Ruapuna Raceway easy and hassle-free over the event weekend. View directions Google Maps . Spectators parking here will need to show a valid ticket to the event (including all passengers in the vehicle) and a valid NZ mobility parking permit clearly displayed on the front windscreen of the vehicle. Entry to this carpark for valid mobility car parking permits is free.", "free": true}, "booking": {"url": "https://www.supercars.com/events/2026-christchurch/tickets-and-packages?priceFrom=40&priceTo=351", "email": null, "phone": null}, "event_dates": {"start": "2026-04-17T00:00:00+12:00", "end": "2026-04-19T23:59:59+12:00", "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:37.586515+00:00", "text_for_embedding": "Supercars Christchurch Super 440 | Ōtautahi Christchurch is geared up to welcome the Repco Supercars Championship to Ruapuna Motorsport Park. | Ruapuna Motorsport Park, Christchurch View map | Christchurch | Canterbury | 17 - 19 April 2026 Address Ruapuna Motorsport Park, Christchurch View map Ticket info Buy tickets Supercars event details As Australasia’s premier touring car series, Supercars promises high-octane action, fierce competition and an unforgettable experience — and we can’t wait to see it all unfold right here in Christchurch in 2026. For the first time, drivers will battle it out on the iconic South Island circuit — led by Kiwi star Matt Payne, winner of the Jason Richards Memorial Trophy and now Bathurst 1000 champion. Fans from across Aotearoa can rally trackside to cheer on their 'King of the Mountain. ' Event weekend transport options available Multiple transport options will be available to make getting to Ruapuna Raceway easy and hassle-free over the event weekend. View directions Google Maps . Super shuttle from the city A 'Super shuttle service' will be running from the central city. This is a paid morning and nightly service, and return shuttle tickets can be purchased starting from $30. Free park n ride service There will be a free Supercars park n ride service running from the Canterbury Agricultural Park. With no booking necessary, attendees can drive to the Canterbury Agricultural Park, park their vehicle and take the free shuttle to the raceway. View directions on Google Maps . Free parking on-site There is free parking onsite, however this is limited and will be allocated on a first in first served basis. Overflows will need to head to the Canterbury Agricultural Park and take the free shuttle service to the event, or ticket holders can purchase a shuttle service to and from the city. Limited premium carparking There is also an option to purchase a premium carpark. This $120 add-on will score you a 3-day carpark just outside an entry gate. There is limited availability, and tickets need to be purchased online prior to arriving at the event. Upgrades underway at Ruapuna Raceway As Christchurch prepares to host Supercars, Ruapuna Raceway is undergoing targeted upgrades to meet track safety standards for its inaugural year. Led by the Canterbury Car Club and supported by Christchurch City Council, ChristchurchNZ, and Supercars, the immediate focus is on ensuring the circuit complies with all safety requirements for drivers and spectators. Infrastructure enhancements will continue in subsequent years, building on this foundation to elevate the venue into a world-class motorsport destination. Accessibility information An accessible viewing area will be located between turn 10 and turn 11, near gate B. Please purchase a Trackside General Admission ticket and email commercial@ticketek.co.nz to advise your requirements. The venue is a mix of sealed roads, dirt roads and grass. Viewing areas around the track are all raised above the racetrack, and therefore, there is a requirement to navigate inclines and descents around the venue. Corporate tickets can be purchased for the Engine Room, which caters to those using a wheelchair. There are also a number of wheelchair-friendly toilets in the precinct. Accessible parking Accessible parking will be located in the premium carpark. There are limited carparks in this location, which will be on a first-come, first-served basis. Spectators parking here will need to show a valid ticket to the event (including all passengers in the vehicle) and a valid NZ mobility parking permit clearly displayed on the front windscreen of the vehicle. Entry to this carpark for valid mobility car parking permits is free. If the carpark is full, patrons can head to the public carpark or to the park n ride at the Canterbury Agricultural Park (A&P showgrounds, 102 Curletts Road, Sockburn, Christchurch). Accessible buses will be operating throughout the day. Check back here for updates as more action unfolds in the lead-up to Supercars Christchurch Super 440 . Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Multiple transport options will be available to make getting to Ruapuna Raceway easy and hassle-free over the event weekend. View directions Google Maps . Spectators parking here will need to show a valid ticket to the event (including all passengers in the vehicle) and a valid NZ mobility parking permit clearly displayed on the front windscreen of the vehicle. Entry to this carpark for valid mobility car parking permits is free. | Events"}
{"id": "d252bf13fefb7d8d", "record_type": "event", "name": "The Art of Banksy", "description": "Enjoy over 150 original artworks, prints, and installations by the elusive street artist. This is your final chance to experience Banksy’s most iconic pieces in New Zealand.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/the-art-of-banksy", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F1980x1414%2F569032351a%2Fbanksy.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": null, "address": "Te Pae Christchurch Convention Centre View map", "city": "Christchurch", "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": null, "max": null, "text": null, "free": false}, "booking": {"url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=BANKSY26", "email": null, "phone": null}, "event_dates": {"start": null, "end": null, "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:37.934789+00:00", "text_for_embedding": "The Art of Banksy | Enjoy over 150 original artworks, prints, and installations by the elusive street artist. This is your final chance to experience Banksy’s most iconic pieces in New Zealand. | Te Pae Christchurch Convention Centre View map | Christchurch | Canterbury | 17 December 2025 - 27 January 2026 (excluding public holidays) Address Te Pae Christchurch Convention Centre View map Ticket info Buy tickets now Event details The world-famous exhibition, The Art of Banksy, is coming to Christchurch this summer at Te Pae Christchurch Convention Centre. With over 150 original artworks, prints, and installations by the elusive street artist, this is your final chance to experience Banksy’s most iconic and thought-provoking pieces in Aotearoa NZ. From Girl with Balloon (Gold Edition) to Flower Thrower, this is an unmissable opportunity to get up close to authenticated Banksy artworks. Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "66e6833ac2536b3d", "record_type": "event", "name": "Lexus Urban Polo", "description": "The Lexus Urban Polo® returns to the beautiful Hagley Park, Christchurch on Saturday, 21 February 2026. Get amongst all the action on and off the field.", "categories": ["Events"], "tags": [], "url": "https://www.christchurchnz.com/visit/whats-on/lexus-urban-polo", "source": "christchurchnz.com", "images": ["https://www.christchurchnz.com/_image?href=https%3A%2F%2Fa-ap.storyblok.com%2Ff%2F3000820%2F2000x1333%2F656a7f5aa1%2Flexus-urban-polo.jpg%2Fm%2F1280x768%2Fsmart%2Ffilters%3Aquality%2890%29&w=1280&h=768&f=webp"], "location": {"name": "Hagley Park", "address": "Hagley Park, Christchurch View map", "city": "Christchurch", "region": "Canterbury", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": 0.0, "max": 2025.0, "text": "This is an R18 event, 12:00 – 7:30pm • Doors open 12:00pm Ticket info Find out more Be part of the action Get amongst all the action on and off the field. Watch thrilling, fast paced polo matches, stomp the divots, try polo for yourself on top of our hitting boxes, meet the polo players, check out our epic DJ line-up on the main stage, enjoy the delicious offerings from our food and beverage partners or try out one of the activations. Tickets on sale now for General Admission, VIP and Corporate Hosting in our Private Marquees. It’s truly an experience like no other! Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12", "free": false}, "booking": {"url": null, "email": null, "phone": null}, "event_dates": {"start": null, "end": null, "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:44:38.304491+00:00", "text_for_embedding": "Lexus Urban Polo | The Lexus Urban Polo® returns to the beautiful Hagley Park, Christchurch on Saturday, 21 February 2026. Get amongst all the action on and off the field. | Hagley Park, Christchurch View map | Christchurch | Canterbury | 21 February 2026 Address Hagley Park, Christchurch View map Ticket info Find out more Be part of the action Get amongst all the action on and off the field. Watch thrilling, fast paced polo matches, stomp the divots, try polo for yourself on top of our hitting boxes, meet the polo players, check out our epic DJ line-up on the main stage, enjoy the delicious offerings from our food and beverage partners or try out one of the activations. Tickets on sale now for General Admission, VIP and Corporate Hosting in our Private Marquees. It’s truly an experience like no other! Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | This is an R18 event, 12:00 – 7:30pm • Doors open 12:00pm Ticket info Find out more Be part of the action Get amongst all the action on and off the field. Watch thrilling, fast paced polo matches, stomp the divots, try polo for yourself on top of our hitting boxes, meet the polo players, check out our epic DJ line-up on the main stage, enjoy the delicious offerings from our food and beverage partners or try out one of the activations. Tickets on sale now for General Admission, VIP and Corporate Hosting in our Private Marquees. It’s truly an experience like no other! Get valuable updates and news straight to your inbox. Sign up to our newsletter About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub About Us About ChristchurchNZ What we do Our people Economic ambition News and media Ōtautahi Christchurch Toolkit Contact Travel trade hub Get valuable updates and news straight to your inbox. Sign up to our newsletter Terms of use Privacy Policy ©2025 ChristchurchNZ.com Website by Plato 1 2 3 4 5 6 7 8 9 10 11 12 | Events"}
{"id": "8a18cb48538632c5", "record_type": "event", "name": "Submit an event", "description": "Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red!", "categories": ["Events"], "tags": [], "url": "https://heartofthecity.co.nz/auckland-events/this-month", "source": "heartofthecity.co.nz", "images": ["https://heartofthecity.co.nz/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-104.jpg"], "location": {"name": "Find out more", "address": null, "city": "Auckland", "region": "Auckland", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": 0.0, "max": 8717391.0, "text": "form.antibot * :not(.antibot-message) { display: none !important; } try{Typekit.load({ async: true, active: function() { var event = new CustomEvent(\"typekitActive\", {}); document.dispatchEvent(event); } });}catch(e){} Events | Heart of the City Skip to main content Back to top anchor Heart of the City Open main menu Close main menu Main menu Events Dining Bars & Nightlife Shopping Parking & Transport Things to do More Main menu (Mobile) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping Open search Close search Favourites Follow us on Facebook Follow us on Twitter Follow us on Instagram Search the city Search Trending: The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Main menu (Mega) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next Events Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red! What's On This Week 18 NOV, 2025 | 7pm Doja Cat GRAMMY-winning global icon Doja Cat sets to make her highly anticipated New Zealand debut as part of the electrifying Ma Vie ... Add to favourites 18 - 20 NOV, 2025 Metallica M72 Pop-Up Shop Calling all Metallica fans— The M72 Pop-Up Shop at Brad's Warehouse unleashes exclusive merch and electrifying energy for die... Add to favourites 8 NOV, 2025-15 MAR, 2026 Pop to Present: American Art from the Virginia Museum of Fine Arts A major cultural event for Aotearoa, this special exhibition celebrates and amplifies the plural artistic voices of the... Add to favourites 22 NOV, 2025 | 7.30 - 8.15PM The Giant Christmas Tree Is Lighting Up! Join the festive fun as Auckland’s favourite Christmas tradition kicks off with the annual tree-lighting event, featuring... Add to favourites Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites Previous Next The beat drops here 22 & 23 NOV, 2025 | 6pm TOOL Grammy Award-winning juggernauts TOOL makes their long-awaited return to New Zealand at Spark Arena on 22 & 23 November 2025... Add to favourites 22 NOV 2025 Jessie Murph Breakout vocal powerhouse Jessie Murph is going global. Add to favourites 23 NOV, 2025 | 3.30pm & 7.30pm Avatar: The Last Airbender in Concert Celebrate 20 years of Avatar: The Last Airbender through its unforgettable characters, and the epic journey that defined a... Add to favourites 23 & 24 NOV 2025 Pixies Pixies have announced a 2025 New Zealand tour which will see the alt-rock legends perform two consecutive nights at Auckland... Add to favourites 25 NOV 2025 Clap Your Hands Say Yeah Iconic indie rock act Clap Your Hands Say Yeah will be playing at The Tuning Fork as part of their 2025 World Tour Add to favourites 26 NOV 2025 | 7PM Ben Ottewell & Ian Ball By Request Tour Ben Ottewell and Ian Ball, founding members of the legendary band Gomez, are bringing their very special By Request tour to... Add to favourites Previous Next See more music events Fun for the kids 15 NOV - 24 DEC, 2025 Santa's Magical Wonderland Step into a world of enchantment where twinkling lights, playful characters, and interactive activities - Santa’s Magical... Add to favourites 23 NOV 2025 | 1-4PM Pudding mit Gabel The viral German trend \"Pudding mit Gabel\" has come to Auckland. Add to favourites 2,8,9,16,23 & 30 NOV 2025 | 10AM-2PM Make Days: Ika pepa (paper fish) Drop into the Maritime Museum on selected dates and take home a free, whānau-friendly craft. Add to favourites 28 - 30 NOV, 2025 The Wizard of Oz The National Youth Theatre Company presents The Wizard of Oz , an enchanting musical drawn from the all-time classic MGM... Add to favourites Previous Next Come hungry, leave happy OCT - NOV, 2025 | Thursdays Late Night Bites Every Thursday this November, Late Night Bites brings curated eats, cocktails, and desserts from top spots across Britomart... Add to favourites 22 NOV 2025 | 11.30AM-1.30PM Bubbles and BLUSH Step into an enchanting afternoon where petals meet bubbles and creativity blooms. Add to favourites Bar Albert 1 NOV - 30 DEC 2025 Louis Roederer Champagne x Bar Albert Your choice of Caviar served three ways $25, Caviar & Champagne experience $55, Cocktail special: French 75 $26 or Caviar Mozzarella & Co. 10 NOV - 14 DEC 2025 Mozzarella & Co x Sawmill Brewery Beer and Cheese Board $45: Choose two Sawmill Brews with a matched tasting cheese board or Beer and Cheese Pairing Menu: $18 NOV - DEC, 2025 Festive Dining at SkyCity Make SkyCity Auckland your festive tradition this Christmas. Add to favourites 21 NOV, 2025 | 12 - 5pm Movember Fundraiser with Sporting Legends This November, join Sweat Shop Brew Kitchen for an unforgettable Movember event featuring some of sport's biggest stars! Add to favourites 26 NOV 2025 | 5.30-7.30PM Winemaker in Residence - Lawson’s Dry Hills Taster Join Chief winemaker Marcus Wright and kingi’s head chef Stefania Palermo for a casual, free-flowing tasting in the kingi... Add to favourites 1 OCT - 30 NOV, 2025 SkyCity presents Served SkyCity Auckland is celebrating their award-winning eateries and chefs with Served! G et ready to embark on a round-the-world... Add to favourites Previous Next See more dining Get inspired 18 NOV, 2025 | 7PM Night in the Wharenui Step inside the wharenui and be transported on a vibrant cultural journey. Add to favourites 19 NOV 2025 | 5-8PM From Hawai’i to Aotearoa: He Hui Moana Enjoy a special evening in partnership with Te Toki Voyaging Trust, Nā Kālai Wa'a and Kānehūnāmoku Voyaging Academy. Add to favourites 22 & 23 NOV 2025 | 11AM-3PM Stitching Anew Join Prairie Hatchard-McGill in crafting a fabric collage, inspired by Louise Bourgeois’s work with textiles and her efforts... Add to favourites 22 NOV 2025 | 1-4PM Wood carving workshop with Chevron Hassett Add to favourites 21 & 22 NOV 2025 | 11AM-2PM Wisdom from the Waʻa | Hawaiian Cultural Experience Join Hawaiian elder Kumu Sabra Kauka and navigator Kapena Steve Solystik of the Keiki Waʻa Project for a unique family... Add to favourites 29 NOV, 2025 | 1.30 - 3.30pm Beyond the Frame: Black Abstraction and the Politics of Joy This special conversation brings together three dynamic Black artists and scholars — Elizabeth Freeman, Kainee Simone, and... Add to favourites 29 NOV 2025 | 2-4PM Oceania: Journey to the Centre Join in a special screening of OCEANIA, co-written and produced by Tekinati Ruta, who will be travelling from Kiribati to... Add to favourites Previous Next More to do 18 - 22 NOV, 2025 | 6.30pm Femmes and Thems Comedy 5 nights, 5 different shows, all women, all gender-nonconforming performers from across Aotearoa. Add to favourites 21 NOV, 2025 Black Grace Black Grace marks its 30th anniversary with a powerful double bill uniting the past, present, and future of dance. Add to favourites 22 NOV 2025 | 8PM John Bishop - 25 Years of Stand Up Comedy superstar John Bishop is set to return to Auckland with his new show John Bishop: 25, to celebrate his incredible 25... Add to favourites 22 - 29 NOV, 2025 Po' Boys and Oysters A bold new play by Estelle Chout, directed by Dione Joseph, Po’ Boys & Oysters centres Black queer women in Aotearoa with... Add to favourites 13 NOV - 6 DEC, 2025 D.R.A.G (Dressed Resembling a God) Welcome to Lady T's - a world teeming with fabulous, wild and outrageous creatures where three drag superstars are ready to... Add to favourites Previous Next Mark Your Calendar Events What's on this month Check out the latest events and find out what's on and what's happening in Auckland this month. FRI, SAT & SUN Weekends In The City Centre Maximise your weekend with pop-up markets, live music, free events, family fun and more happening throughout our city centre... Add to favourites Did Someone Say Free? Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites SATURDAYS, 4PM-12AM AND SUNDAYS, 4PM-11PM Silo Park Night Markets Visit the Auckland Night Markets at North Wharf in Wynyard Quarter. Bring the family, bring your friends and bring your... Add to favourites FRIDAYS 12pm-1pm Lunchtime Drop-in Drawing Connect with your choice of art in this BYO drawing encounter, every Friday lunchtime. Add to favourites ONGOING Blue Water Black Magic Explore this extraordinary story of innovative design, meticulous teamwork, outstanding leadership and international success... Add to favourites Saturdays, 8am - 2pm Britomart Saturday Market The weekly Britomart Saturday Market returns every Saturday to Takutai Square. Add to favourites Previous Next Events 119 Results Featured Date Just Announced Search TUESDAYS, 6.30PM Norma Taps Trivia Night Get ready to exercise your grey matter every Tuesday at Norma Taps! Add to favourites 13 Dec 2025 - 14 Dec 2025 Christmas Sailing with Mrs Claus Join Mrs Claus for a special Christmas sailing aboard Ted Ashby and take home a commemorative photo snapped by an elf! Add to favourites SEP 2023 - AUG 2026 Thread of Time: Travel, Trade & Textiles Threads of Time: Travel, Trade & Textiles is a jewel-box display that offers a survey of European art from the 15th to the... Add to favourites 9 FEB, 2024 - 1 FEB, 2026 The Robertson Gift: Paths through Modernity This exhibition celebrates the monumental gift of significant artworks from the collection of New York philanthropists Julian... Add to favourites ONGOING Taimoana | Coastlines: Art in Aotearoa Taimoana | Coastlines explores the art of Aotearoa New Zealand, locating it within Te Moana-nui-a-Kiwa, the wider Pacific... Add to favourites WEDNESDAYS TO SATURDAYS | FROM 9PM Live music at Father Ted's Enjoy live music at this inner-city Irish bar every Wednesday to Saturday from 9pm. Add to favourites DAILY Daily hands-on workshops at Wētā Workshop Unleashed Wētā Workshop Unleashed's hands-on creative workshops are available every day at 12:50pm where you can ignite your... Add to favourites 4 DEC 2025 | 6.30PM What the Quiz is This?! – New Quiz, Who Dis? Come get quizzical at The Basement Theatre with Nomi Cohen's latest musical quiz offering. Add to favourites 2025 Auckland Theatre Company's 2025 Programme Auckland Theatre Company have announced their 2025 Season featuring a captivating range of ideas and voices coming to... Add to favourites Load more Clear All Today Tomorrow This weekend Next 7 Days Next 30 days Event date From To Search Event type Exhibitions Festivals Food and Drink Events Music Events Sports Events Theatre Price $ $$ $$$ Free Today's Top Reads The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Santa's Magical Wonderland Bubbles and BLUSH Editor's Picks What's on this weekend? Free things to do in Auckland City Centre 10 cheap eats under $10 Upcoming concerts Events Auckland Arts Festival Jimmy Carr The Civic Tours Food Truck Wednesdays at Britomart Bill Bryson Show more Explore Dining Bars & Nightlife Shopping Arts & Culture Parking & Transport More menu anchor Back to top Search the city Search Heart of the City Sign up to our Newsletter My favourites Never miss a thing You must have JavaScript enabled to use this form. First Name Surname Email Interests Dining Bars & Nightlife Events Arts & Culture Shopping Offers Activities & Attractions Subscribe Leave this field blank Download on the App store Download on Google Play Submit an event Visit our business members site About Contact T&Cs Sitemap Follow us on Facebook Follow us on Instagram © 2012 - 2025 Heart of the City. All rights reserved. {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"auckland-events\\/this-month\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"antibot\\/antibot.form,better_exposed_filters\\/general,blazy\\/bio.ajax,blazy\\/blazy,blazy\\/classlist,blazy\\/load,blazy\\/loading,blazy\\/polyfill,blazy\\/promise,blazy\\/raf,blazy\\/webp,chosen\\/drupal.chosen,chosen_lib\\/chosen.css,core\\/drupal.ajax,core\\/drupal.date,core\\/internal.jquery.form,core\\/picturefill,crazyegg\\/crazyegg,facets\\/drupal.facets.link-widget,facets\\/drupal.facets.views-ajax,flag\\/flag.link,flag\\/flag.link_ajax,hotc\\/cs-select-slide,hotc\\/global,hotc\\/scottjehl.Respond,hotc\\/twbs.bootstrap,hotc_search\\/bef,hotc_search\\/facet_accordions,hotc_search\\/filters,hotc_search_banner\\/event-search,paragraphs\\/drupal.paragraphs.unpublished,slick\\/slick.css,slick\\/slick.load,slick\\/slick.main.classic,slick\\/slick.main.default,slick\\/slick.theme,system\\/base,views\\/views.ajax,views\\/views.module,views_infinite_scroll\\/views-infinite-scroll,webform\\/webform.ajax,webform\\/webform.composite,webform\\/webform.element.checkboxes,webform\\/webform.element.details.save,webform\\/webform.element.details.toggle,webform\\/webform.element.message,webform\\/webform.element.options,webform\\/webform.form,webform_bootstrap\\/webform_bootstrap\",\"theme\":\"hotc\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true,\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2024-07-15\\u0026field_event_date%5Bmax%5D=2024-08-14\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\":true,\"\\/search\":true,\"\\/event\\/search\\/all\\/all\":true},\"bootstrap\":{\"forms_has_error_value_toggle\":1},\"responsive\":{\"breakpoints\":{\"hotc.xsmall\":\"all and (min-width: 480px)\",\"hotc.small\":\"all and (min-width: 768px)\",\"hotc.medium\":\"all and (min-width: 992px)\",\"hotc.large\":\"all and (min-width: 1200px)\",\"hotc.xlarge\":\"all and (min-width: 1260px)\",\"hotc.mega\":\"all and (min-width: 1360px)\",\"hotc.xmega\":\"all and (min-width: 1760px)\"}},\"antibot\":{\"forms\":{\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\":{\"id\":\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\",\"key\":\"-5B9_WoTB8cZUWRkhRxSZq8C6eczMASxb00M1V29ooA\"}}},\"ajax\":{\"edit-actions-submit\":{\"callback\":\"::submitAjaxForm\",\"event\":\"click\",\"effect\":\"none\",\"speed\":500,\"progress\":{\"type\":\"throbber\",\"message\":\"\"},\"disable-refocus\":true,\"url\":\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2024-07-15\\u0026field_event_date%5Bmax%5D=2024-08-14\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\",\"dialogType\":\"ajax\",\"submit\":{\"_triggering_element_name\":\"op\",\"_triggering_element_value\":\"Subscribe\"}}},\"hotc_search\":{\"event_listings\":{\"validViewsIdentifiers\":{\"fe075e19c0352be14e026ae2b99b1669f1935465e9b7bd1c032d5db8717391d8\":[\"field_event_date\"]},\"routeName\":\"event_85.date_range\",\"eventHref\":\"\\/auckland-events\\/this-month\",\"termTid\":\"86\",\"futureDate\":\"2026-11-17\"}},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:fe075e19c0352be14e026ae2b99b1669f1935465e9b7bd1c032d5db8717391d8\":{\"view_name\":\"sector_sitewide_search\",\"view_display_id\":\"page_4\",\"view_args\":\"85\\/[2025-11-17T00:00:00 TO 2025-12-17T00:00:00]\",\"view_path\":\"\\/auckland-events\\/this-month\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"view_dom_id\":\"fe075e19c0352be14e026ae2b99b1669f1935465e9b7bd1c032d5db8717391d8\",\"pager_element\":0}}},\"field_group\":{\"html_element\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"classes\":\"promotion__wrapper\",\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\",\"target\":\"entity\",\"custom_uri\":\"\",\"target_attribute\":\"default\",\"label\":\"Promotion wrapper\"}},\"link\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"label\":\"Media\",\"classes\":\"promotion__link\",\"id\":\"\",\"target\":\"field_promotion_link\",\"custom_uri\":\"\",\"target_attribute\":\"default\"}}},\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":null},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.35,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"chosen\":{\"selector\":\"\",\"minimum_single\":20,\"minimum_multiple\":20,\"minimum_width\":200,\"use_relative_width\":false,\"options\":{\"disable_search\":false,\"disable_search_threshold\":0,\"allow_single_deselect\":false,\"search_contains\":false,\"placeholder_text_multiple\":\"Choose some options\",\"placeholder_text_single\":\"Choose an option\",\"no_results_text\":\"No results match\",\"max_shown_results\":null,\"inherit_select_classes\":true}},\"facets_views_ajax\":{\"price_event\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"},\"event_type\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"}},\"user\":{\"uid\":0,\"permissionsHash\":\"e261f3b2c7935edb23294afa0cb38c0d6b8a74aa21d734e75c2b3a2180b6aeb7\"}}", "free": true}, "booking": {"url": null, "email": null, "phone": null}, "event_dates": {"start": null, "end": null, "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T07:45:47.458020+00:00", "text_for_embedding": "Submit an event | Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red! | Auckland | Auckland | form.antibot * :not(.antibot-message) { display: none !important; } try{Typekit.load({ async: true, active: function() { var event = new CustomEvent(\"typekitActive\", {}); document.dispatchEvent(event); } });}catch(e){} Events | Heart of the City Skip to main content Back to top anchor Heart of the City Open main menu Close main menu Main menu Events Dining Bars & Nightlife Shopping Parking & Transport Things to do More Main menu (Mobile) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping Open search Close search Favourites Follow us on Facebook Follow us on Twitter Follow us on Instagram Search the city Search Trending: The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Main menu (Mega) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next Events Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red! What's On This Week 18 NOV, 2025 | 7pm Doja Cat GRAMMY-winning global icon Doja Cat sets to make her highly anticipated New Zealand debut as part of the electrifying Ma Vie ... Add to favourites 18 - 20 NOV, 2025 Metallica M72 Pop-Up Shop Calling all Metallica fans— The M72 Pop-Up Shop at Brad's Warehouse unleashes exclusive merch and electrifying energy for die... Add to favourites 8 NOV, 2025-15 MAR, 2026 Pop to Present: American Art from the Virginia Museum of Fine Arts A major cultural event for Aotearoa, this special exhibition celebrates and amplifies the plural artistic voices of the... Add to favourites 22 NOV, 2025 | 7.30 - 8.15PM The Giant Christmas Tree Is Lighting Up! Join the festive fun as Auckland’s favourite Christmas tradition kicks off with the annual tree-lighting event, featuring... Add to favourites Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites Previous Next The beat drops here 22 & 23 NOV, 2025 | 6pm TOOL Grammy Award-winning juggernauts TOOL makes their long-awaited return to New Zealand at Spark Arena on 22 & 23 November 2025... Add to favourites 22 NOV 2025 Jessie Murph Breakout vocal powerhouse Jessie Murph is going global. Add to favourites 23 NOV, 2025 | 3.30pm & 7.30pm Avatar: The Last Airbender in Concert Celebrate 20 years of Avatar: The Last Airbender through its unforgettable characters, and the epic journey that defined a... Add to favourites 23 & 24 NOV 2025 Pixies Pixies have announced a 2025 New Zealand tour which will see the alt-rock legends perform two consecutive nights at Auckland... Add to favourites 25 NOV 2025 Clap Your Hands Say Yeah Iconic indie rock act Clap Your Hands Say Yeah will be playing at The Tuning Fork as part of their 2025 World Tour Add to favourites 26 NOV 2025 | 7PM Ben Ottewell & Ian Ball By Request Tour Ben Ottewell and Ian Ball, founding members of the legendary band Gomez, are bringing their very special By Request tour to... Add to favourites Previous Next See more music events Fun for the kids 15 NOV - 24 DEC, 2025 Santa's Magical Wonderland Step into a world of enchantment where twinkling lights, playful characters, and interactive activities - Santa’s Magical... Add to favourites 23 NOV 2025 | 1-4PM Pudding mit Gabel The viral German trend \"Pudding mit Gabel\" has come to Auckland. Add to favourites 2,8,9,16,23 & 30 NOV 2025 | 10AM-2PM Make Days: Ika pepa (paper fish) Drop into the Maritime Museum on selected dates and take home a free, whānau-friendly craft. Add to favourites 28 - 30 NOV, 2025 The Wizard of Oz The National Youth Theatre Company presents The Wizard of Oz , an enchanting musical drawn from the all-time classic MGM... Add to favourites Previous Next Come hungry, leave happy OCT - NOV, 2025 | Thursdays Late Night Bites Every Thursday this November, Late Night Bites brings curated eats, cocktails, and desserts from top spots across Britomart... Add to favourites 22 NOV 2025 | 11.30AM-1.30PM Bubbles and BLUSH Step into an enchanting afternoon where petals meet bubbles and creativity blooms. Add to favourites Bar Albert 1 NOV - 30 DEC 2025 Louis Roederer Champagne x Bar Albert Your choice of Caviar served three ways $25, Caviar & Champagne experience $55, Cocktail special: French 75 $26 or Caviar Mozzarella & Co. 10 NOV - 14 DEC 2025 Mozzarella & Co x Sawmill Brewery Beer and Cheese Board $45: Choose two Sawmill Brews with a matched tasting cheese board or Beer and Cheese Pairing Menu: $18 NOV - DEC, 2025 Festive Dining at SkyCity Make SkyCity Auckland your festive tradition this Christmas. Add to favourites 21 NOV, 2025 | 12 - 5pm Movember Fundraiser with Sporting Legends This November, join Sweat Shop Brew Kitchen for an unforgettable Movember event featuring some of sport's biggest stars! Add to favourites 26 NOV 2025 | 5.30-7.30PM Winemaker in Residence - Lawson’s Dry Hills Taster Join Chief winemaker Marcus Wright and kingi’s head chef Stefania Palermo for a casual, free-flowing tasting in the kingi... Add to favourites 1 OCT - 30 NOV, 2025 SkyCity presents Served SkyCity Auckland is celebrating their award-winning eateries and chefs with Served! G et ready to embark on a round-the-world... Add to favourites Previous Next See more dining Get inspired 18 NOV, 2025 | 7PM Night in the Wharenui Step inside the wharenui and be transported on a vibrant cultural journey. Add to favourites 19 NOV 2025 | 5-8PM From Hawai’i to Aotearoa: He Hui Moana Enjoy a special evening in partnership with Te Toki Voyaging Trust, Nā Kālai Wa'a and Kānehūnāmoku Voyaging Academy. Add to favourites 22 & 23 NOV 2025 | 11AM-3PM Stitching Anew Join Prairie Hatchard-McGill in crafting a fabric collage, inspired by Louise Bourgeois’s work with textiles and her efforts... Add to favourites 22 NOV 2025 | 1-4PM Wood carving workshop with Chevron Hassett Add to favourites 21 & 22 NOV 2025 | 11AM-2PM Wisdom from the Waʻa | Hawaiian Cultural Experience Join Hawaiian elder Kumu Sabra Kauka and navigator Kapena Steve Solystik of the Keiki Waʻa Project for a unique family... Add to favourites 29 NOV, 2025 | 1.30 - 3.30pm Beyond the Frame: Black Abstraction and the Politics of Joy This special conversation brings together three dynamic Black artists and scholars — Elizabeth Freeman, Kainee Simone, and... Add to favourites 29 NOV 2025 | 2-4PM Oceania: Journey to the Centre Join in a special screening of OCEANIA, co-written and produced by Tekinati Ruta, who will be travelling from Kiribati to... Add to favourites Previous Next More to do 18 - 22 NOV, 2025 | 6.30pm Femmes and Thems Comedy 5 nights, 5 different shows, all women, all gender-nonconforming performers from across Aotearoa. Add to favourites 21 NOV, 2025 Black Grace Black Grace marks its 30th anniversary with a powerful double bill uniting the past, present, and future of dance. Add to favourites 22 NOV 2025 | 8PM John Bishop - 25 Years of Stand Up Comedy superstar John Bishop is set to return to Auckland with his new show John Bishop: 25, to celebrate his incredible 25... Add to favourites 22 - 29 NOV, 2025 Po' Boys and Oysters A bold new play by Estelle Chout, directed by Dione Joseph, Po’ Boys & Oysters centres Black queer women in Aotearoa with... Add to favourites 13 NOV - 6 DEC, 2025 D.R.A.G (Dressed Resembling a God) Welcome to Lady T's - a world teeming with fabulous, wild and outrageous creatures where three drag superstars are ready to... Add to favourites Previous Next Mark Your Calendar Events What's on this month Check out the latest events and find out what's on and what's happening in Auckland this month. FRI, SAT & SUN Weekends In The City Centre Maximise your weekend with pop-up markets, live music, free events, family fun and more happening throughout our city centre... Add to favourites Did Someone Say Free? Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites SATURDAYS, 4PM-12AM AND SUNDAYS, 4PM-11PM Silo Park Night Markets Visit the Auckland Night Markets at North Wharf in Wynyard Quarter. Bring the family, bring your friends and bring your... Add to favourites FRIDAYS 12pm-1pm Lunchtime Drop-in Drawing Connect with your choice of art in this BYO drawing encounter, every Friday lunchtime. Add to favourites ONGOING Blue Water Black Magic Explore this extraordinary story of innovative design, meticulous teamwork, outstanding leadership and international success... Add to favourites Saturdays, 8am - 2pm Britomart Saturday Market The weekly Britomart Saturday Market returns every Saturday to Takutai Square. Add to favourites Previous Next Events 119 Results Featured Date Just Announced Search TUESDAYS, 6.30PM Norma Taps Trivia Night Get ready to exercise your grey matter every Tuesday at Norma Taps! Add to favourites 13 Dec 2025 - 14 Dec 2025 Christmas Sailing with Mrs Claus Join Mrs Claus for a special Christmas sailing aboard Ted Ashby and take home a commemorative photo snapped by an elf! Add to favourites SEP 2023 - AUG 2026 Thread of Time: Travel, Trade & Textiles Threads of Time: Travel, Trade & Textiles is a jewel-box display that offers a survey of European art from the 15th to the... Add to favourites 9 FEB, 2024 - 1 FEB, 2026 The Robertson Gift: Paths through Modernity This exhibition celebrates the monumental gift of significant artworks from the collection of New York philanthropists Julian... Add to favourites ONGOING Taimoana | Coastlines: Art in Aotearoa Taimoana | Coastlines explores the art of Aotearoa New Zealand, locating it within Te Moana-nui-a-Kiwa, the wider Pacific... Add to favourites WEDNESDAYS TO SATURDAYS | FROM 9PM Live music at Father Ted's Enjoy live music at this inner-city Irish bar every Wednesday to Saturday from 9pm. Add to favourites DAILY Daily hands-on workshops at Wētā Workshop Unleashed Wētā Workshop Unleashed's hands-on creative workshops are available every day at 12:50pm where you can ignite your... Add to favourites 4 DEC 2025 | 6.30PM What the Quiz is This?! – New Quiz, Who Dis? Come get quizzical at The Basement Theatre with Nomi Cohen's latest musical quiz offering. Add to favourites 2025 Auckland Theatre Company's 2025 Programme Auckland Theatre Company have announced their 2025 Season featuring a captivating range of ideas and voices coming to... Add to favourites Load more Clear All Today Tomorrow This weekend Next 7 Days Next 30 days Event date From To Search Event type Exhibitions Festivals Food and Drink Events Music Events Sports Events Theatre Price $ $$ $$$ Free Today's Top Reads The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Santa's Magical Wonderland Bubbles and BLUSH Editor's Picks What's on this weekend? Free things to do in Auckland City Centre 10 cheap eats under $10 Upcoming concerts Events Auckland Arts Festival Jimmy Carr The Civic Tours Food Truck Wednesdays at Britomart Bill Bryson Show more Explore Dining Bars & Nightlife Shopping Arts & Culture Parking & Transport More menu anchor Back to top Search the city Search Heart of the City Sign up to our Newsletter My favourites Never miss a thing You must have JavaScript enabled to use this form. First Name Surname Email Interests Dining Bars & Nightlife Events Arts & Culture Shopping Offers Activities & Attractions Subscribe Leave this field blank Download on the App store Download on Google Play Submit an event Visit our business members site About Contact T&Cs Sitemap Follow us on Facebook Follow us on Instagram © 2012 - 2025 Heart of the City. All rights reserved. {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"auckland-events\\/this-month\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"antibot\\/antibot.form,better_exposed_filters\\/general,blazy\\/bio.ajax,blazy\\/blazy,blazy\\/classlist,blazy\\/load,blazy\\/loading,blazy\\/polyfill,blazy\\/promise,blazy\\/raf,blazy\\/webp,chosen\\/drupal.chosen,chosen_lib\\/chosen.css,core\\/drupal.ajax,core\\/drupal.date,core\\/internal.jquery.form,core\\/picturefill,crazyegg\\/crazyegg,facets\\/drupal.facets.link-widget,facets\\/drupal.facets.views-ajax,flag\\/flag.link,flag\\/flag.link_ajax,hotc\\/cs-select-slide,hotc\\/global,hotc\\/scottjehl.Respond,hotc\\/twbs.bootstrap,hotc_search\\/bef,hotc_search\\/facet_accordions,hotc_search\\/filters,hotc_search_banner\\/event-search,paragraphs\\/drupal.paragraphs.unpublished,slick\\/slick.css,slick\\/slick.load,slick\\/slick.main.classic,slick\\/slick.main.default,slick\\/slick.theme,system\\/base,views\\/views.ajax,views\\/views.module,views_infinite_scroll\\/views-infinite-scroll,webform\\/webform.ajax,webform\\/webform.composite,webform\\/webform.element.checkboxes,webform\\/webform.element.details.save,webform\\/webform.element.details.toggle,webform\\/webform.element.message,webform\\/webform.element.options,webform\\/webform.form,webform_bootstrap\\/webform_bootstrap\",\"theme\":\"hotc\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true,\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2024-07-15\\u0026field_event_date%5Bmax%5D=2024-08-14\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\":true,\"\\/search\":true,\"\\/event\\/search\\/all\\/all\":true},\"bootstrap\":{\"forms_has_error_value_toggle\":1},\"responsive\":{\"breakpoints\":{\"hotc.xsmall\":\"all and (min-width: 480px)\",\"hotc.small\":\"all and (min-width: 768px)\",\"hotc.medium\":\"all and (min-width: 992px)\",\"hotc.large\":\"all and (min-width: 1200px)\",\"hotc.xlarge\":\"all and (min-width: 1260px)\",\"hotc.mega\":\"all and (min-width: 1360px)\",\"hotc.xmega\":\"all and (min-width: 1760px)\"}},\"antibot\":{\"forms\":{\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\":{\"id\":\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\",\"key\":\"-5B9_WoTB8cZUWRkhRxSZq8C6eczMASxb00M1V29ooA\"}}},\"ajax\":{\"edit-actions-submit\":{\"callback\":\"::submitAjaxForm\",\"event\":\"click\",\"effect\":\"none\",\"speed\":500,\"progress\":{\"type\":\"throbber\",\"message\":\"\"},\"disable-refocus\":true,\"url\":\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2024-07-15\\u0026field_event_date%5Bmax%5D=2024-08-14\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\",\"dialogType\":\"ajax\",\"submit\":{\"_triggering_element_name\":\"op\",\"_triggering_element_value\":\"Subscribe\"}}},\"hotc_search\":{\"event_listings\":{\"validViewsIdentifiers\":{\"fe075e19c0352be14e026ae2b99b1669f1935465e9b7bd1c032d5db8717391d8\":[\"field_event_date\"]},\"routeName\":\"event_85.date_range\",\"eventHref\":\"\\/auckland-events\\/this-month\",\"termTid\":\"86\",\"futureDate\":\"2026-11-17\"}},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:fe075e19c0352be14e026ae2b99b1669f1935465e9b7bd1c032d5db8717391d8\":{\"view_name\":\"sector_sitewide_search\",\"view_display_id\":\"page_4\",\"view_args\":\"85\\/[2025-11-17T00:00:00 TO 2025-12-17T00:00:00]\",\"view_path\":\"\\/auckland-events\\/this-month\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"view_dom_id\":\"fe075e19c0352be14e026ae2b99b1669f1935465e9b7bd1c032d5db8717391d8\",\"pager_element\":0}}},\"field_group\":{\"html_element\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"classes\":\"promotion__wrapper\",\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\",\"target\":\"entity\",\"custom_uri\":\"\",\"target_attribute\":\"default\",\"label\":\"Promotion wrapper\"}},\"link\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"label\":\"Media\",\"classes\":\"promotion__link\",\"id\":\"\",\"target\":\"field_promotion_link\",\"custom_uri\":\"\",\"target_attribute\":\"default\"}}},\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":null},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.35,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"chosen\":{\"selector\":\"\",\"minimum_single\":20,\"minimum_multiple\":20,\"minimum_width\":200,\"use_relative_width\":false,\"options\":{\"disable_search\":false,\"disable_search_threshold\":0,\"allow_single_deselect\":false,\"search_contains\":false,\"placeholder_text_multiple\":\"Choose some options\",\"placeholder_text_single\":\"Choose an option\",\"no_results_text\":\"No results match\",\"max_shown_results\":null,\"inherit_select_classes\":true}},\"facets_views_ajax\":{\"price_event\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"},\"event_type\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"}},\"user\":{\"uid\":0,\"permissionsHash\":\"e261f3b2c7935edb23294afa0cb38c0d6b8a74aa21d734e75c2b3a2180b6aeb7\"}} | Events"}
