{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/lexus-urban-polo", "title": "Lexus Urban Polo", "description": "The Lexus Urban Polo® returns to the beautiful Hagley Park, Christchurch on Saturday, 21 February 2026. Get amongst all the action on and off the field. Hagley Park, Christchurch This is an R18 event, 12:00 – 7:30pm • Doors open 12:00pm Get amongst all the action on and off the field. Watch thrilling, fast paced polo matches, stomp the divots, try polo for yourself on top of our hitting boxes, meet the polo players, check out our epic DJ line-up on the main stage, enjoy the delicious offerings from our food and beverage partners or try out one of the activations. Tickets on sale now for General Admission, VIP and Corporate Hosting in our Private Marquees. It’s truly an experience like no other! The Lexus Urban Polo® starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/2000x1333/656a7f5aa1/lexus-urban-polo.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:28Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/the-art-of-banksy", "title": "The Art of Banksy", "description": "Enjoy over 150 original artworks, prints, and installations by the elusive street artist. This is your final chance to experience Banksy’s most iconic pieces in New Zealand. Te Pae Christchurch Convention Centre The world-famous exhibition, The Art of Banksy, is coming to Christchurch this summer at Te Pae Christchurch Convention Centre. With over 150 original artworks, prints, and installations by the elusive street artist, this is your final chance to experience Banksy’s most iconic and thought-provoking pieces in Aotearoa NZ. From Girl with Balloon (Gold Edition) to Flower Thrower, this is an unmissable opportunity to get up close to authenticated Banksy artworks. Over 150 pieces on display Iconic thought-provoking art Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1414/569032351a/banksy.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:29Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/supercars-christchurch", "title": "Supercars Christchurch Super 440", "description": "Ōtautahi Christchurch is geared up to welcome the Repco Supercars Championship to Ruapuna Motorsport Park. Ruapuna Motorsport Park, Christchurch As Australasia’s premier touring car series, Supercars promises high-octane action, fierce competition and an unforgettable experience — and we can’t wait to see it all unfold right here in Christchurch in 2026. For the first time, drivers will battle it out on the iconic South Island circuit — led by Kiwi star Matt Payne, winner of the Jason Richards Memorial Trophy and now Bathurst 1000 champion. Fans from across Aotearoa can rally trackside to cheer on their 'King of the Mountain. ' Multiple transport options will be available to make getting to Ruapuna Raceway easy and hassle-free over the event weekend. . As Christchurch prepares to host Supercars, Ruapuna Raceway is undergoing targeted upgrades to meet track safety standards for its inaugural year. Led by the Canterbury Car Club and supported by Christchurch City Council, ChristchurchNZ, and Supercars, the immediate focus is on ensuring the circuit complies with all safety requirements for drivers and spectators. Infrastructure enhancements will continue in subsequent years, building on this foundation to elevate the venue into a world-class motorsport destination. An accessible viewing area will be located between turn 10 and turn 11, near gate B. Please purchase a Trackside General Admission ticket and email to advise your requirements. The venue is a mix of sealed roads, dirt roads and grass. Viewing areas around the track are all raised above the racetrack, and therefore, there is a requirement to navigate inclines and descents around the venue. Corporate tickets can be purchased for the Engine Room, which caters to those using a wheelchair. There are also a number of wheelchair-friendly toilets in the precinct. Accessible parking will be located in the premium carpark. There are limited carparks in this location, which will be on a first-come, first-served basis. Spectators parking here will need to show a valid ticket to the event (including all passengers in the vehicle) and a valid NZ mobility parking permit clearly displayed on the front windscreen of the vehicle. Entry to this carpark for valid mobility car parking permits is free. If the carpark is full, patrons can head to the public carpark or to the park n ride at the Canterbury Agricultural Park (A&P showgrounds, 102 Curletts Road, Sockburn, Christchurch). Accessible buses will be operating throughout the day. Check back here for updates as more action unfolds in the lead-up to . Event starts in What's On", "dates": {"start": null, "end": null, "text": "A 'Super shuttle service' will be running from the central city. This is a paid morning and nightly service, and return shuttle tickets can be purchased starting from $30."}, "price": "$30", "location": null, "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1394/ab4dc65034/super-cars.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:29Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/super-rugby-pacific-super-round", "title": "Super Rugby Pacific - Super Round", "description": "Super Round heads to New Zealand for the first time, opening One New Zealand Stadium Christchurch. One New Zealand Stadium, 218 Madras Street, Christchurch Super Round is a festival weekend of Super Rugby Pacific where every team plays at the same venue. Across three days over ANZAC weekend, fans enjoy multiple matches in Ōtautahi Christchurch - it’s rugby’s biggest celebration. Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/2400x1349/c6a15107bf/one-new-zealand-stadium.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/west-indies-v-blackcaps", "title": "West Indies v BLACKCAPS", "description": "Caribbean flair meets Kiwi fire. The BLACKCAPS face the West Indies in the first Test Match of the series. Hagley Oval, Christchurch Big hits. Big names. Big series. Feel the electric atmosphere, soak up the summer vibes, and enjoy world-class cricket right here at home. Hagley Oval’s stunning setting offers the perfect backdrop for world-class cricket and an unforgettable summer. Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1320/279a3368a1/black-caps.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/new-years-eve", "title": "New Years Eve", "description": "Ring in the new year at North Hagley Park with family friendly fun. With a ‘kids countdown’ from 4-7pm, followed by a New Years Eve party from 8pm - midnight featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora. North Hagley Park Say hello to 2026 with New Years Eve celebrations in North Hagley Park. - powered with Hydrate by IHF, is kicking off the New Year’s Eve celebrations early with a special kids’ event that your whānau won’t want to miss. Join the fun without having to stay out late! - featuring Kora, with support from local acts Dillastrate, Brad Staley and DJ Sambora, all MCed by Henare Kaa. Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1320/3c095dd727/whats-on-new-years-eve.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:30Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/world-buskers-festival", "title": "World Buskers Festival", "description": "Get amongst the fun this summer as the World Buskers Festival returns to Ōtautahi Christchurch for ten days of street performance, ticketed shows, and pop-up surprises across the city. Multiple venues across the city This summer the streets of Ōtautahi Christchurch come alive with laughter, spectacle, and the kind of unexpected moments that make the World Buskers Festival one of our most loved festivals. From Friday, 23 January to Sunday, 1 February 2026, across the five city pitches and two pop-up locations, the festival blends the best of international street talent with the creativity and spirit of homegrown performers. Expect jaw-dropping acrobatics, cheeky comedy, world-class circus acts, and unforgettable moments in every corner of the central city. Buskers near the Bridge of Remembrance Crowd at the World Buskers Festival Buskers in City Mall Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1320/e4187db72a/buskers-performing-in-cashel-mall.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/crankworx-christchurch", "title": "Crankworx Christchurch", "description": "Crankworx Christchurch 2026 is coming in hot! From 19 - 22 February, Crankworx returns to the Christchurch Adventure Park. Be part of the action. Christchurch Adventure Park From 19 - 22 February, the world’s best mountain bikers will descend on Christchurch Adventure Park for a four-day celebration of speed, skill, and the wild side of MTB. Expect action-packed events, family-friendly vibes, and the electric festival atmosphere Crankworx is known for, all set against Canterbury’s iconic Port Hills. Whether you’re a die-hard fan or just keen for an epic summer day out, tickets are on sale now, with options for fans of all ages. Don’t miss your chance to witness gravity-defying talent right here in Ōtautahi. Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1920x1261/8d3058affa/crankworx-ctrahan-cwx-ss-ch-slope-finals.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:31Z"}
{"source": "christchurchnz", "url": "https://www.christchurchnz.com/visit/whats-on/nz-squash-open", "title": "NZ Squash Open", "description": "Get ready for world-class action as the NZ Squash Open returns in 2026! This premier international tournament will showcase the world’s top professional players alongside New Zealand’s rising stars, all competing for glory on court. Isaac Theatre Royal, Christchurch Expect fast-paced rallies, breath-taking skill, and an electric atmosphere as Christchurch hosts the biggest squash event in the country. With men’s and women’s draws stacked with talent, every match promises drama, intensity, and unforgettable moments. Whether you’re a passionate squash fan or new to the sport, the NZ Squash Open is an event you won’t want to miss. Secure your seats today and be part of the excitement as history is made on the glass court! Event starts in What's On", "dates": {"start": null, "end": null, "text": "Terms of use"}, "price": null, "location": "Privacy Policy", "categories": null, "image": "https://a-ap.storyblok.com/f/3000820/1980x1322/4fc33c7850/nz-squash-open.jpg/m/1200x630", "updated_at": "2025-12-02T23:01:31Z"}
