{"id": "8a18cb48538632c5", "record_type": "event", "name": "Submit an event", "description": "Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red!", "categories": ["Events"], "tags": [], "url": "https://heartofthecity.co.nz/auckland-events/this-month", "source": "heartofthecity.co.nz", "images": ["https://heartofthecity.co.nz/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-104.jpg"], "location": {"name": "Find out more", "address": null, "city": "Auckland", "region": "Auckland", "country": "New Zealand", "latitude": null, "longitude": null}, "price": {"currency": "NZD", "min": 0.0, "max": 61953.0, "text": "form.antibot * :not(.antibot-message) { display: none !important; } try{Typekit.load({ async: true, active: function() { var event = new CustomEvent(\"typekitActive\", {}); document.dispatchEvent(event); } });}catch(e){} Events | Heart of the City Skip to main content Back to top anchor Heart of the City Open main menu Close main menu Main menu Events Dining Bars & Nightlife Shopping Parking & Transport Things to do More Main menu (Mobile) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping Open search Close search Favourites Follow us on Facebook Follow us on Twitter Follow us on Instagram Search the city Search Trending: The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Main menu (Mega) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next Events Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red! What's On This Week 18 NOV, 2025 | 7pm Doja Cat GRAMMY-winning global icon Doja Cat sets to make her highly anticipated New Zealand debut as part of the electrifying Ma Vie ... Add to favourites 18 - 20 NOV, 2025 Metallica M72 Pop-Up Shop Calling all Metallica fans— The M72 Pop-Up Shop at Brad's Warehouse unleashes exclusive merch and electrifying energy for die... Add to favourites 8 NOV, 2025-15 MAR, 2026 Pop to Present: American Art from the Virginia Museum of Fine Arts A major cultural event for Aotearoa, this special exhibition celebrates and amplifies the plural artistic voices of the... Add to favourites 22 NOV, 2025 | 7.30 - 8.15PM The Giant Christmas Tree Is Lighting Up! Join the festive fun as Auckland’s favourite Christmas tradition kicks off with the annual tree-lighting event, featuring... Add to favourites Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites Previous Next The beat drops here 22 & 23 NOV, 2025 | 6pm TOOL Grammy Award-winning juggernauts TOOL makes their long-awaited return to New Zealand at Spark Arena on 22 & 23 November 2025... Add to favourites 22 NOV 2025 Jessie Murph Breakout vocal powerhouse Jessie Murph is going global. Add to favourites 23 NOV, 2025 | 3.30pm & 7.30pm Avatar: The Last Airbender in Concert Celebrate 20 years of Avatar: The Last Airbender through its unforgettable characters, and the epic journey that defined a... Add to favourites 23 & 24 NOV 2025 Pixies Pixies have announced a 2025 New Zealand tour which will see the alt-rock legends perform two consecutive nights at Auckland... Add to favourites 25 NOV 2025 Clap Your Hands Say Yeah Iconic indie rock act Clap Your Hands Say Yeah will be playing at The Tuning Fork as part of their 2025 World Tour Add to favourites 26 NOV 2025 | 7PM Ben Ottewell & Ian Ball By Request Tour Ben Ottewell and Ian Ball, founding members of the legendary band Gomez, are bringing their very special By Request tour to... Add to favourites Previous Next See more music events Fun for the kids 15 NOV - 24 DEC, 2025 Santa's Magical Wonderland Step into a world of enchantment where twinkling lights, playful characters, and interactive activities - Santa’s Magical... Add to favourites 23 NOV 2025 | 1-4PM Pudding mit Gabel The viral German trend \"Pudding mit Gabel\" has come to Auckland. Add to favourites 2,8,9,16,23 & 30 NOV 2025 | 10AM-2PM Make Days: Ika pepa (paper fish) Drop into the Maritime Museum on selected dates and take home a free, whānau-friendly craft. Add to favourites 28 - 30 NOV, 2025 The Wizard of Oz The National Youth Theatre Company presents The Wizard of Oz , an enchanting musical drawn from the all-time classic MGM... Add to favourites Previous Next Come hungry, leave happy OCT - NOV, 2025 | Thursdays Late Night Bites Every Thursday this November, Late Night Bites brings curated eats, cocktails, and desserts from top spots across Britomart... Add to favourites 22 NOV 2025 | 11.30AM-1.30PM Bubbles and BLUSH Step into an enchanting afternoon where petals meet bubbles and creativity blooms. Add to favourites Bar Albert 1 NOV - 30 DEC 2025 Louis Roederer Champagne x Bar Albert Your choice of Caviar served three ways $25, Caviar & Champagne experience $55, Cocktail special: French 75 $26 or Caviar Mozzarella & Co. 10 NOV - 14 DEC 2025 Mozzarella & Co x Sawmill Brewery Beer and Cheese Board $45: Choose two Sawmill Brews with a matched tasting cheese board or Beer and Cheese Pairing Menu: $18 NOV - DEC, 2025 Festive Dining at SkyCity Make SkyCity Auckland your festive tradition this Christmas. Add to favourites 21 NOV, 2025 | 12 - 5pm Movember Fundraiser with Sporting Legends This November, join Sweat Shop Brew Kitchen for an unforgettable Movember event featuring some of sport's biggest stars! Add to favourites 26 NOV 2025 | 5.30-7.30PM Winemaker in Residence - Lawson’s Dry Hills Taster Join Chief winemaker Marcus Wright and kingi’s head chef Stefania Palermo for a casual, free-flowing tasting in the kingi... Add to favourites 1 OCT - 30 NOV, 2025 SkyCity presents Served SkyCity Auckland is celebrating their award-winning eateries and chefs with Served! G et ready to embark on a round-the-world... Add to favourites Previous Next See more dining Get inspired 18 NOV, 2025 | 7PM Night in the Wharenui Step inside the wharenui and be transported on a vibrant cultural journey. Add to favourites 19 NOV 2025 | 5-8PM From Hawai’i to Aotearoa: He Hui Moana Enjoy a special evening in partnership with Te Toki Voyaging Trust, Nā Kālai Wa'a and Kānehūnāmoku Voyaging Academy. Add to favourites 22 & 23 NOV 2025 | 11AM-3PM Stitching Anew Join Prairie Hatchard-McGill in crafting a fabric collage, inspired by Louise Bourgeois’s work with textiles and her efforts... Add to favourites 22 NOV 2025 | 1-4PM Wood carving workshop with Chevron Hassett Add to favourites 21 & 22 NOV 2025 | 11AM-2PM Wisdom from the Waʻa | Hawaiian Cultural Experience Join Hawaiian elder Kumu Sabra Kauka and navigator Kapena Steve Solystik of the Keiki Waʻa Project for a unique family... Add to favourites 29 NOV, 2025 | 1.30 - 3.30pm Beyond the Frame: Black Abstraction and the Politics of Joy This special conversation brings together three dynamic Black artists and scholars — Elizabeth Freeman, Kainee Simone, and... Add to favourites 29 NOV 2025 | 2-4PM Oceania: Journey to the Centre Join in a special screening of OCEANIA, co-written and produced by Tekinati Ruta, who will be travelling from Kiribati to... Add to favourites Previous Next More to do 18 - 22 NOV, 2025 | 6.30pm Femmes and Thems Comedy 5 nights, 5 different shows, all women, all gender-nonconforming performers from across Aotearoa. Add to favourites 21 NOV, 2025 Black Grace Black Grace marks its 30th anniversary with a powerful double bill uniting the past, present, and future of dance. Add to favourites 22 NOV 2025 | 8PM John Bishop - 25 Years of Stand Up Comedy superstar John Bishop is set to return to Auckland with his new show John Bishop: 25, to celebrate his incredible 25... Add to favourites 22 - 29 NOV, 2025 Po' Boys and Oysters A bold new play by Estelle Chout, directed by Dione Joseph, Po’ Boys & Oysters centres Black queer women in Aotearoa with... Add to favourites 13 NOV - 6 DEC, 2025 D.R.A.G (Dressed Resembling a God) Welcome to Lady T's - a world teeming with fabulous, wild and outrageous creatures where three drag superstars are ready to... Add to favourites Previous Next Mark Your Calendar Events What's on this month Check out the latest events and find out what's on and what's happening in Auckland this month. FRI, SAT & SUN Weekends In The City Centre Maximise your weekend with pop-up markets, live music, free events, family fun and more happening throughout our city centre... Add to favourites Did Someone Say Free? Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites SATURDAYS, 4PM-12AM AND SUNDAYS, 4PM-11PM Silo Park Night Markets Visit the Auckland Night Markets at North Wharf in Wynyard Quarter. Bring the family, bring your friends and bring your... Add to favourites FRIDAYS 12pm-1pm Lunchtime Drop-in Drawing Connect with your choice of art in this BYO drawing encounter, every Friday lunchtime. Add to favourites ONGOING Blue Water Black Magic Explore this extraordinary story of innovative design, meticulous teamwork, outstanding leadership and international success... Add to favourites Saturdays, 8am - 2pm Britomart Saturday Market The weekly Britomart Saturday Market returns every Saturday to Takutai Square. Add to favourites Previous Next Events 121 Results Featured Date Just Announced Search TUESDAYS, 6.30PM Norma Taps Trivia Night Get ready to exercise your grey matter every Tuesday at Norma Taps! Add to favourites 13 Dec 2025 - 14 Dec 2025 Christmas Sailing with Mrs Claus Join Mrs Claus for a special Christmas sailing aboard Ted Ashby and take home a commemorative photo snapped by an elf! Add to favourites SEP 2023 - AUG 2026 Thread of Time: Travel, Trade & Textiles Threads of Time: Travel, Trade & Textiles is a jewel-box display that offers a survey of European art from the 15th to the... Add to favourites 9 FEB, 2024 - 1 FEB, 2026 The Robertson Gift: Paths through Modernity This exhibition celebrates the monumental gift of significant artworks from the collection of New York philanthropists Julian... Add to favourites ONGOING Taimoana | Coastlines: Art in Aotearoa Taimoana | Coastlines explores the art of Aotearoa New Zealand, locating it within Te Moana-nui-a-Kiwa, the wider Pacific... Add to favourites WEDNESDAYS TO SATURDAYS | FROM 9PM Live music at Father Ted's Enjoy live music at this inner-city Irish bar every Wednesday to Saturday from 9pm. Add to favourites DAILY Daily hands-on workshops at Wētā Workshop Unleashed Wētā Workshop Unleashed's hands-on creative workshops are available every day at 12:50pm where you can ignite your... Add to favourites 4 DEC 2025 | 6.30PM What the Quiz is This?! – New Quiz, Who Dis? Come get quizzical at The Basement Theatre with Nomi Cohen's latest musical quiz offering. Add to favourites 2025 Auckland Theatre Company's 2025 Programme Auckland Theatre Company have announced their 2025 Season featuring a captivating range of ideas and voices coming to... Add to favourites Load more Clear All Today Tomorrow This weekend Next 7 Days Next 30 days Event date From To Search Event type Exhibitions Festivals Food and Drink Events Music Events Sports Events Theatre Price $ $$ $$$ Free Today's Top Reads The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Bubbles and BLUSH Santa's Magical Wonderland Editor's Picks What's on this weekend? Free things to do in Auckland City Centre 10 cheap eats under $10 Upcoming concerts Events Auckland Arts Festival Jimmy Carr The Civic Tours Food Truck Wednesdays at Britomart Bill Bryson Show more Explore Dining Bars & Nightlife Shopping Arts & Culture Parking & Transport More menu anchor Back to top Search the city Search Heart of the City Sign up to our Newsletter My favourites Never miss a thing You must have JavaScript enabled to use this form. First Name Surname Email Interests Dining Bars & Nightlife Events Arts & Culture Shopping Offers Activities & Attractions Subscribe Leave this field blank Download on the App store Download on Google Play Submit an event Visit our business members site About Contact T&Cs Sitemap Follow us on Facebook Follow us on Instagram © 2012 - 2025 Heart of the City. All rights reserved. {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"auckland-events\\/this-month\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"antibot\\/antibot.form,better_exposed_filters\\/general,blazy\\/bio.ajax,blazy\\/blazy,blazy\\/classlist,blazy\\/load,blazy\\/loading,blazy\\/polyfill,blazy\\/promise,blazy\\/raf,blazy\\/webp,chosen\\/drupal.chosen,chosen_lib\\/chosen.css,core\\/drupal.ajax,core\\/drupal.date,core\\/internal.jquery.form,core\\/picturefill,crazyegg\\/crazyegg,facets\\/drupal.facets.link-widget,facets\\/drupal.facets.views-ajax,flag\\/flag.link,flag\\/flag.link_ajax,hotc\\/cs-select-slide,hotc\\/global,hotc\\/scottjehl.Respond,hotc\\/twbs.bootstrap,hotc_search\\/bef,hotc_search\\/facet_accordions,hotc_search\\/filters,hotc_search_banner\\/event-search,paragraphs\\/drupal.paragraphs.unpublished,slick\\/slick.css,slick\\/slick.load,slick\\/slick.main.classic,slick\\/slick.main.default,slick\\/slick.theme,system\\/base,views\\/views.ajax,views\\/views.module,views_infinite_scroll\\/views-infinite-scroll,webform\\/webform.ajax,webform\\/webform.composite,webform\\/webform.element.checkboxes,webform\\/webform.element.details.save,webform\\/webform.element.details.toggle,webform\\/webform.element.message,webform\\/webform.element.options,webform\\/webform.form,webform_bootstrap\\/webform_bootstrap\",\"theme\":\"hotc\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true,\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2025-02-28\\u0026field_event_date%5Bmax%5D=2025-03-30\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\":true,\"\\/search\":true,\"\\/event\\/search\\/all\\/all\":true},\"bootstrap\":{\"forms_has_error_value_toggle\":1},\"responsive\":{\"breakpoints\":{\"hotc.xsmall\":\"all and (min-width: 480px)\",\"hotc.small\":\"all and (min-width: 768px)\",\"hotc.medium\":\"all and (min-width: 992px)\",\"hotc.large\":\"all and (min-width: 1200px)\",\"hotc.xlarge\":\"all and (min-width: 1260px)\",\"hotc.mega\":\"all and (min-width: 1360px)\",\"hotc.xmega\":\"all and (min-width: 1760px)\"}},\"antibot\":{\"forms\":{\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\":{\"id\":\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\",\"key\":\"-5B9_WoTB8cZUWRkhRxSZq8C6eczMASxb00M1V29ooA\"}}},\"ajax\":{\"edit-actions-submit\":{\"callback\":\"::submitAjaxForm\",\"event\":\"click\",\"effect\":\"none\",\"speed\":500,\"progress\":{\"type\":\"throbber\",\"message\":\"\"},\"disable-refocus\":true,\"url\":\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2025-02-28\\u0026field_event_date%5Bmax%5D=2025-03-30\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\",\"dialogType\":\"ajax\",\"submit\":{\"_triggering_element_name\":\"op\",\"_triggering_element_value\":\"Subscribe\"}}},\"hotc_search\":{\"event_listings\":{\"validViewsIdentifiers\":{\"3a77ea55f7e9dfd1b3c61953cd6a069e34ea2ac4a5e5bd3be90de953f234c32d\":[\"field_event_date\"]},\"routeName\":\"event_85.date_range\",\"eventHref\":\"\\/auckland-events\\/this-month\",\"termTid\":\"86\",\"futureDate\":\"2026-11-18\"}},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:3a77ea55f7e9dfd1b3c61953cd6a069e34ea2ac4a5e5bd3be90de953f234c32d\":{\"view_name\":\"sector_sitewide_search\",\"view_display_id\":\"page_4\",\"view_args\":\"85\\/[2025-11-18T00:00:00 TO 2025-12-18T00:00:00]\",\"view_path\":\"\\/auckland-events\\/this-month\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"view_dom_id\":\"3a77ea55f7e9dfd1b3c61953cd6a069e34ea2ac4a5e5bd3be90de953f234c32d\",\"pager_element\":0}}},\"field_group\":{\"html_element\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"classes\":\"promotion__wrapper\",\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\",\"target\":\"entity\",\"custom_uri\":\"\",\"target_attribute\":\"default\",\"label\":\"Promotion wrapper\"}},\"link\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"label\":\"Media\",\"classes\":\"promotion__link\",\"id\":\"\",\"target\":\"field_promotion_link\",\"custom_uri\":\"\",\"target_attribute\":\"default\"}}},\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":null},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.35,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"chosen\":{\"selector\":\"\",\"minimum_single\":20,\"minimum_multiple\":20,\"minimum_width\":200,\"use_relative_width\":false,\"options\":{\"disable_search\":false,\"disable_search_threshold\":0,\"allow_single_deselect\":false,\"search_contains\":false,\"placeholder_text_multiple\":\"Choose some options\",\"placeholder_text_single\":\"Choose an option\",\"no_results_text\":\"No results match\",\"max_shown_results\":null,\"inherit_select_classes\":true}},\"facets_views_ajax\":{\"price_event\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"},\"event_type\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"}},\"user\":{\"uid\":0,\"permissionsHash\":\"e261f3b2c7935edb23294afa0cb38c0d6b8a74aa21d734e75c2b3a2180b6aeb7\"}}", "free": true}, "booking": {"url": null, "email": null, "phone": null}, "event_dates": {"start": null, "end": null, "timezone": "Pacific/Auckland"}, "opening_hours": null, "operating_months": null, "data_collected_at": "2025-11-17T19:50:20.386564+00:00", "text_for_embedding": "Submit an event | Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red! | Auckland | Auckland | 18 NOV, 2025 | 7pm 22 NOV, 2025 | 7.30 - 8.15PM 22 & 23 NOV, 2025 | 6pm 23 NOV, 2025 | 3.30pm & 7.30pm 2,8,9,16,23 & 30 NOV 2025 | 10AM-2PM OCT - NOV, 2025 | Thursdays 21 NOV, 2025 | 12 - 5pm 18 NOV, 2025 | 7PM 29 NOV, 2025 | 1.30 - 3.30pm 18 - 22 NOV, 2025 | 6.30pm Taimoana | Coastlines explores the art of Aotearoa New Zealand, locating it within Te Moana-nui-a-Kiwa, the wider Pacific... | form.antibot * :not(.antibot-message) { display: none !important; } try{Typekit.load({ async: true, active: function() { var event = new CustomEvent(\"typekitActive\", {}); document.dispatchEvent(event); } });}catch(e){} Events | Heart of the City Skip to main content Back to top anchor Heart of the City Open main menu Close main menu Main menu Events Dining Bars & Nightlife Shopping Parking & Transport Things to do More Main menu (Mobile) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping Open search Close search Favourites Follow us on Facebook Follow us on Twitter Follow us on Instagram Search the city Search Trending: The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Main menu (Mega) Events Today Tomorrow This Week This Weekend What's On This Month Food & Drink Events Festivals Theatre Exhibitions Music Events Dining Breakfast Lunch Dinner Dessert Cafés Cheap Eats Chinese Korean Japanese Vegan & Vegetarian Bars & Nightlife Bars Open Air Bars Happy Hour Pubs Clubs Live Music Shopping Womens Fashion Menswear Streetwear Shoes Kids Health & Wellbeing Yoga studios Pilates Studios Nail Bars Hair Salons Gyms Arts & Culture Galleries & Museums Music Public Art Activities Entertainment Activities Getting Active Free Things To Do Parking & Transport Buses Ferries Trains Parking Precincts Britomart Aotea Arts Quarter Federal & Elliott Street Fort Street Area Queen Street Viaduct & Waterfront Wynyard Quarter City Works Depot High Street District Victoria Park Neighbourhoods Commercial Bay Albert Street Area Elliott Street Federal Street Lorne Street Silo Park & North Wharf The Viaduct Chancery Square Vulcan Lane Visit New In The City The Transforming City City Centre Map Hotels Special Offers Activities Attractions Bars and nightlife Dining Health and wellbeing Shopping #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_xsmall_/public/2025-01/VWPhoto-1-125.jpg'); } @media all and (min-width: 480px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_5_x_3_small_/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 768px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_medium/public/2025-01/VWPhoto-1-125.jpg'); } } @media all and (min-width: 992px) { #responsive-background-event-search-15815 { background-image: url('/sites/default/files/styles/ratio_3_x_1_large/public/2025-01/VWPhoto-1-125.jpg'); } } Event search 2025 -Any- Today Tomorrow This weekend Next 7 Days Next 30 days -Any- Food and Drink Events Sports Events Theatre Exhibitions Music Events Festivals Go Submit an event Find out more Previous Next Events Stuck in a rut and not sure what to do in Auckland? Fear not – the city centre is your one-stop-shop for all things fun and fabulous! With a jam-packed calendar of events, there's always something happening that's bound to tickle your fancy. Browse our list of current and upcoming events, grab your friends, and get ready to paint the town red! What's On This Week 18 NOV, 2025 | 7pm Doja Cat GRAMMY-winning global icon Doja Cat sets to make her highly anticipated New Zealand debut as part of the electrifying Ma Vie ... Add to favourites 18 - 20 NOV, 2025 Metallica M72 Pop-Up Shop Calling all Metallica fans— The M72 Pop-Up Shop at Brad's Warehouse unleashes exclusive merch and electrifying energy for die... Add to favourites 8 NOV, 2025-15 MAR, 2026 Pop to Present: American Art from the Virginia Museum of Fine Arts A major cultural event for Aotearoa, this special exhibition celebrates and amplifies the plural artistic voices of the... Add to favourites 22 NOV, 2025 | 7.30 - 8.15PM The Giant Christmas Tree Is Lighting Up! Join the festive fun as Auckland’s favourite Christmas tradition kicks off with the annual tree-lighting event, featuring... Add to favourites Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites Previous Next The beat drops here 22 & 23 NOV, 2025 | 6pm TOOL Grammy Award-winning juggernauts TOOL makes their long-awaited return to New Zealand at Spark Arena on 22 & 23 November 2025... Add to favourites 22 NOV 2025 Jessie Murph Breakout vocal powerhouse Jessie Murph is going global. Add to favourites 23 NOV, 2025 | 3.30pm & 7.30pm Avatar: The Last Airbender in Concert Celebrate 20 years of Avatar: The Last Airbender through its unforgettable characters, and the epic journey that defined a... Add to favourites 23 & 24 NOV 2025 Pixies Pixies have announced a 2025 New Zealand tour which will see the alt-rock legends perform two consecutive nights at Auckland... Add to favourites 25 NOV 2025 Clap Your Hands Say Yeah Iconic indie rock act Clap Your Hands Say Yeah will be playing at The Tuning Fork as part of their 2025 World Tour Add to favourites 26 NOV 2025 | 7PM Ben Ottewell & Ian Ball By Request Tour Ben Ottewell and Ian Ball, founding members of the legendary band Gomez, are bringing their very special By Request tour to... Add to favourites Previous Next See more music events Fun for the kids 15 NOV - 24 DEC, 2025 Santa's Magical Wonderland Step into a world of enchantment where twinkling lights, playful characters, and interactive activities - Santa’s Magical... Add to favourites 23 NOV 2025 | 1-4PM Pudding mit Gabel The viral German trend \"Pudding mit Gabel\" has come to Auckland. Add to favourites 2,8,9,16,23 & 30 NOV 2025 | 10AM-2PM Make Days: Ika pepa (paper fish) Drop into the Maritime Museum on selected dates and take home a free, whānau-friendly craft. Add to favourites 28 - 30 NOV, 2025 The Wizard of Oz The National Youth Theatre Company presents The Wizard of Oz , an enchanting musical drawn from the all-time classic MGM... Add to favourites Previous Next Come hungry, leave happy OCT - NOV, 2025 | Thursdays Late Night Bites Every Thursday this November, Late Night Bites brings curated eats, cocktails, and desserts from top spots across Britomart... Add to favourites 22 NOV 2025 | 11.30AM-1.30PM Bubbles and BLUSH Step into an enchanting afternoon where petals meet bubbles and creativity blooms. Add to favourites Bar Albert 1 NOV - 30 DEC 2025 Louis Roederer Champagne x Bar Albert Your choice of Caviar served three ways $25, Caviar & Champagne experience $55, Cocktail special: French 75 $26 or Caviar Mozzarella & Co. 10 NOV - 14 DEC 2025 Mozzarella & Co x Sawmill Brewery Beer and Cheese Board $45: Choose two Sawmill Brews with a matched tasting cheese board or Beer and Cheese Pairing Menu: $18 NOV - DEC, 2025 Festive Dining at SkyCity Make SkyCity Auckland your festive tradition this Christmas. Add to favourites 21 NOV, 2025 | 12 - 5pm Movember Fundraiser with Sporting Legends This November, join Sweat Shop Brew Kitchen for an unforgettable Movember event featuring some of sport's biggest stars! Add to favourites 26 NOV 2025 | 5.30-7.30PM Winemaker in Residence - Lawson’s Dry Hills Taster Join Chief winemaker Marcus Wright and kingi’s head chef Stefania Palermo for a casual, free-flowing tasting in the kingi... Add to favourites 1 OCT - 30 NOV, 2025 SkyCity presents Served SkyCity Auckland is celebrating their award-winning eateries and chefs with Served! G et ready to embark on a round-the-world... Add to favourites Previous Next See more dining Get inspired 18 NOV, 2025 | 7PM Night in the Wharenui Step inside the wharenui and be transported on a vibrant cultural journey. Add to favourites 19 NOV 2025 | 5-8PM From Hawai’i to Aotearoa: He Hui Moana Enjoy a special evening in partnership with Te Toki Voyaging Trust, Nā Kālai Wa'a and Kānehūnāmoku Voyaging Academy. Add to favourites 22 & 23 NOV 2025 | 11AM-3PM Stitching Anew Join Prairie Hatchard-McGill in crafting a fabric collage, inspired by Louise Bourgeois’s work with textiles and her efforts... Add to favourites 22 NOV 2025 | 1-4PM Wood carving workshop with Chevron Hassett Add to favourites 21 & 22 NOV 2025 | 11AM-2PM Wisdom from the Waʻa | Hawaiian Cultural Experience Join Hawaiian elder Kumu Sabra Kauka and navigator Kapena Steve Solystik of the Keiki Waʻa Project for a unique family... Add to favourites 29 NOV, 2025 | 1.30 - 3.30pm Beyond the Frame: Black Abstraction and the Politics of Joy This special conversation brings together three dynamic Black artists and scholars — Elizabeth Freeman, Kainee Simone, and... Add to favourites 29 NOV 2025 | 2-4PM Oceania: Journey to the Centre Join in a special screening of OCEANIA, co-written and produced by Tekinati Ruta, who will be travelling from Kiribati to... Add to favourites Previous Next More to do 18 - 22 NOV, 2025 | 6.30pm Femmes and Thems Comedy 5 nights, 5 different shows, all women, all gender-nonconforming performers from across Aotearoa. Add to favourites 21 NOV, 2025 Black Grace Black Grace marks its 30th anniversary with a powerful double bill uniting the past, present, and future of dance. Add to favourites 22 NOV 2025 | 8PM John Bishop - 25 Years of Stand Up Comedy superstar John Bishop is set to return to Auckland with his new show John Bishop: 25, to celebrate his incredible 25... Add to favourites 22 - 29 NOV, 2025 Po' Boys and Oysters A bold new play by Estelle Chout, directed by Dione Joseph, Po’ Boys & Oysters centres Black queer women in Aotearoa with... Add to favourites 13 NOV - 6 DEC, 2025 D.R.A.G (Dressed Resembling a God) Welcome to Lady T's - a world teeming with fabulous, wild and outrageous creatures where three drag superstars are ready to... Add to favourites Previous Next Mark Your Calendar Events What's on this month Check out the latest events and find out what's on and what's happening in Auckland this month. FRI, SAT & SUN Weekends In The City Centre Maximise your weekend with pop-up markets, live music, free events, family fun and more happening throughout our city centre... Add to favourites Did Someone Say Free? Third Thursday of Every Month Midtown Street Party Celebrate the vibrant and unique heart of Auckland at a Midtown Street Party on the third Thursday of every month. Add to favourites SATURDAYS, 4PM-12AM AND SUNDAYS, 4PM-11PM Silo Park Night Markets Visit the Auckland Night Markets at North Wharf in Wynyard Quarter. Bring the family, bring your friends and bring your... Add to favourites FRIDAYS 12pm-1pm Lunchtime Drop-in Drawing Connect with your choice of art in this BYO drawing encounter, every Friday lunchtime. Add to favourites ONGOING Blue Water Black Magic Explore this extraordinary story of innovative design, meticulous teamwork, outstanding leadership and international success... Add to favourites Saturdays, 8am - 2pm Britomart Saturday Market The weekly Britomart Saturday Market returns every Saturday to Takutai Square. Add to favourites Previous Next Events 121 Results Featured Date Just Announced Search TUESDAYS, 6.30PM Norma Taps Trivia Night Get ready to exercise your grey matter every Tuesday at Norma Taps! Add to favourites 13 Dec 2025 - 14 Dec 2025 Christmas Sailing with Mrs Claus Join Mrs Claus for a special Christmas sailing aboard Ted Ashby and take home a commemorative photo snapped by an elf! Add to favourites SEP 2023 - AUG 2026 Thread of Time: Travel, Trade & Textiles Threads of Time: Travel, Trade & Textiles is a jewel-box display that offers a survey of European art from the 15th to the... Add to favourites 9 FEB, 2024 - 1 FEB, 2026 The Robertson Gift: Paths through Modernity This exhibition celebrates the monumental gift of significant artworks from the collection of New York philanthropists Julian... Add to favourites ONGOING Taimoana | Coastlines: Art in Aotearoa Taimoana | Coastlines explores the art of Aotearoa New Zealand, locating it within Te Moana-nui-a-Kiwa, the wider Pacific... Add to favourites WEDNESDAYS TO SATURDAYS | FROM 9PM Live music at Father Ted's Enjoy live music at this inner-city Irish bar every Wednesday to Saturday from 9pm. Add to favourites DAILY Daily hands-on workshops at Wētā Workshop Unleashed Wētā Workshop Unleashed's hands-on creative workshops are available every day at 12:50pm where you can ignite your... Add to favourites 4 DEC 2025 | 6.30PM What the Quiz is This?! – New Quiz, Who Dis? Come get quizzical at The Basement Theatre with Nomi Cohen's latest musical quiz offering. Add to favourites 2025 Auckland Theatre Company's 2025 Programme Auckland Theatre Company have announced their 2025 Season featuring a captivating range of ideas and voices coming to... Add to favourites Load more Clear All Today Tomorrow This weekend Next 7 Days Next 30 days Event date From To Search Event type Exhibitions Festivals Food and Drink Events Music Events Sports Events Theatre Price $ $$ $$$ Free Today's Top Reads The Giant Christmas Tree Is Lighting Up! Te Ao Pūtahi Festival Te Manaaki, Auckland's Giant Christmas Tree Bubbles and BLUSH Santa's Magical Wonderland Editor's Picks What's on this weekend? Free things to do in Auckland City Centre 10 cheap eats under $10 Upcoming concerts Events Auckland Arts Festival Jimmy Carr The Civic Tours Food Truck Wednesdays at Britomart Bill Bryson Show more Explore Dining Bars & Nightlife Shopping Arts & Culture Parking & Transport More menu anchor Back to top Search the city Search Heart of the City Sign up to our Newsletter My favourites Never miss a thing You must have JavaScript enabled to use this form. First Name Surname Email Interests Dining Bars & Nightlife Events Arts & Culture Shopping Offers Activities & Attractions Subscribe Leave this field blank Download on the App store Download on Google Play Submit an event Visit our business members site About Contact T&Cs Sitemap Follow us on Facebook Follow us on Instagram © 2012 - 2025 Heart of the City. All rights reserved. {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"auckland-events\\/this-month\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"ajaxPageState\":{\"libraries\":\"antibot\\/antibot.form,better_exposed_filters\\/general,blazy\\/bio.ajax,blazy\\/blazy,blazy\\/classlist,blazy\\/load,blazy\\/loading,blazy\\/polyfill,blazy\\/promise,blazy\\/raf,blazy\\/webp,chosen\\/drupal.chosen,chosen_lib\\/chosen.css,core\\/drupal.ajax,core\\/drupal.date,core\\/internal.jquery.form,core\\/picturefill,crazyegg\\/crazyegg,facets\\/drupal.facets.link-widget,facets\\/drupal.facets.views-ajax,flag\\/flag.link,flag\\/flag.link_ajax,hotc\\/cs-select-slide,hotc\\/global,hotc\\/scottjehl.Respond,hotc\\/twbs.bootstrap,hotc_search\\/bef,hotc_search\\/facet_accordions,hotc_search\\/filters,hotc_search_banner\\/event-search,paragraphs\\/drupal.paragraphs.unpublished,slick\\/slick.css,slick\\/slick.load,slick\\/slick.main.classic,slick\\/slick.main.default,slick\\/slick.theme,system\\/base,views\\/views.ajax,views\\/views.module,views_infinite_scroll\\/views-infinite-scroll,webform\\/webform.ajax,webform\\/webform.composite,webform\\/webform.element.checkboxes,webform\\/webform.element.details.save,webform\\/webform.element.details.toggle,webform\\/webform.element.message,webform\\/webform.element.options,webform\\/webform.form,webform_bootstrap\\/webform_bootstrap\",\"theme\":\"hotc\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true,\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2025-02-28\\u0026field_event_date%5Bmax%5D=2025-03-30\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\":true,\"\\/search\":true,\"\\/event\\/search\\/all\\/all\":true},\"bootstrap\":{\"forms_has_error_value_toggle\":1},\"responsive\":{\"breakpoints\":{\"hotc.xsmall\":\"all and (min-width: 480px)\",\"hotc.small\":\"all and (min-width: 768px)\",\"hotc.medium\":\"all and (min-width: 992px)\",\"hotc.large\":\"all and (min-width: 1200px)\",\"hotc.xlarge\":\"all and (min-width: 1260px)\",\"hotc.mega\":\"all and (min-width: 1360px)\",\"hotc.xmega\":\"all and (min-width: 1760px)\"}},\"antibot\":{\"forms\":{\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\":{\"id\":\"webform-submission-newsletter-sign-up-form-hubspot-taxonomy-term-85-add-form\",\"key\":\"-5B9_WoTB8cZUWRkhRxSZq8C6eczMASxb00M1V29ooA\"}}},\"ajax\":{\"edit-actions-submit\":{\"callback\":\"::submitAjaxForm\",\"event\":\"click\",\"effect\":\"none\",\"speed\":500,\"progress\":{\"type\":\"throbber\",\"message\":\"\"},\"disable-refocus\":true,\"url\":\"\\/auckland-events\\/this-month?field_event_date%5Bmin%5D=2025-02-28\\u0026field_event_date%5Bmax%5D=2025-03-30\\u0026sort_by=field_featured\\u0026page=1\\u0026ajax_form=1\",\"dialogType\":\"ajax\",\"submit\":{\"_triggering_element_name\":\"op\",\"_triggering_element_value\":\"Subscribe\"}}},\"hotc_search\":{\"event_listings\":{\"validViewsIdentifiers\":{\"3a77ea55f7e9dfd1b3c61953cd6a069e34ea2ac4a5e5bd3be90de953f234c32d\":[\"field_event_date\"]},\"routeName\":\"event_85.date_range\",\"eventHref\":\"\\/auckland-events\\/this-month\",\"termTid\":\"86\",\"futureDate\":\"2026-11-18\"}},\"views\":{\"ajax_path\":\"\\/views\\/ajax\",\"ajaxViews\":{\"views_dom_id:3a77ea55f7e9dfd1b3c61953cd6a069e34ea2ac4a5e5bd3be90de953f234c32d\":{\"view_name\":\"sector_sitewide_search\",\"view_display_id\":\"page_4\",\"view_args\":\"85\\/[2025-11-18T00:00:00 TO 2025-12-18T00:00:00]\",\"view_path\":\"\\/auckland-events\\/this-month\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"view_dom_id\":\"3a77ea55f7e9dfd1b3c61953cd6a069e34ea2ac4a5e5bd3be90de953f234c32d\",\"pager_element\":0}}},\"field_group\":{\"html_element\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"classes\":\"promotion__wrapper\",\"id\":\"\",\"element\":\"div\",\"show_label\":false,\"label_element\":\"h3\",\"attributes\":\"\",\"effect\":\"none\",\"speed\":\"fast\",\"target\":\"entity\",\"custom_uri\":\"\",\"target_attribute\":\"default\",\"label\":\"Promotion wrapper\"}},\"link\":{\"mode\":\"hero\",\"context\":\"view\",\"settings\":{\"label\":\"Media\",\"classes\":\"promotion__link\",\"id\":\"\",\"target\":\"field_promotion_link\",\"custom_uri\":\"\",\"target_attribute\":\"default\"}}},\"blazy\":{\"loadInvisible\":false,\"offset\":100,\"saveViewportOffsetDelay\":50,\"validateDelay\":25,\"container\":\"\",\"loader\":true,\"unblazy\":null},\"blazyIo\":{\"disconnect\":false,\"rootMargin\":\"0px\",\"threshold\":[0,0.25,0.5,0.75,1]},\"slick\":{\"accessibility\":true,\"adaptiveHeight\":false,\"autoplay\":false,\"pauseOnHover\":true,\"pauseOnDotsHover\":false,\"pauseOnFocus\":true,\"autoplaySpeed\":3000,\"arrows\":true,\"downArrow\":false,\"downArrowTarget\":\"\",\"downArrowOffset\":0,\"centerMode\":false,\"centerPadding\":\"50px\",\"dots\":false,\"dotsClass\":\"slick-dots\",\"draggable\":true,\"fade\":false,\"focusOnSelect\":false,\"infinite\":true,\"initialSlide\":0,\"lazyLoad\":\"ondemand\",\"mouseWheel\":false,\"randomize\":false,\"rtl\":false,\"rows\":1,\"slidesPerRow\":1,\"slide\":\"\",\"slidesToShow\":1,\"slidesToScroll\":1,\"speed\":500,\"swipe\":true,\"swipeToSlide\":false,\"edgeFriction\":0.35,\"touchMove\":true,\"touchThreshold\":5,\"useCSS\":true,\"cssEase\":\"ease\",\"cssEaseBezier\":\"\",\"cssEaseOverride\":\"\",\"useTransform\":true,\"easing\":\"linear\",\"variableWidth\":false,\"vertical\":false,\"verticalSwiping\":false,\"waitForAnimate\":true},\"chosen\":{\"selector\":\"\",\"minimum_single\":20,\"minimum_multiple\":20,\"minimum_width\":200,\"use_relative_width\":false,\"options\":{\"disable_search\":false,\"disable_search_threshold\":0,\"allow_single_deselect\":false,\"search_contains\":false,\"placeholder_text_multiple\":\"Choose some options\",\"placeholder_text_single\":\"Choose an option\",\"no_results_text\":\"No results match\",\"max_shown_results\":null,\"inherit_select_classes\":true}},\"facets_views_ajax\":{\"price_event\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"},\"event_type\":{\"view_id\":\"sector_sitewide_search\",\"current_display_id\":\"page_4\",\"view_base_path\":\"event\\/search\\/%\\/%\",\"ajax_path\":\"\\/views\\/ajax\"}},\"user\":{\"uid\":0,\"permissionsHash\":\"e261f3b2c7935edb23294afa0cb38c0d6b8a74aa21d734e75c2b3a2180b6aeb7\"}} | Events"}
