
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/a-christmas-carol-by-charles-dickens", "title": null, "description": "Adapted by Shake & Stir Theatre Co. View times This December, the – ’ l – arrives at The Civic to lift your spirits. Brimful of song, humour, love, and lashings of festive joy, is a magical, grand-in-scale production – . It’s Christmas Eve, and Ebenezer Scrooge is counting down the seconds until the silliness of the season passes. Deeply entrenched in his own misery, Scrooge receives a visit from four ghosts who whisk him away on a journey through Christmases past, present and future. Here, he revisits fragments of his life and is faced with a number of choices. Redemption is his for the taking – but is Old Scrooge capable of changing his ways before it’s too late? The Shake & Stir Theatre Co adaptation of has become a much-anticipated annual tradition in Brisbane. Since its premiere in 2018, this heart-warming story has captivated the hearts of over 127,000 people over seven return seasons. Shake & Stir Theatre Co’s Artistic Director, says: “its sentiment resonates more profoundly than ever, reminding us of the enduring themes of love, forgiveness, and generosity that make the holiday season truly magical.” Complete with , , , and, of course, , , is quite simply (The Courier-Mail). Te wāhi He tīwhiri mō te rohe Head to Stark’s Café and Bar for a pre-show cocktail, beer or wine. It opens 90 minutes before any show or event at The Civic. Te huarahi ki reira By car, head to The Civic car park near Queen Street where you’ll find plenty of affordable paid parking. By train, head to Britomart Station and walk up Queen Street for around 10 minutes to reach The Civic. Alternatively, take a bus to the Queen Street or Wellesley Street bus stops, which are both within a short walking distance.", "dates": {"start": "2025-12-07", "end": null, "text": "02 - 07 Dec, 2025"}, "price": "$30.00 - $250.00", "location": "The Civic", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Eat & Drink", "Bars, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_133.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:31Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/conan-gray-wishbone-world-tour", "title": null, "description": "Following the unforgettable Wishbone Pajama Show tour, Conan Gray is once again hitting the road. View times After selling out legendary rooms like Madison Square Garden, the Kia Forum, and Wembley Arena, he’s bringing the Wishbone World Tour to fans around the globe in celebration of his fourth studio album, Wishbone. The announcement follows Conan’s record-breaking year with Wishbone, which debuted at #1 on Billboard’s Album Sales chart and Top 3 on the Billboard 200, marking the highest charting debut and biggest sales week of his career. Te wāhi He tīwhiri mō te rohe Taxis and rideshares can be hard to come by directly after an event. If not using public transport, book your ride in advance and choose a pickup spot a few blocks away from the arena. Te huarahi ki reira Spark Arena is 10-15 minutes by foot to the city centre and Waitematā&nbsp;Station, which is on all major bus routes.", "dates": {"start": "2026-09-26", "end": null, "text": "26 Sep 2026"}, "price": "$99.00 - $554.00", "location": "Spark Arena", "categories": ["Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Music", "Live concert", "Stay", "Hotel", "Stay", "Apartments, Hotel", "Stay", "Apartments, Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars, Cocktail Bars, Restaurants", "Eat & Drink", "Bars, Restaurants", "See & Do", "Sightseeing", "See & Do", "See & Do", "Tours", "See & Do", "Spa & Wellness", "See & Do", "Leisure & Entertainment", "See & Do", "Nature & Wildlife"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/8202a9fe-de0b-4b27-a882-fd4acbef3221_source.jpg?ext=.jpg&crop=276,0,1873,1365", "updated_at": "2025-11-29T03:56:31Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/juliet", "title": null, "description": "Get ready, New Zealand! In 2026, is coming to Auckland for the first time ever – and it’s going to be unforgettable! View times This flips the script on the world’s greatest love story and asks: Get whisked away on a fabulous journey as she ditches her famous ending for a fresh beginning and a second chance at life and love—her way. Packed that you know and adore, is a of love, self-discovery, and second chances. Featuring hits like “ ”, “ , “ ”, “ ”, “ ”, “ ”, and more. Trust us, this is the must-see event of the year – stay tuned for more details coming later this year. Te wāhi He tīwhiri mō te rohe Head to Stark’s Café and Bar for a pre-show cocktail, beer or wine. It opens 90 minutes before any show or event at The Civic. Te huarahi ki reira By car, head to The Civic car park near Queen Street where you’ll find plenty of affordable paid parking. By train, head to Britomart Station and walk up Queen Street for around 10 minutes to reach The Civic. Alternatively, take a bus to the Queen Street or Wellesley Street bus stops, which are both within a short walking distance.", "dates": {"start": "2026-04-26", "end": null, "text": "09 - 26 Apr, 2026"}, "price": "$78.00 - $250.00", "location": "The Civic", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Eat & Drink", "Bars, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/and-juliet-1133x628-auckland-live.jpg?ext=.jpg&crop=136,0,862,628", "updated_at": "2025-11-29T03:56:31Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/laneway-festival-2026", "title": null, "description": "Laneway Festival is back at Western Springs Stadium View times This summer, the beloved tastemaker festival celebrates its 21st birthday with a refreshed route across six Trans-Tasman cities — with Laneway Festival NZ once again leading the tour. In Aotearoa, Laneway Festival Tāmaki Makaurau will take place on Thursday 5 February at Western Springs, shifting to the day before Waitangi Day for the very first time. That means fans can start their long weekend at Laneway, kicking things off with some of the most exciting new music from around the world before the tour heads across the Tasman to five Australian cities. Laneway Festival co-founders Danny Rogers and Jerome Borazio say, “It’s incredible to be celebrating 21 years of Laneway. What began as a little street party in a Melbourne laneway has grown into a summer ritual across Australia and New Zealand. Auckland has been such an important part of that story, and every year we’re blown away by the response from the artists, fans and community that make Laneway so special — 2026 is about honouring that history while looking to the future.” Te wāhi He tīwhiri mō te rohe Being an outdoor venue, it pays to pack a layer (or two) and check the forecast for signs of wet weather ahead. Te huarahi ki reira Western Springs Stadium is a 10-25-minute drive from the city centre and accessible by bus and train. Most large events have special buses and trains included in the ticket price. He pārongo atu anō", "dates": {"start": "2026-02-05", "end": null, "text": "05 Feb 2026"}, "price": null, "location": "Western Springs Stadium", "categories": ["Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Music", "Live concert", "Stay", "Hotel", "Stay", "Holiday Homes", "Stay", "Hotel", "Stay", "Holiday Homes, Hotel", "Stay", "Glamping", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Bars", "See & Do", "Spa & Wellness", "See & Do", "Spa & Wellness", "See & Do", "See & Do", "Tours", "See & Do", "Nature & Wildlife", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/sfx98554.png?ext=.png&crop=0,0,714,520", "updated_at": "2025-11-29T03:56:31Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/pop-to-present-american-art-from-the-virginia-museum-of-fine-arts", "title": null, "description": "celebrates and amplifies the plural artistic voices of the United States. Opening with an iconic 1948 drip painting by Jackson Pollock and closing with a poignant sculptural assemblage by the Alabama-based artist Thornton Dial, this landmark presentation of 52 compelling works from the world-renowned Virginia Museum of Fine Arts offers a comprehensive overview of the principal themes and styles shaping American art since 1945. A major cultural event for Aotearoa New Zealand, this special exhibition includes high-quality examples of Abstract Expressionism, Pop and Minimalism along with richly textured paintings by Pattern and Decoration artists, hyper-detailed canvases by 1970s Photorealists, and contemporary figurative pieces that explore questions of identity, power and representation. Showcasing 28 works by women and African American and Indigenous artists, places well-known names in conversation with figures from diverse backgrounds to provide a more inclusive account of recent American art. Artists featured in this broad and nuanced survey include Benny Andrews, Rosalyn Drexler, Elaine de Kooning, Willem de Kooning, Helen Frankenthaler, Sam Gilliam, Philip Guston, Barkley L. Hendricks, Norman Lewis, Roy Lichtenstein, Virgil Ortiz, Howardena Pindell, Martin Puryear, Jaune Quick-to-See Smith, Mark Rothko, Kiki Smith, Clyfford Still, Cy Twombly, Andy Warhol and Jack Whitten. is organised by the Virginia Museum of Fine Arts in Richmond, Virginia. It is curated by Alexis Assam, Regina A. Perrry Assistant Curator of Modern and Contemporary Art, and Dr. Sarah G. Powers, Exhibition Curator. Kenneth Brummel, Curator of International Art, is the co-ordinating curator at Auckland Art Gallery Toi o Tāmaki. The exhibition is presented in association with Te Ahurei Toi o Tāmaki Auckland Arts Festival 2026, and proudly supported by Auckland Art Gallery Foundation, Omnigraphics, Rova and Stuff. : Roy Lichtenstein, ‘Gullscape’ (installation view) (detail), 1964, Virginia Museum of Fine Arts, Gift of Sydney and Frances Lewis, 85.418 © Estate of Roy Lichtenstein/Copyright Agency, 2025. Te wāhi Auckland Art Gallery Toi o Tāmaki He tīwhiri mō te rohe Recharge with a refreshing bite in the café or visit the shop for exquisite gifts crafted by local makers. Te huarahi ki reira There is plenty of paid parking nearby or it’s a 15 min walk from Britomart station. There’s also a free tour in English tour every Tues, Weds, and Fridays at 1.30pm. He pārongo atu anō Adults (New Zealanders) $29.50 Adults (International tourists) $34.50 Members – FREE Seniors and Community Card holders $25.50 Students (with Student ID) $25.50 Children 12 and under FREE Please note, all children 14 and under must be accompanied by an adult. Tickets are now on sale and are available for purchase online and onsite from the Gallery’s information desk on our Ground level. Please note, we’re operating a timed-entry system for this exhibition with entry available every 15 minutes. Your ticket gives you entry to the exhibition once and you may arrive up to 5 minutes after the time you have selected. Entry after this time will be at the Gallery’s discretion. There is no limit to the length of time you spend in the exhibition. The Gallery closes at 5pm daily. If needed, you can change the date or time of your booking for free using the link sent with your online ticket purchase. Alternatively, you can call our Gallery team for assistance on +64 9 307 7700. If you have pre-booked your ticket online, you can head straight to the exhibition on Level 1 to validate your ticket for entry. Prices include GST. Online credit card fees are additional to the admission price. There is no entry charge for children aged 12 or under, however you will need to select a free child ticket type when booking in advance online. Please note all children aged 14 or under must be accompanied by an adult. Auckland Art Gallery Members go free. To guarantee entry at your preferred time, please book a free Member ticket online in advance. Alternatively, present your membership card at our information desk on the day of your visit and you will be issued a ticket to the exhibition as soon as possible. Members have priority but please note that there might be a wait time when the exhibition is at capacity. Join us as a Member on the same day as your visit to and we’ll refund the price of your exhibition ticket. Members receive a range of benefits, including free unlimited entry to paid exhibitions, invitations to Members-only events, access to the Members lounge, and discounts in our shop and café. Ask us for more information while on your visit to the exhibition.", "dates": {"start": null, "end": null, "text": "Artwork credit: Roy Lichtenstein"}, "price": null, "location": "Exhibitions", "categories": ["Exhibitions", "Exhibitions", "Exhibitions", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Apartments", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/events/exhibitions/pop-to-present/pop-to-present-2025.jpg?ext=.jpg&crop=163,0,1757,1280", "updated_at": "2025-11-29T03:56:32Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/rufus-du-sol-inhale-exhale-word-tour", "title": null, "description": "GRAMMY AWARD winning Australia electronic three-piece RÜFÜS DU SOL will bring their genre defining live show to Aotearoa in 2025. View times The global stars are riding high on the success of their fifth album Inhale / Exhale, released On October 11th. The shows will feature a carefully curated mix of new tracks alongside fan favorites, accompanied by their world renowned immersive lighting and stage production. Their recent headline live set at San Francisco’s Portola Festival and intimate performance on the Sydney Harbour offered fans a first glimpse of their new material in a live setting, while recent DJ sets at Coachella’s Quasar stage and Burning Man tuned fans into the curation and unexpected references that retain their connection to clubland. This tour marks the band’s return to their roots, where their journey began, and provides fans down under the opportunity to experience their groundbreaking new album live. The shows will feature a carefully curated mix of new tracks like “Music is Better,” “Lately,” and “Pressure,” alongside fan favorites, all set against a backdrop of their signature immersive stage design. “Returning to Australia and New Zealand is always a special feeling for us. This is where it all began, and there’s no better place to share tracks off Inhale / Exhale. We can’t wait to explore this next chapter with everyone back home and reconnect with the energy that first inspired us,” said RÜFÜS DU SOL. Te wāhi The Outer Fields at Western Springs He pārongo atu anō", "dates": {"start": "2025-11-29", "end": null, "text": "29 Nov 2025"}, "price": "$160.82 each", "location": "The Outer Fields at Western Springs", "categories": ["Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Music", "Live concert", "Stay", "Hotel", "Stay", "Holiday Homes", "Stay", "Holiday Homes, Hotel", "Stay", "Hotel", "Stay", "Glamping", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Bars", "See & Do", "See & Do", "Tours", "See & Do", "Nature & Wildlife", "See & Do", "Spa & Wellness", "See & Do", "Spa & Wellness", "See & Do", "Golf"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/8eb76b2b-7f04-4294-9463-bf8b3610eedd.jpg?ext=.jpg&crop=295,0,1482,1080", "updated_at": "2025-11-29T03:56:32Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/taylor-a-tribute-to-the-eras-of-taylor-swift", "title": null, "description": "Calling all Swifties View times make a ‘sweet escape’ to the world of Taylor Swift with ! Showtime presents Josette with international band and dancers in this joyous, effervescent concert experience, complete with sparkly costumes, cosmic stage production and over 20 exquisite renditions of Taylor’s biggest hits from every era of her career, including and more. Join us for a fun night of singing, dancing and celebrating Taylor together! Don’t miss your chance to relive the greatest Pop concert tour in history and revel in all things ‘Taylor’… BOOK NOW! Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving. He pārongo atu anō", "dates": {"start": "2025-11-08", "end": "2025-12-06", "text": "08 Nov - 06 Dec, 2025"}, "price": "$49.00 - $69.00", "location": "Aotea Centre", "categories": ["Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Music", "Live concert", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_15.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:32Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/the-nutcracker-2025", "title": null, "description": "Summer 2025 will be celebrated with an eagerly anticipated new production of the world’s most beloved ballet classic, The Nutcracker. View times Central to Christmas memories for generations of audiences, is a timeless celebration of family, fantasy and growing up, where ‘home for Christmas’ is the most powerful magic of all. A uniquely Kiwi touch transports our audiences to the nostalgia of childhood holidays at the beach in Act I, before being carried in Act II to the snowy Southern Alps, where we encounter a fairytale Kingdom of the Sweets – some of which may look quite familiar… This new production will be created by RNZB Artistic Director Ty King-Wall, with a formidable team of creatives who will bring this magical production to life. Live orchestra will accompany performances at the Aotea Centre. Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving. He pārongo atu anō", "dates": {"start": "2025-12-13", "end": null, "text": "04 - 13 Dec, 2025"}, "price": "$40.00 - $180.00", "location": "Aotea Centre", "categories": ["Dance", "Ballet", "Dance", "Dance", "Ballet", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original.png?ext=.png&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:33Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/the-others-way-festival", "title": null, "description": "Tāmaki Makaurau's favourite scrappy little street party once again lives to fight another day, and returns to take over and amplify the Karangahape Road precinct on Saturday November 29, 2025. View times In its eleventh year, Auckland's beloved multi-venue music festival will feature 40 acts playing at venues up and down the city's iconic Karangahape Road and its surrounds, with an undulating array of alluring international acts; Aotearoa’s freshest and finest local talent; and emerging performers for the all ages stage. Making a cherished home in music lovers' hearts since 2015, The Others Way has captured a dedicated audience of music enthusiasts and tastemakers by bringing a diverse and eclectic lineup of indie, pop, electronic, hip-hop, soul, punk, metal, folk and more. Save the date, alert your nearest and dearest, book the babysitter, and get ready for the mighty return of The Others Way on Saturday November 29, 2025. We promise this will be our biggest and most powerful offering to date. Artist announcements will be revealed in the coming weeks and months, so stay tuned for the full festival lineup and updates on The Others Way via the festival’s Facebook and Instagram. Don’t miss out—super earlybird tickets are on sale now and include buy now pay later options via Zip. Grab your tickets today and prepare for the greatest party of the year. Te wāhi Across Karangahape Road", "dates": {"start": "2025-11-29", "end": null, "text": "29 Nov 2025"}, "price": "From $45.00", "location": "Across Karangahape Road", "categories": ["Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Stay", "Apartments", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Apartments, Hotel", "Stay", "Hotel", "Stay", "Motel", "Eat & Drink", "Dessert & Ice Cream", "Eat & Drink", "Eat & Drink", "Bakeries, Breakfast & Brunch, Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Tours", "See & Do", "Spa & Wellness", "See & Do", "Cycling & Biking", "See & Do", "Spa & Wellness"], "image": "https://www.aucklandnz.com/media/media/tau/events/festival-lifestyle/others-way-festival/2025/the-others-way-2.jpg?ext=.jpg&crop=311,0,1471,1072", "updated_at": "2025-11-29T03:56:33Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/the-rocky-horror-show", "title": null, "description": "The World's Favourite Rock n' Roll Musical View times Ready to thrill you with fun and naughty moments, The longest continuous run of a contemporary musical anywhere in the world, has been and continues to delight audiences on its sell-out international tour. Everyone's invited to join Brad and Janet for an adventure they'll never forget, featuring including \" \", \" \", and of course, . Te wāhi He tīwhiri mō te rohe Head to Stark’s Café and Bar for a pre-show cocktail, beer or wine. It opens 90 minutes before any show or event at The Civic. Te huarahi ki reira By car, head to The Civic car park near Queen Street where you’ll find plenty of affordable paid parking. By train, head to Britomart Station and walk up Queen Street for around 10 minutes to reach The Civic. Alternatively, take a bus to the Queen Street or Wellesley Street bus stops, which are both within a short walking distance.", "dates": {"start": "2026-02-26", "end": "2026-03-08", "text": "26 Feb - 08 Mar, 2026"}, "price": "$62.50 - $141.00", "location": "The Civic", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Eat & Drink", "Bars, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_102.jpg?ext=.jpg&crop=419,0,1082,788", "updated_at": "2025-11-29T03:56:33Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/alan-davies", "title": null, "description": "is a critically acclaimed stand-up comedian, actor, writer, and TV personality. View times He is a staple of British television, known for his performance as the eponymous hero of David Renwick’s hugely popular, long-running TV series , and as a permanent panelist on . His talk show, , recently reached its seventh season. He is also one of the UK’s best-loved comedians. His stand-up show ran in London’s West End and and sold out in venues across the UK. His second memoir, was published in 2020 and the third instalment will be published later this year. Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving.", "dates": {"start": "2026-08-01", "end": null, "text": "01 Aug 2026"}, "price": "$81.50", "location": "Aotea Centre", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_166.jpg?ext=.jpg&crop=346,0,1054,768", "updated_at": "2025-11-29T03:56:34Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/joanne-mcnally", "title": null, "description": "Pinotphile View times After the success of her , Joanne McNally returns with her hotly anticipated new stand-up show . , McNally has been keeping herself busy by ruining men's lives (and her own) and now she's back; still single, still unfertilised, and laden with irreverent, ridiculous and hilarious war stories. Join Joanne for a wild ride as she navigates in her “terrifyingly funny” (Evening Standard) and “joyously nuts” (Irish Examiner) trademark style. She's the co-host of award-winning podcast , and with riotous appearances on , and Joanne also hosts the hugely successful BBC Sounds series and Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving.", "dates": {"start": "2026-04-17", "end": null, "text": "17 Apr 2026"}, "price": "$69.90 - $79.90", "location": "Aotea Centre", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_162.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:34Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/genuine-and-stable", "title": null, "description": "An immigrant and a New Zealander claim they are in love. Two immigration agents must decide if they are telling the truth. View times When Korean-born Sujin applies for a partnership visa with her Kiwi boyfriend Jeremy, immigration officers Laura and Charlotte are tasked with determining As they sift through evidence, photos become exhibits, memories turn into testimony, and assumptions harden into fact; what begins as a routine case quickly spirals into a web of contradictions, and Exciting new playwright brings his personal experience working in immigration to the charged arena of the stage. “ ” is - what it means to prove it, to believe it, and to risk everything for it. Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving.", "dates": {"start": "2025-12-13", "end": null, "text": "09 - 13 Dec, 2025"}, "price": "$20.00 - $38.00", "location": "Aotea Centre", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_125.png?ext=.png&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:34Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/cabaret", "title": null, "description": "The Musical at the Kit Kat Club View times The returns to Tāmaki Makaurau Auckland in a sizzling new production. Berlin, 1929. Germany stands on the edge of an abyss. In , where boys, girls and everyone in between are living each day as if it’s their last. Caught up in a hedonistic whirl of sex and booze, cabaret singer Sally Bowles is blind to the gathering storm, but even she can’t run from the darkness. With the shadow of the Third Reich looming, . Yet, behind the fading velvet curtains of a seedy nightclub, the city’s pulsing underbelly is still frantically beating back the flames. , is spectacularly remade for the stage with a dazzling cast of Aotearoa New Zealand’s . , the role made famous by Liza Minnelli in the 1972 film, with (Ngāi Tūhoe, Te Rarawa, Ngāti Porou) ( ) . , Cabaret closes the 2026 season with a glorious bang. Presenting Partner Te wāhi Te huarahi ki reira ASB Waterfront Theatre is a 17-minute walk from Waitematā&nbsp;Station and accessible by many bus routes, including the City Link route.", "dates": {"start": "2026-09-22", "end": "2026-10-18", "text": "22 Sep - 18 Oct, 2026"}, "price": null, "location": "ASB Waterfront Theatre", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Stay", "Hotel", "Stay", "Apartments", "Stay", "Apartments", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Bars, Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "See & Do", "Leisure & Entertainment", "See & Do", "Cycling & Biking, Nature & Wildlife, Water sports & activities", "See & Do", "Cycling & Biking", "See & Do", "Spa & Wellness", "See & Do", "Water sports & activities", "See & Do"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/a8fdfd5f-887e-44ac-965b-ede5bf957197_source.jpg?ext=.jpg&crop=276,0,1873,1365", "updated_at": "2025-11-29T03:56:35Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/po-boys-and-oysters", "title": null, "description": "You’re invited to dinner — but be prepared: the courses are complex, messy, and hilarious. View times Following its successful 2022 season at Basement Theatre, the bold play by Estelle Chout, directed by Dione Joseph, Set in Tāmaki Makaurau, this follows Flo and Jo, an Afro-queer couple on the brink of parenthood. As they prepare to adopt a child, they invite Flo’s religious sister Marie for dinner. What should be a celebration erupts into an emotional collision of old wounds, cultural assumptions, and love tested across family lines. Chout’s script, rich with tenderness and wit, explores identity, immigration, and faith. Chout also stars as Flo, joined by Sonya Renee Taylor (Jo) and Sandra Zvenyika (Marie). Together, the trio bring remarkable depth and dynamism. , is a vibrant portrait of chosen family, hard conversations, and the many ways love shows up at the table. Te wāhi Aotea Centre, 50 Mayoral Drive, Auckland Central He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you're driving.", "dates": {"start": "2025-11-29", "end": null, "text": "22 - 29 Nov, 2025"}, "price": "$35.00 - $45.00", "location": "Aotea Centre, 50 Mayoral Drive, Auckland Central", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Bars, Cocktail Bars", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_145.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:35Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/the-waterboys", "title": null, "description": "make their long-awaited return to Australia and New Zealand in May 2026 their first tour in over a decade! View times Critically acclaimed as one of the best live bands on the planet, the 2025 band features double keyboard players Brother from Memphis and from Cornwall and is grounded by killer Irish rhythm section (bass) and (drums). will be performing tracks from their audacious new album, : a bold, cinematic tribute to the maverick American actor and cultural icon, along with material across their storied catalogue. From the early \"big music\" of The Whole Of The Moon and classic album This Is The Sea through to the roots-inspired Fisherman's Blues era and music from their ambitious post-2015 output. comments: \" \" Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving.", "dates": {"start": "2026-05-21", "end": null, "text": "21 May 2026"}, "price": "$109.90 - $149.90", "location": "Aotea Centre", "categories": ["Music", "Live concert", "Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_130.png?ext=.png&crop=602,0,1054,768", "updated_at": "2025-11-29T03:56:35Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/deftones", "title": null, "description": "Deftones return to New Zealand in May 2026 View times Alt-rock legends confirm massive arena shows with special guests Interpol and Ecca Vandal – first NZ tour in nearly 10 years! Te wāhi He tīwhiri mō te rohe Taxis and rideshares can be hard to come by directly after an event. If not using public transport, book your ride in advance and choose a pickup spot a few blocks away from the arena. Te huarahi ki reira Spark Arena is 10-15 minutes by foot to the city centre and Waitematā&nbsp;Station, which is on all major bus routes. He pārongo atu anō", "dates": {"start": "2026-05-13", "end": null, "text": "13 May 2026"}, "price": "$179.00 - $500.00", "location": "Spark Arena", "categories": ["Music", "Live concert", "Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Stay", "Hotel", "Stay", "Apartments, Hotel", "Stay", "Apartments, Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars, Cocktail Bars, Restaurants", "Eat & Drink", "Bars, Restaurants", "See & Do", "Sightseeing", "See & Do", "See & Do", "Tours", "See & Do", "Spa & Wellness", "See & Do", "Leisure & Entertainment", "See & Do", "Nature & Wildlife"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/7365832e-e2e6-4016-8873-d58ec63968b8_source.jpg?ext=.jpg&crop=0,0,1873,1365", "updated_at": "2025-11-29T03:56:35Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/manuka-phuel-presents-synthony-festival-2026", "title": null, "description": "The Mānuka Phuel SYNTHONY Festival is Australasia’s largest one-day music festival, headlined by SYNTHONY, a breathtaking fusion of electronic dance tracks, reimagined with a full live orchestra. View times The Mānuka Phuel SYNTHONY Festival is Australasia’s largest one-day music festival, drawing a crowd of over 40,000 attendees. With two stages featuring local and international artists, multiple food and wine villages, immersive experiences, roving entertainers and amusement rides – this is New Zealand’s premier festival experience. The headline act is the global phenomenon, SYNTHONY, a breathtaking fusion of electronic dance tracks, reimagined with a full live orchestra. Te wāhi He tīwhiri mō te rohe While visiting Auckland Domain, be sure to explore the Auckland War Memorial Museum. Entry is free for Auckland residents. Te huarahi ki reira If you're driving, there is paid parking available within the park. Alternatively, you can catch a bus. There are several bus routes stop near Auckland Domain, including the InnerLink and OuterLink. He pārongo atu anō", "dates": {"start": "2026-03-21", "end": null, "text": "21 Mar 2026"}, "price": null, "location": "On Sale 14 Aug", "categories": ["Music", "Live concert", "Music", "Live concert", "Music", "Live concert", "Music", "Live concert", "Stay", "Holiday Homes", "Stay", "Apartments", "Stay", "Hotel", "Stay", "Stay", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars", "See & Do", "Tours", "See & Do", "Spa & Wellness", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Sightseeing"], "image": "https://www.aucklandnz.com/media/media/tau/events/festival-lifestyle/synthony-festival/2026/synthony-festival-2026-main-page-2.jpg?ext=.jpg&crop=0,558,1200,874", "updated_at": "2025-11-29T03:56:36Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/iggy-pop,-joan-jett-and-the-blackhearts,-zed", "title": null, "description": "Greenstone Entertainment are proud to present stop 2 of the Summer Concert Tour 2026, held at Spark Arena, Auckland, on Thursday January 29 2026 (Auckland Anniversary Weekend). View times The original ‘wild one’ of rock, IGGY POP along with the Queen of Rock JOAN JETT and THE BLACKHEARTS, and Kiwi favourites, ZED will headline the Summer Concert Tour. Considered by many the ‘Godfather of Punk’ IGGY POP is widely acknowledged as one of THE most dynamic stage performers of all time. He has built a legendary career filled with both critical acclaim and fanatic cult success. This year alone Iggy has performed numerous festival and headline dates across Europe followed by a recent North American tour, he has also just been confirmed for 2026’s Coachella Music Festival. A fearless and legendary rock front man known for his outrageous, unpredictable and physically demanding stage performance, Iggy’s recent set lists have focused on his classic material with songs like ‘T.V. Eye’, ‘Raw Power’, ‘The Passenger’, ‘Lust for Life’ and fan favourite, ‘Real Wild Child’ as well as showcasing songs from his 2023 album ‘Every Loser’. JOAN JETT grew up during a time when Rock ‘n’ Roll was off limits to girls and women, but as a teenager, she promptly blew the door to the boy’s club right off its hinges. After forming her band with the Blackhearts in 1979, she has had eight platinum and gold albums and nine Top 40 singles, including the classics ‘Bad Reputation’, ‘I Love Rock ‘n’ Roll’, ‘I Hate Myself For Loving You’, and ‘Crimson and Clover’. Described as the “Queen of Rock ‘n’ Roll” and “Godmother of Punk”, Joan Jett is celebrated for her rebellious spirit, fierce performances, and raw powerful music. Jett along with her band The Blackhearts will be coming to Aotearoa in 2026. ZED were an essential part of the soundtrack to New Zealand life between 1999 and 2004, amassing an impressive ten Top 40 hits during the height of their career. The band — still performing with their original line-up — has matured into a powerhouse live act. Fans can expect timeless favourites like ‘Renegade Fighter’, ‘Hard to Find Her’, and ‘Glorafilia’, alongside fresh new material that reaffirms their place as one of New Zealand’s most enduring rock bands Te wāhi He tīwhiri mō te rohe Taxis and rideshares can be hard to come by directly after an event. If not using public transport, book your ride in advance and choose a pickup spot a few blocks away from the arena. Te huarahi ki reira Spark Arena is 10-15 minutes by foot to the city centre and Waitematā&nbsp;Station, which is on all major bus routes.", "dates": {"start": "2026-01-29", "end": null, "text": "29 Jan 2026"}, "price": "$109.00 - $159.00", "location": "Spark Arena", "categories": ["Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Music", "Live concert", "Stay", "Hotel", "Stay", "Apartments, Hotel", "Stay", "Apartments, Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars, Cocktail Bars, Restaurants", "Eat & Drink", "Bars, Restaurants", "See & Do", "Sightseeing", "See & Do", "See & Do", "Tours", "See & Do", "Spa & Wellness", "See & Do", "Leisure & Entertainment", "See & Do", "Nature & Wildlife"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/c6b7e395-a031-434a-a669-9bf0bb6681f1.jpg?ext=.jpg&crop=107,0,1482,1080", "updated_at": "2025-11-29T03:56:36Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/eddie-izzard-the-remix-tour-live", "title": null, "description": "Eddie Izzard –The Remix is a chance for Eddie, inspired by her ever loyal audiences to remix and re-imagine some of her own favourite, personal comedy highlights. View times Eddie Izzard has been rescheduled to . Your tickets will remain valid for the new date; you do not need to do anything. To request a refund, please contact Ticketmaster before 5pm, Thu 11 Dec 2025. ------------------------- Eddie Izzard – is a chance for Eddie, inspired by her ever loyal audiences, to . Eddie's stretch from “ ” in 1993 to “ ” in 2019. Ever wondered what became of Darth Vader and Mr Stevens or the monkey in the tree, did the pears ever ripen… and will God ever appear? It’s a glorious chance to ‘maybe’ find out the answers or discover more questions to those Izzard conundrums. It’s highly likely that no night will be exactly be the same so as ever with Eddie, . “ “ - Eddie Izzard This show promises to be a . Who could resist? This show may contain strong and imaginative language. Te wāhi He tīwhiri mō te rohe Head to Stark’s Café and Bar for a pre-show cocktail, beer or wine. It opens 90 minutes before any show or event at The Civic. Te huarahi ki reira By car, head to The Civic car park near Queen Street where you’ll find plenty of affordable paid parking. By train, head to Britomart Station and walk up Queen Street for around 10 minutes to reach The Civic. Alternatively, take a bus to the Queen Street or Wellesley Street bus stops, which are both within a short walking distance.", "dates": {"start": "2026-05-20", "end": null, "text": "20 May 2026"}, "price": "$89.00 - $109.90", "location": "The Civic", "categories": ["Performing Arts", "Theatre", "Performing Arts", "Theatre", "Performing Arts", "Musical Theatre", "Performing Arts", "Comedy", "Performing Arts", "Comedy", "Performing Arts", "Musical Theatre", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Eat & Drink", "Bars, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_100.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:36Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/nga-huhua-abundance", "title": null, "description": "Dive into a deep blue world teeming with life in Ngā Huhua: Abundance, an immersive exhibition celebrating the lifeforce of Te Moana-nui-a-Toi, the outer Hauraki Gulf Marine Park, just beyond Auckland’s shores. Meet the surprising and spectacular creatures that call this place home, from tohorā (whales) to honu (turtles), and explore how this ecosystem now faces new threats. Te Moana-nui-a-Toi, an area largely unknown and rarely visited by most Aucklanders, comes alive through storytelling, ocean science, mātauranga Māori, contemporary art, and the voices of tangata whenua (Ngāti Rehua Ngātiwai ki Aotea). The exhibition reveals how both the giants and the smallest creatures play vital roles in maintaining the balance of this thriving marine world. Each year, these species gather in abundance during the seasonal upwelling of food-rich waters, a natural rhythm that has sustained life here for thousands of years. Today, that lifeforce is under pressure from climate change and human activity. Through interactives, compelling stories, and voices grounded in whakapapa, invites you to deepen your connection to the moana and feel inspired to help protect this extraordinary place. This exhibition is presented in partnership with Ngāti Rehua Ngātiwai ki Aotea, the mana whenua (customary guardians) of Aotea Great Barrier Island, whose whakapapa (ancestry) traces back to Toi, and whose people welcomed Kupe into Rangitāwhiri (Tryphena Harbour). Exhibition is FREE with museum entry Photo: R Robinson www.depth.co.nz Te wāhi Te huarahi ki reira The Museum is a short walk from the centre of town and Waitematā&nbsp;station. There are also parking buildings nearby on Pakenham St East and Market Lane. He pārongo atu anō", "dates": {"start": null, "end": null, "text": "R Robinson | depth.co.nz"}, "price": null, "location": "Exhibitions", "categories": ["Exhibitions", "Exhibitions", "Exhibitions", "Stay", "Apartments", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Bars", "Eat & Drink", "Bars", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "See & Do", "Tours", "See & Do", "Adventure & Adrenaline, Nature & Wildlife, Tours", "See & Do", "Nature & Wildlife", "See & Do", "Leisure & Entertainment", "See & Do", "Tours, Water sports & activities", "See & Do", "Golf, Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_137.jpg?ext=.jpg&crop=440,0,1040,758", "updated_at": "2025-11-29T03:56:37Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/louise-bourgeois-in-private-view", "title": null, "description": "is the first solo exhibition in Aotearoa New Zealand of Louise Bourgeois (1911–2010), one of the most intriguing and influential artists of the last century. The exhibition brings together a selection of works from an international private collection, exhibited publicly for the first time. The exhibition spans over six decades of Bourgeois’s career, from early paintings made in 1945 to a fabric work from the final year of her life. Widely celebrated for her psychologically charged and bold sculptural practice, Bourgeois explored themes of memory, family, the body and the subconscious, often drawing from personal experiences. She is best known for her series of large spider sculptures, which have been installed in many major international cities. offers an intimate encounter with Bourgeois’s work, and follows the evolution of her art practice over time. Highlights include paintings and her first series of sculptures, the , from the 1940s and early ‘50s; sculptures from the early 1960s; and significant later works, such as textile-based sculptures and sculptural enclosures. (2002) is a wall-mounted example of her internationally acclaimed series of spider sculptures, which she began in the mid-1990s. Also featured is her extraordinary hanging sculpture, , and late outdoor piece, . is proudly supported by the Contemporary Benefactors of Auckland Art Gallery. Te wāhi He tīwhiri mō te rohe Recharge with a refreshing bite in the café or visit the shop for exquisite gifts crafted by local makers. Te huarahi ki reira There is plenty of paid parking nearby or it&rsquo;s a 15 min walk from Britomart station. There&rsquo;s also a free tour in English tour every Tues, Weds, and Fridays at 1.30pm. He pārongo atu anō", "dates": {"start": "2025-09-27", "end": "2026-05-17", "text": "27 Sep 2025 - 17 May 2026"}, "price": "Free event", "location": "Auckland Art Gallery Toi o Tāmaki", "categories": ["Exhibitions", "Exhibitions", "Exhibitions", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Apartments", "Stay", "Hotel", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/events/exhibitions/louise-bourgeois-in-private-view/lb-exhibit-hero.jpg?ext=.jpg&crop=431,0,1054,768", "updated_at": "2025-11-29T03:56:37Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/artland-an-installation-by-do-ho-suh-and-children", "title": null, "description": "is a collaborative hands-on installation designed by Do Ho Suh with his young daughters. is an evolving sculptural environment created from children’s modelling clay. The installation features imaginative creatures and fantastical landscapes including Noodlegrass, Blobbugs, Spocky Trees and Slimes, and invites visitors of all ages to sculpt their own creations. The project is supported by the Joyce Fisher Charitable Trust. Image credit: , , 2016-ongoing. © Do Ho Suh. Courtesy of the artist; Lehmann Maupin, New York and Seoul; Victoria Miro. Photography by Prudence Cuming. — Te Aka Matua | The Creative Learning Centre Free Te wāhi Auckland Art Gallery He tīwhiri mō te rohe Recharge with a refreshing bite in the café or visit the shop for exquisite gifts crafted by local makers. Te huarahi ki reira There is plenty of paid parking nearby or it’s a 15 min walk from Britomart station. There’s also a free tour in English tour every Tues, Weds, and Fridays at 1.30pm. He pārongo atu anō", "dates": {"start": "2025-09-20", "end": "2026-07-19", "text": "20 Sep 2025 - 19 Jul 2026"}, "price": "Free event", "location": "Auckland Art Gallery", "categories": ["Exhibitions", "Exhibitions", "Exhibitions", "Stay", "Hostel", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Apartments", "Stay", "Hotel", "Eat & Drink", "Cafes", "Eat & Drink", "Takeaways", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/artland-hero-image.jpg?ext=.jpg&crop=0,0,2000,1457", "updated_at": "2025-11-29T03:56:37Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/winter-season", "title": null, "description": "The winter brings a programme of three works celebrating the heritage of the Royal New Zealand Ballet and the contributions of outstanding artists from our past, present and future. View times At its heart is the New Zealand premiere of Sir Frederick Ashton’s , performed as a centenary and as part of Ashton Worldwide 2024–8. Completing the programme are two works created for the RNZB: Sarah Foster-Sproull’s exuberant , inspired by the rhythmic energy of La Folia, and Andrea Schermoly’s , a and the enduring fight for equality. Together, Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving.", "dates": {"start": "2026-07-25", "end": null, "text": "23 - 25 Jul, 2026"}, "price": "$35.00 - $145.00", "location": "Aotea Centre", "categories": ["Dance", "Ballet", "Dance", "Ballet", "Dance", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_151.jpg?ext=.jpg&crop=866,0,1054,768", "updated_at": "2025-11-29T03:56:38Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/the-sleeping-beauty", "title": null, "description": "To celebrate the summer, the returns: Greg Horsman’s fairytale version of . View times The age-old story of the princess who pricks her finger and falls into an enchanted sleep, only to be wakened by true love, is brought to life in by Gary Harris, and Tchaikovsky’s . A touch of wizardry from Wellington’s Wētā Workshop adds to the joy and wonder, making this the for audiences of all ages. 2011 saw the premiere of this glorious production, with the making of the ballet immortalised, reality television-style, in the second series of . More than 42,000 people saw the production around New Zealand. Choreographer Greg Horsman left the Royal New Zealand Ballet in 2012 to take up a new role at Queensland Ballet, and this production has now been staged there several times to great acclaim. Te wāhi He tīwhiri mō te rohe Check out the sculpture of celebrated Kiwi opera singer Dame Kiri Te Kanawa which sits on Level 3 of the Aotea Centre. It was created by local artist Terry Stringer and unveiled by Dame Kiri Te Kanawa herself when the auditorium was named in her honour in 2019. Te huarahi ki reira The Aotea Centre is a short walk up Queen Street from Waitematā Station, and the Civic car park is conveniently located beside the venue if you&rsquo;re driving.", "dates": {"start": "2026-12-12", "end": null, "text": "03 - 12 Dec, 2026"}, "price": "$40.00 - $195.00", "location": "Aotea Centre", "categories": ["Dance", "Ballet", "Dance", "Dance", "Ballet", "Stay", "Hostel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hostel", "Stay", "Hotel", "Eat & Drink", "Bakeries, Breakfast & Brunch, Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "Eat & Drink", "Takeaways", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_155.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:38Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/dazzlehands", "title": null, "description": "A curly tale for tamariki! A fabulous show for littlies (and their parents and grandparents!). View times Dazzlehands, the award-winning story of the persuasive pig who won’t take no for an answer, by Wellington author and illustrator Sacha Cotter and Josh Morgan, is a hot favourite with young audiences, on the mat at pre-school and as a much-requested bedtime story. Now, RNZB Principal Joshua Guillemot-Rodgerson and Education and Community Engagement Manager Lauren Byrne are thrilled to have turned Dazzlehands into a moving and grooving ballet bash for six performers plus narration, with enchanting original music by William Phillipson and laugh-out-loud character costumes by Victoria Gridley. Te wāhi He tīwhiri mō te rohe Leave plenty of spare time in case there’s traffic on the motorway or around the Takapuna village. Even better – get dinner or a pre-show drink nearby so you can soak up the bustling beachfront vibe. Te huarahi ki reira Bruce Mason Centre is 15-20 minutes by car from the city centre, and easily accessible by bus. The closest paid parking is the Killarney Street car park, operated by Auckland Transport.", "dates": {"start": "2026-04-11", "end": null, "text": "10 - 11 Apr, 2026"}, "price": null, "location": "Bruce Mason Centre", "categories": ["Dance", "Ballet", "Dance", "Ballet", "Dance", "Ballet", "Stay", "Holiday Homes", "Stay", "Hotel", "Stay", "Camping, Glamping , Motel", "Stay", "Motel", "Stay", "Holiday Homes", "Stay", "Motel", "Eat & Drink", "Bars, Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "See & Do", "Water sports & activities", "See & Do", "Spa & Wellness", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do", "Leisure & Entertainment", "See & Do"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_153.jpg?ext=.jpg&crop=433,0,1054,768", "updated_at": "2025-11-29T03:56:38Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/splore-festival-2026", "title": null, "description": "Set in a beguiling bay on the shores of Tāpapakanga Regional Park, is a boutique music & arts festival like no other. A three-day immersive entertainment extravaganza and the greatest costume party in Aotearoa. View times Splore is a beachside celebration where music, art and community gather beneath the pōhutukawa at Tāpapakanga Regional Park. Days drift from beach swims to dance-floor joy, kids darting between artworks, and friends sharing delicious kai under the trees. As evening arrives, stages glow, costumes shimmer and strangers feel like whānau. It’s playful, warm and genuinely welcoming, a place to rest or rave, reflect or be ridiculous. Salt on your skin, music in your chest, stars overhead. Life at its brightest. Alongside the music sits a generous programme of performance, arts, ceremony and wellbeing. You’ll find dancers, circus artists and storytellers moving through the park, while workshops offer movement, meditation and craft. The whenua shapes the festival. Splore works with Ngāti Whanaunga and Ngāti Pāoa to honour Tāpapakanga, uplifting mātauranga Māori and welcoming guests with care and connection. Pōwhiri opens the gathering and the stories of this place guide the experience. Culture sits at the heart of the celebration, held with respect. Splore also leads with sustainability. Its zero-waste approach, thoughtful design and long-term environmental kaupapa are recognised here and overseas. Everyone plays their part, helping protect the land, waters and wildlife that make Tāpapakanga so special. Come with curiosity. Be open. Be part of it. Te wāhi Tāpapakanga Regional Park", "dates": {"start": "2026-02-22", "end": null, "text": "20 - 22 Feb, 2026"}, "price": "From $295.00", "location": "Tāpapakanga Regional Park", "categories": ["Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Stay", "Stay", "Camping", "Stay", "Hostel", "Stay", "Holiday Homes", "Stay", "Boutique & Lodge, Glamping", "Stay", "Boutique & Lodge, Hotel", "Eat & Drink", "Farms", "Eat & Drink", "Restaurants", "Eat & Drink", "Pubs, Restaurants", "Eat & Drink", "Breweries", "Eat & Drink", "Restaurants, Wineries", "Eat & Drink", "Breakfast & Brunch, Cafes", "See & Do", "Cycling & Biking", "See & Do", "Cycling & Biking", "See & Do", "Cycling & Biking", "See & Do", "Nature & Wildlife, Sightseeing", "See & Do", "Nature & Wildlife", "See & Do", "Adventure & Adrenaline, Scenic Flights, Sightseeing"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/original_129.png?ext=.png&crop=538,0,1054,768", "updated_at": "2025-11-29T03:56:39Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/aucklands-international-buskers-festival", "title": null, "description": "Get ready for four epic days of street magic, laughs, and jaw-dropping talent! View times Te wāhi Wynyard Quarter, 82 Wyndham Street, Freemans Bay, Auckland He pārongo atu anō", "dates": {"start": "2026-01-26", "end": null, "text": "23 - 26 Jan, 2026"}, "price": "Free event", "location": "Wynyard Quarter, 82 Wyndham Street, Freemans Bay, Auckland", "categories": ["Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Apartments", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars, Cocktail Bars, Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Rooftop Bars", "See & Do", "Sightseeing, Tours", "See & Do", "Tours", "See & Do", "Boat Cruises", "See & Do", "Leisure & Entertainment", "See & Do", "Water sports & activities", "See & Do", "Tours"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/2143428-914633-35.jpg?ext=.jpg&crop=185,0,692,504", "updated_at": "2025-11-29T03:56:39Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/downtown-christmas-market", "title": null, "description": "Celebrate the magic of the season at the Downtown Christmas Market — a festive fusion of the much-loved General Collective and Britomart Saturday Market, uniting for one spectacular Christmas shopping experience in the heart of the city. View times Wander through Te Komititanga and Takutai Square, where you’ll find a vibrant mix of beautifully curated stalls brimming with handcrafted gifts, summer fashion, homewares, art, toys, and gourmet treats — all made with love by talented local creators. Feel the spirit of the season come alive beneath the giant Christmas tree — surrounded by festive market stalls, delicious bites, and the joyful buzz of Christmas in the city. ✨ Whether you’re searching for the perfect gift or simply soaking up the atmosphere, it’s the perfect way to celebrate a merry day out. Downtown Christmas Market | Saturday 13 December 2025 - Takutai Square | Britomart Saturday Market: 8.00am – 3.00pm - Te Komititanga | General Collective : 10.00am – 3.00pm Just a short stroll away, Queens Wharf will be buzzing with a Kids Christmas DIY activation — perfect for little makers to get creative and add their own handmade touch to the festive fun. Make a day of it — shop local, grab lunch, and enjoy the Christmas magic in the heart of the city. Brought to you by the Auckland Council whānau and the city centre targeted rate. ✨ See you there for a day of festive fun, local love, and family joy! Te wāhi Te Komititanga Square, Auckland CBD, Auckland He pārongo atu anō", "dates": {"start": "2025-12-13", "end": null, "text": "13 Dec 2025"}, "price": "Free event", "location": "Te Komititanga Square, Auckland CBD, Auckland", "categories": ["Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Hotel", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants, Rooftop Bars", "Eat & Drink", "Restaurants", "Eat & Drink", "Eat & Drink", "Takeaways", "Eat & Drink", "Restaurants", "See & Do", "Tours", "See & Do", "Tours", "See & Do", "Tours", "See & Do", "Sightseeing, Tours", "See & Do", "Water sports & activities", "See & Do", "Tours"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/2136222-911447.jpg?ext=.jpg&crop=127,0,2746,2001", "updated_at": "2025-11-29T03:56:39Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/ponsonby-christmas-market-day-general-collective-market", "title": null, "description": "Celebrate the magic of the season at the Ponsonby Christmas Market Day on Saturday 6 December, 10am – 2pm! View times The entire stretch of Ponsonby Road will come alive with festive energy as retailers open onto the street, offering exclusive Christmas specials and gifts galore. As part of this vibrant day, General Collective will showcase over 30 curated stalls between Pember Reeves Street and Franklin Road, featuring beautifully crafted, New Zealand–made and designed treasures. Discover thoughtful gifts for loved ones, festive treats for little ones, and even something special for your four-legged friends. Bring your friends, family, and pups to soak up the lively atmosphere, enjoy live entertainment, and immerse yourself in the Christmas spirit. Then stay local — grab lunch, enjoy cocktail hour, and celebrate the season Ponsonby-style. Shop local. Celebrate creativity. Experience the festive buzz of Ponsonby Christmas Market Day! Te wāhi 199 Ponsonby Road, Ponsonby, Auckland He pārongo atu anō", "dates": {"start": "2025-12-06", "end": null, "text": "06 Dec 2025"}, "price": "Free event", "location": "199 Ponsonby Road, Ponsonby, Auckland", "categories": ["Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Festival & Lifestyle", "Stay", "Boutique & Lodge", "Stay", "Hotel", "Stay", "Hotel", "Stay", "Boutique & Lodge", "Stay", "Motel", "Stay", "Holiday Homes", "Eat & Drink", "Restaurants", "Eat & Drink", "Restaurants", "Eat & Drink", "Bars", "Eat & Drink", "Bars", "Eat & Drink", "Bars, Cafes", "Eat & Drink", "Restaurants", "See & Do", "Leisure & Entertainment", "See & Do", "See & Do", "Tours", "See & Do", "Spa & Wellness", "See & Do", "Spa & Wellness", "See & Do"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/2136059-911392.jpg?ext=.jpg&crop=426,0,3425,2496", "updated_at": "2025-11-29T03:56:40Z"}
{"source": "aucklandnz", "url": "https://www.aucklandnz.com/events-hub/events/li-ronghao", "title": null, "description": "JP Media & Magic Sound. Li Ronghao “Dark Horse” World Tour. The world is yet to be decided, and we are all dark horses View times , one of Chinese pop’s most influential singer-songwriters, first rose to fame with heartfelt hits like Model, Li Bai, and King of Comedy, songs that defined a new era of contemporary Chinese music. Over the past decade, his unique voice, lyrical storytelling, and genre-crossing creativity have earned him millions of fans and numerous awards across Asia. In 2025, Ronghao Li’s The Dark Horse World Tour showcases both his latest works and timeless favourites, blending emotion, energy, and world-class production. Following sold-out performances across major cities, the tour now arrives in New Zealand for the very first time. Join Ronghao Li in Auckland for a spectacular evening of music that bridges generations and cultures—a rare opportunity to experience one of Asia’s most dynamic and beloved artists live on stage. Te wāhi He tīwhiri mō te rohe Large events often have shuttle buses operate between The Trusts Arena and major transport hubs – check your ticket before planning your trip. Te huarahi ki reira It takes 18-25 minutes by car to get to The Trusts Arena from the city centre, provided it’s not rush hour. The Trusts Arena is located just off the Lincoln Road exit of the Northwestern Motorway. He pārongo atu anō", "dates": {"start": "2025-12-05", "end": null, "text": "05 Dec 2025"}, "price": "From $244.00", "location": "The Trusts Arena", "categories": ["Music", "Live concert", "Music", "Festival", "Music", "Live concert", "Music", "Live concert", "Stay", "Hotel", "Stay", "Motel", "Stay", "Camping", "Stay", "Bed & Breakfast", "Stay", "Boutique & Lodge", "Stay", "Hotel", "Eat & Drink", "Cafes", "Eat & Drink", "Cafes", "Eat & Drink", "Restaurants", "Eat & Drink", "Cafes", "Eat & Drink", "Breakfast & Brunch, Cafes", "Eat & Drink", "Restaurants, Takeaways", "See & Do", "Adventure & Adrenaline", "See & Do", "Leisure & Entertainment", "See & Do", "Tours", "See & Do", "Tours", "See & Do", "Leisure & Entertainment", "See & Do", "Tours"], "image": "https://www.aucklandnz.com/media/media/tau/tau_media/events/1900900.jpg?ext=.jpg&crop=665,0,1235,900", "updated_at": "2025-11-29T03:56:40Z"}
